<div data-type="part" class="green">
 <header>
 <h1><img src="../images/sections/04/PreparingData-icon-broom-fr.png" />Preparing data</h1>
 </header>
 <section class="content">
<p>Une fois que vous avez rassembl&eacute; les ingr&eacute;dients dont vous avez besoin pour votre recette vous devez les pr&eacute;parer avant de commencer la cuisson. Ceci est l&#39;&eacute;tape de pr&eacute;paration, celle o&ugrave; vous lavez vos ingr&eacute;dients, vous les coupez, et au final obtenez des ingr&eacute;dients pr&ecirc;ts &agrave; cuire. Beaucoup d&#39;entre nous n&rsquo;aiment pas cette &eacute;tape car elle n&rsquo;est pas tr&egrave;s amusante.   Toutefois, vous savez combien le r&eacute;sultat final peut souffrir si cette &eacute;tape est b&acirc;cl&eacute;e ou pire si elle n&rsquo;est pas du tout r&eacute;alis&eacute;e !  Imaginez servir un plat avec des l&eacute;gumes sales !</p>
 
<p>Comme en cuisine, nombreux sont ceux qui d&eacute;testent &eacute;galement l&#39;&eacute;tape de pr&eacute;paration lorsque vous travaillez avec des donn&eacute;es, mais elle est n&eacute;cessaire. Vous ne pouvez pas saisir des donn&eacute;es, vous lancer dans une visualisation et esp&eacute;rer un r&eacute;sultat spectaculaire. Si vous voulez cr&eacute;er de bons graphiques, vous devez vous assurer que vos donn&eacute;es sont correctement pr&eacute;par&eacute;es. Certaines de vos donn&eacute;es peuvent avoir besoin d&#39;&ecirc;tre s&eacute;par&eacute;es en diff&eacute;rents groupes ou transofrm&eacute;es.   Certaines peuvent avoir besoin d&rsquo;&ecirc;tre converties;  d&rsquo;autres peuvent avoir besoin d&#39;&ecirc;tre nettoy&eacute;es, comme les l&eacute;gumes.</p> 
 

<p>Dans cette section, nous allons parler de quelques-unes des t&acirc;ches de pr&eacute;paration et de nettoyage couramment rencontr&eacute;es lors de l&#39;utilisation des donn&eacute;es et d&#8203;es moyens &agrave; mettre en &oelig;uvre pour y passer le moins de temps possible. Dans tous les cas, si vous obtenez des donn&eacute;es correctement pr&eacute;par&eacute;es, le r&eacute;sultat de l&#39;&eacute;tape de visualisation n&rsquo;en sera que meilleur.</p>
 </section>
</div>
