<section data-type="foreword">
 <h1>Avant-propos</h1>
 <p>Nous sommes entour&eacute;s de donn&eacute;es et cela depuis toujours. &Agrave; travers l&#39;Histoire, il a toujours &eacute;t&eacute; possible de tout quantifier. Il &eacute;tait ainsi th&eacute;oriquement possible de tout compter : chaque &ecirc;tre humain, chaque battement de c&oelig;ur, chaque mesure prise, chaque &eacute;toile ayant rayonn&eacute;, chaque mot prononc&eacute; ou &eacute;crit. Chacun de ces &eacute;l&eacute;ments collectifs peut &ecirc;tre repr&eacute;sent&eacute; par un nombre. Or, c&#39;est seulement depuis peu que la technologie permet de mettre sur le devant de la sc&egrave;ne ces nombres cach&eacute;s avec efficacit&eacute; et d&#39;am&eacute;liorer notre connaissance de la condition humaine.</p>

 <p>Mais qu&#39;est-ce que cela signifie exactement ? Quels sont les effets culturels de la facilit&eacute; d&#39;acc&egrave;s aux donn&eacute;es ? Cela signifie, d&#39;une part, qu&#39;il faut que nous soyons mieux au fait de nos donn&eacute;es. Cela signifie aussi que nous devons &ecirc;tre davantage conscients de leur design. Selon le vieil adage, les statistiques mentent. Eh bien, les visualisations de donn&eacute;es mentent &eacute;galement. Comment est-il d&#39;abord possible de lire efficacement des visualisations de donn&eacute;es et, ensuite, d&#39;en concevoir de mani&egrave;re &agrave; ce qu&#39;elles transmettent l&#39;histoire inh&eacute;rente aux donn&eacute;es ?</p>
 
 <blockquote>
  Au croisement de l&#39;art et de l&#39;algorithmique, la visualisation des donn&eacute;es r&eacute;sume sch&eacute;matiquement l&#39;information pour approfondir la connaissance de ces donn&eacute;es en l&#39;enveloppant dans une sorte de respect m&ecirc;l&eacute; d&#39;admiration.
  <p data-type="attribution"><a href="http://www.businessweek.com/innovate/content/aug2009/id20090811_137179.htm" target="_blank">Maria Popova, Stories for the Information Age, Businessweek</a></p>
 </blockquote>

 <p>Ma description pr&eacute;f&eacute;r&eacute;e de la visualisation des donn&eacute;es est celle de la blogueuse tr&egrave;s inspir&eacute;e Maria Popova selon laquelle la visualisation des donn&eacute;es est &laquo; au croisement de l&#39;art et de l&#39;algorithmique &raquo;. Apprendre l&#39;histoire de la visualisation des donn&eacute;es, c&#39;est un peu devenir un cartographe, un explorateur et un statisticien de salon.</p> 
 
 <p>Les premi&egrave;res explorations visuelles des donn&eacute;es se sont principalement concentr&eacute;es sur de petits bouts de donn&eacute;es collect&eacute;es pour renforcer les connaissances humaines en mati&egrave;re de g&eacute;ographie, essentiellement par l&#39;interm&eacute;diaire de la cartographie. &Agrave; partir des premi&egrave;res cartes consacr&eacute;es du monde au 13&egrave;me si&egrave;cle, les scientifiques, les math&eacute;maticiens, les philosophes et les marins se sont servis des math&eacute;matiques pour visualiser l&#39;invisible. Les &eacute;toiles et les soleils ont &eacute;t&eacute; identifi&eacute;s, tandis que les cartes des c&ocirc;tes et des voies de navigation ont &eacute;t&eacute; &eacute;tablies. Par essence, la visualisation des donn&eacute;es a permis de tracer les lignes, les points et les coordonn&eacute;es qui ont donn&eacute; forme au monde physique et &agrave; notre place en son sein. Elle permettait de r&eacute;pondre &agrave; des questions telles que : &laquo; O&ugrave; suis-je ? &raquo;, &laquo; Comment me rendre &agrave; tel endroit ? &raquo; et &laquo; Est-ce loin ? &raquo;.</p>

 <p>Ces premi&egrave;res visualisations de donn&eacute;es ont aussi servi &agrave; r&eacute;pondre aux questions de sant&eacute; publique. La carte du chol&eacute;ra &agrave; Londres en 1854 de l&#39;&eacute;pid&eacute;miologiste John Snow a &eacute;t&eacute; dress&eacute;e pour enregistrer les cas de chol&eacute;ra dans un quartier de Londres afin de pouvoir remonter jusqu&#39;au puits &agrave; l&#39;origine de l&#39;&eacute;pid&eacute;mie. Les renseignements tir&eacute;s des listes de noms, de num&eacute;ros et de lieux ont alors permis de convaincre la population londonienne d&#39;installer des r&eacute;seaux d&#39;&eacute;gouts pour r&eacute;duire la prolif&eacute;ration et la propagation de la maladie. Le cerveau humain est particuli&egrave;rement dou&eacute; pour reconna&icirc;tre les mod&egrave;les. Une bonne visualisation des donn&eacute;es, comme celle de Snow, optimise les repr&eacute;sentations de ces mod&egrave;les en faisant un usage efficace de la th&eacute;orie de la forme de la Gestalt, des principes du design et de la couleur (ou son absence, selon le cas).</p>

 <p>La visualisation de Snow et son absence de couleur optimise les th&eacute;ories de la perception visuelle de la Gestalt, plus particuli&egrave;rement &laquo; la Proximit&eacute; &raquo; et &laquo; la Figure et le Fond &raquo;. Les petits points noirs, chacun repr&eacute;sentant un cas de chol&eacute;ra, sont de petites formes noires en contraste avec l&#39;arri&egrave;re-plan : sur cette carte, les lignes et les espaces blancs repr&eacute;sentent les rues. La proximit&eacute; de ces points autour du puits contamin&eacute; est ce qui a permis &agrave; Snow de d&eacute;terminer l&#39;origine exacte de l&#39;&eacute;pid&eacute;mie. De nos jours, m&ecirc;me avec nos syst&egrave;mes informatiques avanc&eacute;s et nos outils perfectionn&eacute;s de cr&eacute;ation de visualisation de donn&eacute;es, la marge de man&oelig;uvre pour am&eacute;liorer l&#39;efficacit&eacute; de cette carte demeure faible. Elle est simple, belle et r&eacute;aliste. Bref, c&#39;est une visualisation de donn&eacute;es qui a sauv&eacute; des vies.</p>

 <figure><img src="../images/sections/01/cholera.png" alt="Cholera Map" /></figure>

 <p>Florence Nightingale, plus c&eacute;l&egrave;bre pour ses talents d&#39;infirmi&egrave;re que pour ses comp&eacute;tences d&#39;analyse, n&#39;en demeure pas moins une data scientist et une narratrice &eacute;m&eacute;rite. Gr&acirc;ce aux donn&eacute;es pr&eacute;sent&eacute;es &agrave; l&#39;aide de son diagramme dit de Coxcomb (&eacute;galement connu sous l&#39;appellation de diagramme polaire ou diagramme de rose), elle a convaincu l&#39;arm&eacute;e britannique d&#39;adopter des mesures sanitaires en montrant que la majorit&eacute; des morts de la guerre de Crim&eacute;e avait succomb&eacute; &agrave; des maladies &eacute;vitables caus&eacute;es par les effroyables conditions sanitaires r&eacute;gnant dans les h&ocirc;pitaux. &laquo; Pourquoi sommes-nous malades ? &raquo;, s&#39;est-elle demand&eacute; avant de r&eacute;pondre elle-m&ecirc;me &agrave; cette question en effectuant une pr&eacute;sentation visuelle des donn&eacute;es.</p>

 <figure><img src="../images/sections/01/nightingale.jpg" alt="Nightingale Visualization" /></figure>

 <p>Lorsqu&#39;on observe ce diagramme, il est clair que les maladies &eacute;vitables surpassent en nombre toutes les autres causes de d&eacute;c&egrave;s. La zone bleue repr&eacute;sente les d&eacute;c&egrave;s dus aux maladies &eacute;vitables mesur&eacute;s depuis le centre, la zone rouge ceux r&eacute;sultant de blessures et la zone noire ceux imputables &agrave; toutes les autres causes. Parmi les principes de conception employ&eacute;s ici figure l&#39;ajout de couleurs afin de tirer parti de davantage de principes de la Gestalt : la &laquo; similarit&eacute; &raquo; et la &laquo; continuit&eacute; &raquo;. La couleur facilite le rattachement des segments aux diff&eacute;rentes cat&eacute;gories. Elle permet aussi d&#39;attirer l&#39;attention sur une trajectoire continue autour du graphique, facilitant ainsi la lecture.</p>

 <p>Il r&egrave;gne toutefois un d&eacute;bat sur la qualit&eacute; de ce diagramme. Certains pr&eacute;tendent que c&#39;est l&#39;une des meilleures et des plus m&eacute;morables visualisations jamais cr&eacute;&eacute;es, pas seulement en raison de sa puissance de communication visuelle. On s&#39;en souvient en raison du changement qu&#39;elle a inspir&eacute;. D&#39;autres la tournent en d&eacute;rision en affirmant qu&#39;il s&#39;agit seulement d&#39;un superbe graphique en secteurs, souffrant de la m&ecirc;me repr&eacute;sentation trompeuse de l&#39;information du fait de la d&eacute;formation des donn&eacute;es : en termes de perception visuelle, il est difficile pour un &ecirc;tre humain de juger pr&eacute;cis&eacute;ment des mesures repr&eacute;sent&eacute;es par les diff&eacute;rences de zone. Malgr&eacute; leur omnipr&eacute;sence, les graphiques en secteurs sont, pour cette raison m&ecirc;me, un moyen incroyablement peu adapt&eacute; &agrave; la visualisation des donn&eacute;es. Un graphique &agrave; barres empil&eacute;es avec des lignes de r&eacute;f&eacute;rence, m&ecirc;me s&#39;il n&#39;est pas aussi beau ou visuellement intriguant, aurait fait passer un message de mani&egrave;re bien plus efficace et aurait faciliter la lecture.</p>

 <p>Nous continuons de poser les m&ecirc;mes types de questions que celles pos&eacute;es par Snow et Nightingale, et, en tant qu&#39;&ecirc;tres humains dou&eacute;s de curiosit&eacute;, nous continuerons toujours probablement. Mais, les principales diff&eacute;rences aujourd&#39;hui r&eacute;sident dans le fait que nous disposons de moyens permettant de collecter des ensembles de donn&eacute;es bien plus importants et d&#39;une plus grande richesse. Et nous avons aussi les outils pour automatiser la visualisation de nos donn&eacute;es.</p>

 <p>Cela ne veut pas dire que les petits ensembles de donn&eacute;es, comme ceux &eacute;tudi&eacute;s par Nightingale et Snow, pr&eacute;sentent moins de valeur ou sont moins int&eacute;ressants. Gr&acirc;ce aux technologies de collecte de donn&eacute;es et aux avanc&eacute;es de l&#39;informatique embarqu&eacute;e (wearable computing) et de l&#39;Internet des objets (Internet of Things), c&#39;est tout le contraire. Mon ami Jen Lowe, data scientist et artiste vivant &agrave; New York, a <a href="http://datatelling.com/projects/onehumanheartbeat/" target="_blank">r&eacute;cemment publi&eacute; les battements de son c&oelig;ur sur Internet</a>. En repr&eacute;sentation statique, ils seraient beaux, mais pas sp&eacute;cialement informatifs. Or, en ajoutant de l&#39;interactivit&eacute; et des flux de donn&eacute;es en direct de ses battements cardiaques au moyen de capteurs portables et d&#39;appels d&#39;API, son rythme cardiaque se transforme en une cr&eacute;ature num&eacute;rique vivante visible par n&#39;importe quel internaute, de n&#39;importe o&ugrave; et &agrave; tout moment. On obtient alors un aper&ccedil;u d&#39;un autre &ecirc;tre humain comme jamais auparavant.</p>

 <p>Cet aper&ccedil;u unique est l&#39;essence-m&ecirc;me des donn&eacute;es, qu&#39;elles soient de petite ou de grande taille, et du r&eacute;sultat des outils permettant d&#39;y avoir acc&egrave;s, de les sonder, de les fouiller, de les diss&eacute;quer, de les visualiser et, avec un peu de chance, d&#39;en saisir la signification. Des outils qui, par la d&eacute;mocratisation de la visualisation des donn&eacute;es, nous permettent de changer notre regard sur le monde, en cr&eacute;ant des images de l&#39;humanit&eacute; selon diff&eacute;rentes perspectives et en mettant l&#39;accent sur des histoires &agrave; propos des hommes et du monde qui passaient auparavant inaper&ccedil;ues pour nous permettre de mieux nous conna&icirc;tre comme jamais auparavant.</p>

 <p data-type="author">Callie Neylan<br /> 
 Senior Designer, Microsoft</p>

</section>
