<section data-type="introduction">
<h1>Mode d&#39;emploi de cet ouvrage</h1>

<h2>Structure</h2>

<p>Les chapitres de l&#39;ouvrage suivent de pr&egrave;s la proc&eacute;dure effective &agrave; respecter avant de pouvoir visualiser les donn&eacute;es, de la conception de l&#39;enqu&ecirc;te jusqu&#39;&agrave; la visualisation des donn&eacute;es en passant par leur collecte. C&#39;est tr&egrave;s simple en r&eacute;alit&eacute;. Si vous &ecirc;tes novice en la mati&egrave;re, vous &ecirc;tes probablement mieux de lire ce livre dans son int&eacute;gralit&eacute;. Aussi, si vous connaissez d&eacute;j&agrave; un peu le sujet mais n&rsquo;&ecirc;tes pas un expert, vous pouvez directement passer aux chapitres qui vous int&eacute;ressent le plus ! Vous n&rsquo;aurez pas trop de mal &agrave; suivre m&ecirc;me si vous sautez quelques chapitres.</p>

<div data-type="warning">
<p>Si vous n&#39;avez pas beaucoup d&#39;exp&eacute;rience (voire aucune) de la conception d&#39;enqu&ecirc;tes, ainsi que de la collecte et de la visualisation de donn&eacute;es, il est probablement pr&eacute;f&eacute;rable d&rsquo;approfondir vos connaissances sur ces sujets avant de passer &agrave; la collecte des donn&eacute;es. Certaines visualisations que vous souhaitez r&eacute;aliser peuvent exiger, au bout du compte, des d&eacute;cisions bien planifi&eacute;es en amont. Si vous lisez ce livre chapitre apr&egrave;s chapitre, il est fort probable que vous serez amen&eacute; &agrave; prendre en compte certains points avant qu&#39;il ne soit trop tard !</p>
</div>

<h2>D&eacute;finitions et termes courants</h2>

<p>Cet ouvrage emploie parfois des termes et expressions techniques relevant du sujet trait&eacute;. Dans ce cas, un lien vers le terme en question dans le <a class="glossterm" href="glossary01.html#" target="_blank">glossaire</a> est fourni. Nous vous invitons &agrave; vous y r&eacute;f&eacute;rer &agrave; tout moment, mais nous nous effor&ccedil;ons de vous mettre sur la bonne voie lors de l&#39;emploi d&#39;un nouveau terme.</p>

<h2>Chapitres avanc&eacute;s</h2>

<p>Cet ouvrage comporte certains chapitres dont le contenu s&#39;adresse &agrave; un public averti et d&eacute;passe les simples bases que vous devez conna&icirc;tre. Ces chapitres sont signal&eacute;s par un avertissement plac&eacute; au d&eacute;but afin que vous sachiez qu&#39;ils traitent de sujets plus avanc&eacute;s. Vous n&#39;&ecirc;tes pas oblig&eacute; de les lire (bien que nous le recommandions !) pour bien comprendre le sujet abord&eacute; ; nous estimons cependant qu&#39;il est parfois utile de vous faciliter l&#39;acc&egrave;s &agrave; l&#39;information et de vous faire b&eacute;n&eacute;ficier d&#39;une meilleure compr&eacute;hension du sujet.</p>

<h2>Exemples : le bon, le mauvais et le tr&egrave;s mauvais</h2>

<p>Les exemples utilis&eacute;s tout au long du livre constituent l&#39;un des &eacute;l&eacute;ments que nous pr&eacute;f&eacute;rons dans cet ouvrage (bien que nous manquions un peu d&#39;impartialit&eacute;) : bien des notions pouvant en effet devenir particuli&egrave;rement abstraites, un exemple concret permet de r&eacute;ellement simplifier les choses. Ceci &eacute;tant dit, diff&eacute;rentes conventions servent &agrave; distinguer les bons exemples des mauvais, ce qu&#39;il faut faire de ce qu&#39;il ne faut pas faire, etc.</p>

<table class="custom question-and-answer">
	<tbody>
		<tr>
   <th>Questions</th>
			<th>R&eacute;ponse</th>
  </tr>
  <tr>
   <td>Que cherche-t-on?</td>
   <td>La r&eacute;ponse est ici.</td>
  </tr>
 </tbody>
</table>

<h3>Bons exemples</h3>

<p>Les bons exemples sont toujours signal&eacute;s par une barre verte ou bleue, une coche ou le pictogramme d&#39;un pouce lev&eacute;, suivant ce qui est pr&eacute;sent&eacute; (graphique, table de donn&eacute;es, proc&eacute;dure, etc.).</p>

<h3>Mauvais exemples</h3>

<p>&Agrave; l&#39;inverse, ce qu&#39;il ne faut <strong>pas</strong> faire dans un cas pr&eacute;cis est signal&eacute; par une barre grise, un X majuscule barrant l&#39;exemple erron&eacute; ou le pictogramme d&#39;un pouce vers le bas. Ces diff&eacute;rentes conventions sont illustr&eacute;es ci-dessous :</p>

<table class="custom good-and-bad">
	<tbody>
		<tr>
			<th>Pour</th>
			<th>Contre</th>
  </tr>
  <tr>
   <td>Avantages de cette action</td>
   <td>Inconv&eacute;nients de cette action</td>
  </tr>
 </tbody>
</table>

<table class="custom yes-and-no">
	<tbody>
		<tr>
			<th>&Agrave; faire</th>
			<th>&Agrave; ne pas faire</th>
  </tr>
  <tr>
   <td>Cette colonne indique les bons conseils.</td>
   <td>Cette colonne indique ce qu&#39;il faut &eacute;viter.</td>
  </tr>
 </tbody>
</table>

<p>Les bons et les mauvais exemples sont parfois signal&eacute;s par des images.</p>

<figure><img alt="Unclear radio buttons" src="../images/sections/03/HowToUse-correct-age-groups-fr.png" /></figure>

<p>Une image pr&eacute;c&eacute;d&eacute;e d&#39;un cadre gris avec un &laquo; x &raquo; indique un exemple d&#39;une pratique qu&#39;il vaut mieux &eacute;viter.</p>

<figure>
 <h2 class="avoid">Exemple de ce qu&#39;il ne faut pas faire</h2>
 <img alt="3D pie" src="../images/sections/01/HowToUse-3D-pie-fr.png" />
</figure>

<h3>Avertissements</h3>

<p>&Agrave; d&#39;autres occasions, nous voulons simplement nous assurer que vous faites attention et vous rappelez un point important &agrave; prendre en consid&eacute;ration. Dans ce cas, un avertissement symbolis&eacute; par un point d&#39;exclamation rouge est employ&eacute;. (En fait, nous avons en d&eacute;j&agrave; utilis&eacute; un au d&eacute;but de ce chapitre !)</p>

<h2>Contributions et corrections</h2>

<p>Si vous notez une coquille &agrave; la lecture de ce livre ou si vous pensez que certaines explications sont incorrectes ou ambig&uuml;es, ou encore si vous avez des id&eacute;es pour r&eacute;diger une nouvelle section ou un nouveau chapitre, n&#39;h&eacute;sitez pas &agrave; revenir vers nous ! Vous avez deux moyens &agrave; votre disposition : vous pouvez <a href="https://docs.google.com/a/infoactive.us/forms/d/1LsafHUV-BPQHmQsXHR40UsXS4f0c_jySgMrF9vMloF4/viewform?usp=send_form" target="_blank">remplir ce formulaire</a> ou, si vous avez un profil un petit peu plus technique, suivre les indications <a href="https://github.com/infoactive/data-design#can-i-make-edits" target="_blank">sur GitHub</a>.</p>

<p>De m&ecirc;me, si vous avez des doutes sur un point apr&egrave;s avoir lu les explications, n&#39;h&eacute;sitez pas &agrave; nous demander des &eacute;claircissements ! Il est probable que nous ne nous sommes pas rendus compte que ces explications auraient pu &ecirc;tre am&eacute;lior&eacute;es (mais cela ne signifie pas que nous ne souhaitons pas le faire !). Envoyez-nous un message via Tweeter &agrave; l&#39;adresse <a href="http://twitter.com/DataDesignBook" target="_blank">@DataDesignBook</a> ou un e-mail &agrave; <a href="mailto:ebook@infoactive.co?subject=Data Design Questions" target="_blank">ebook@infoactive.co</a>, ou consultez le site <a href="http://helpmeviz.com/" target="_blank">HelpMeViz</a> pour acc&eacute;der &agrave; des ressources compl&eacute;mentaires. Nous nous efforcerons de r&eacute;pondre &agrave; votre question du mieux que nous pourrons et veillerons &agrave; ce que les &eacute;ditions ult&eacute;rieures int&egrave;grent ces am&eacute;liorations.</p>
</section>
