<section data-type="preface">
<h1>Pr&eacute;face</h1>

<p>Je n&#39;avais jamais &eacute;crit de livre auparavant, encore moins un livre open source international avec l&#39;aide de plus de 50 contributeurs provenant de 14 pays diff&eacute;rents.</p>

<p>Tout a commenc&eacute; par un message sur Kickstarter :</p>

<blockquote>Salut Trina ! Ici c&#39;est la mordue de stats de Chicago... Est-ce que tu envisages d&#39;inclure des didacticiels sur les techniques de base de s&eacute;lection et de nettoyage de donn&eacute;es pour les utilisateurs qui n&#39;ont aucune formation en statistiques ?</blockquote>

<p>&Agrave; l&#39;&eacute;poque, je n&#39;imaginais pas que ce message se transformerait en un livre, une communaut&eacute; et une initiative mondiale pour rendre les connaissances plus accessibles.</p>

<p>L&#39;auteur du message, Dyanna Gregory, &eacute;tait une programmeuse statisticienne qui connaissait les d&eacute;fis d&rsquo;enseigner les statistiques de niveau universitaire &agrave; ceux qui ne se consid&egrave;rent pas comme des passionn&eacute;s de math&eacute;matiques. J&#39;&eacute;tais une entrepreneure en passe de cr&eacute;er Infoactive, une application Web de cr&eacute;ation d&#39;infographies interactives et de visualisations de donn&eacute;es. J&#39;&eacute;tais &eacute;galement membre de l&#39;institut de journalisme Donald W. Reynolds et j&#39;avais pour objectif de trouver des moyens de simplifier le processus de cr&eacute;ation de visualisations de donn&eacute;es dans les salles de r&eacute;daction. J&#39;avais lanc&eacute; une campagne Kickstarter de soutien &agrave; Infoactive qui avait attir&eacute; pr&egrave;s de 1 500 donateurs particuli&egrave;rement heureux &agrave; l&#39;id&eacute;e d&#39;&eacute;liminer les obstacles li&eacute;es &agrave; la visualisation de donn&eacute;es.</p>

<p>Nous partagions tous une m&ecirc;me vision: simplifier le processus.</p>

<p>Mais exploiter des donn&eacute;es est parfois loin d&#39;&ecirc;tre simple. Les donn&eacute;es diff&egrave;rent par leur forme, leur taille et leur saveur. Il n&#39;existe aucune solution universelle de collecte, de compr&eacute;hension et de visualisation de l&#39;information. Certaines personnes passent des ann&eacute;es &agrave; &eacute;tudier ce sujet &agrave; travers la statistique, les math&eacute;matiques, le design et l&#39;informatique. Et bien d&#39;autres souhaitent pouvoir b&eacute;n&eacute;ficier d&#39;un petit coup de pouce pour se lancer.</p>

<p>Dyanna et moi avons alors commenc&eacute; &agrave; esquisser les contours d&#39;une ressource qui utiliserait un langage clair et simple. La facilit&eacute; d&#39;utilisation &eacute;tait notre priorit&eacute; N&deg;1. M&ecirc;me s&#39;il est difficile de r&eacute;diger un ouvrage technique accessible aux non-techniciens, nous estimions qu&#39;il s&#39;agissait l&agrave; d&#39;un objectif important. Nous voulions cr&eacute;er une ressource libre, bien con&ccedil;ue, agr&eacute;able &agrave; lire et facile &agrave; comprendre.</p>

<p>Bien &eacute;videmment, l&#39;information se devait d&#39;&ecirc;tre exacte, et nous souhaitions aborder divers concepts de donn&eacute;es. Il nous fallait des r&eacute;dacteurs techniques dot&eacute;s d&#39;une connaissance approfondie des donn&eacute;es, des math&eacute;matiques et de la statistique. Nous avions aussi besoin de r&eacute;lecteurs capables de passer le contenu au peigne fin pour le simplifier, faciliter sa compr&eacute;hension et garantir le ton amical et interactif des chapitres. Notre mission consistait &agrave; traduire le jargon en langage clair afin de rendre les notions techniques plus accessibles aux non-sp&eacute;cialistes.</p>

<p>Dyanna et moi avons alors lanc&eacute; un appel aux contributeurs. Aucune de nous deux ne s&#39;attendait &agrave; une r&eacute;ponse aussi forte et positive. Franchement, cela nous a litt&eacute;ralement renvers&eacute;es. Les messages ont commenc&eacute; &agrave; affluer du monde entier, les personnes int&eacute;ress&eacute;es nous racontant leur exp&eacute;rience en mati&egrave;re d&#39;exploitation de donn&eacute;es et de design, voire leur manque d&#39;exp&eacute;rience en ce domaine. Ce qui nous a le plus frapp&eacute;, c&#39;est le nombre de personnes se d&eacute;clarant non-sp&eacute;cialiste des math&eacute;matiques, mais &agrave; la recherche d&#39;une ressource capable de les initier aux concepts de donn&eacute;es de mani&egrave;re simple, abordable, voire amusante. Elles &eacute;taient motiv&eacute;es par la volont&eacute; de contribuer financi&egrave;rement et de donner de leur temps &agrave; la r&eacute;alisation de ce projet.</p>

<p>Dyanna et moi-m&ecirc;me avons donn&eacute; le coup d&#39;envoi du projet en f&eacute;vrier en organisant un marathon de l&#39;&eacute;criture Write-A-Thon &agrave; Chicago. Nous avons invit&eacute; des r&eacute;dacteurs, des analystes de donn&eacute;es, des d&eacute;veloppeurs, des designers et bien d&#39;autres personnes &agrave; se r&eacute;unir pour discuter globalement du projet. Nous avons longuement r&eacute;fl&eacute;chi au processus, discut&eacute; des donn&eacute;es, d&eacute;marr&eacute; nos ordinateurs et commenc&eacute; &agrave; r&eacute;diger.</p>

<p>Apr&egrave;s quoi, nous avons pris contact avec toutes les personnes qui s&#39;&eacute;taient propos&eacute;es d&#39;apporter leur contribution et nous avons commenc&eacute; &agrave; imaginer qui allait faire quoi. Pour un projet enti&egrave;rement b&eacute;n&eacute;vole avec plus de 50 contributeurs aux quatre coins du monde, il &eacute;tait important de rester organis&eacute;. Nous avons trouv&eacute; des chefs de projet pour les diff&eacute;rentes parties du livre, choisi les r&eacute;dacteurs et les r&eacute;viseurs de chaque chapitre et mont&eacute; les &eacute;quipes de recherche et de diffusion. Chapitre apr&egrave;s chapitre, l&#39;id&eacute;e est petit &agrave; petit devenue r&eacute;alit&eacute;.</p>

<p>Pour moi, la meilleure partie de ce projet a &eacute;t&eacute; d&#39;avoir l&#39;honneur de travailler avec certaines des personnes les plus intelligentes, les plus dr&ocirc;les et les plus cr&eacute;atives que j&#39;aie jamais rencontr&eacute;es. Encore et toujours, j&#39;ai &eacute;t&eacute; &eacute;pat&eacute;e par leur cr&eacute;ativit&eacute;, leur passion et leur soutien. Je suis plus que reconnaissante d&#39;avoir eu la chance de cr&eacute;er ce livre avec un groupe aussi extraordinaire. Notre ouvrage est v&eacute;ritablement une entreprise commune.</p>

<p>Mais ce n&#39;est pas un produit fini. C&#39;est le commencement d&#39;un processus communautaire visant &agrave; am&eacute;liorer notre compr&eacute;hension collective des donn&eacute;es et de leur design. Nous publions aujourd&#39;hui la premi&egrave;re &eacute;dition, mais travaillons d&eacute;j&agrave; &agrave; d&#39;autres chapitres pour de futures &eacute;ditions et nous r&eacute;fl&eacute;chissons &agrave; la mani&egrave;re de l&#39;am&eacute;liorer. Ensemble, nous pouvons nous en servir, le traduire, le transformer et l&#39;am&eacute;liorer &agrave; chaque it&eacute;ration.</p>

<p>Data + Design is open source and available on Github. It&rsquo;s free for anyone to read, download, remix, and re-distribute for noncommercial purposes. We invite you to join us. Email <a href="mailto:ebook@infoactive.co" onclick="window.open(&rsquo;https://mail.google.com/mail/?view=cm&amp;tf=1&amp;to=ebook@infoactive.co&amp;cc=&amp;bcc=&amp;su=&amp;body=&rsquo;,&rsquo;_blank&rsquo;);return false;" target="_blank">ebook@infoactive.co</a> to get involved.</p>

<p>I also want to thank the <a href="http://www.rjionline.org/" target="_blank">Donald W. Reynolds Journalism Institute (RJI)</a> for supporting Data + Design. RJI&rsquo;s support for journalism and data storytelling played an instrumental role in bringing this project to life.</p>

<p data-type="author">Trina Chiasson<br />
 Cofondatrice et PDG, Infoactive<br />
 Membre de l&#39;institut de journalisme Donald W. Reynolds, 2013-2014</p>
</section>
