<section class="red" data-type="chapter">
<header>
<div class="icon"><img src="../images/sections/06/Perception-icon-illusion-fr.png" /></div>

<p>Chapitre 17</p>

<h1>Comment notre cerveau peut nous tromper</h1>

<p data-type="author">Par Mizel Djukic Adapt&eacute; par Walid Laaraba</p>
</header>

<section data-type="sect1">
<blockquote>Un grand pouvoir implique de grandes responsabilit&eacute;s.</blockquote>

<p>Jusqu&#39;&agrave; pr&eacute;sent vous avez utilis&eacute; diff&eacute;rents outils afin de transformer vos graphiques en histoires captivantes. Si les histoires que vous racontez parlent &agrave; votre public, elles peuvent aider &agrave; faire changer les choses et pousser les gens &agrave; agir. Mais avant d&rsquo;essayer de  changer le monde avec les comp&eacute;tences que vous avez acquises, il est important de comprendre que certaines visualisations peuvent &ecirc;tre trompeuses en raison de la mani&egrave;re dont notre cerveau fonctionne.</p>

<h2>Comment percevons-nous les diff&eacute;rences?</h2>

<p>Notre cerveau aime les diff&eacute;rences. M&ecirc;me lorsque nous sommes en train de nous d&eacute;tendre devant un ordinateur en regardant des vid&eacute;os de chats et en sirotant un verre de th&eacute; glac&eacute;, notre cerveau continue de chercher des limites dans notre environnement, en identifiant les diff&eacute;rences entre nos pieds et le sol, nos mains et le clavier, notre verre et la table. La fa&ccedil;on dont nous percevons ces limites d&eacute;pend d&#39;une vari&eacute;t&eacute; de facteurs dont la couleur, le contraste, la forme, et la perspective dimensionnelle de notre environnement.</p>

<h3>Diff&eacute;rences de couleur et de contraste </h3>

<p>Si on parle de couleur et de contraste,  le premier exemple qui nous vient &agrave; l&#39;esprit est probablement le noir et blanc. Il est tr&egrave;s facile pour nous de faire la distinction entre les deux car l&rsquo;un est sombre et l&#39;autre clair. La variation entre la luminosit&eacute; et l&#39;obscurit&eacute; d&#39;une couleur (connue sous le nom de &laquo; <a class="glossterm" href="glossary01.html#value" target="_blank">la valeur</a> &raquo;) est une bonne fa&ccedil;on d&#39;&eacute;tablir un contraste, mais ce n&rsquo;est pas la seule. Vous pouvez aussi varier la saturation de sorte que la couleur soit p&acirc;le et d&eacute;color&eacute;e, ou vive et &eacute;clatante. Vous pouvez &eacute;galement cr&eacute;er un contraste en utilisant des couleurs diff&eacute;rentes (ou <a class="glossterm" href="glossary01.html#hue" target="_blank">teintes</a>) qui sont faciles &agrave; distinguer les unes des autres.</p>

<figure><img alt="color contrast" src="../images/sections/06/Perception-color-contrast-fr.png" /></figure>

<p>La fa&ccedil;on dont notre cerveau per&ccedil;oit les contrastes d&eacute;pend du contexte. Plus le contraste entre des objets est important, plus nous pensons qu&rsquo;ils sont diff&eacute;rents.<span data-type="footnote">Cairo, Alberto. The Functional Art. Berkeley: New Riders, 2013. Imprim&eacute;.</span> Jetons par exemple un &oelig;il au graphique suivant:</p>

<figure><img alt="red line" src="../images/sections/06/Perception-red-line-fr.png" /></figure>

<p>Avez-vous distingu&eacute; quelque chose? Probablement la ligne rouge, et ce, pour plusieurs raisons. Observations de superh&eacute;ros dans le quartierTout d&#39;abord, la ligne rouge est plus satur&eacute;e que les autres lignes. Deuxi&egrave;mement, le rouge et le bleu sont des couleurs id&eacute;ales pour mettre en &eacute;vidence un contraste. Troisi&egrave;mement, &agrave; nos yeux, le rouge et le jaune viennent au premier plan tandis que le bleu se retire vers l&#39;arri&egrave;re-plan.<span data-type="footnote">Rockwell, Ken. The Secret: What Makes a Great Photo. Web. 1 Mars 2014. http://www.kenrockwell.com/tech/basics.htm</span></p>

<p>En raison de la forte opposition entre la ligne rouge et le reste, notre cerveau va naturellement se concentrer sur elle, et nous allons probablement penser qu&#39;il y a quelque chose de sp&eacute;cial la concernant. Avoir une ligne rouge se d&eacute;marquant de cette fa&ccedil;on est visuellement int&eacute;ressant &agrave; condition qu&rsquo;il y ait une bonne raison de le faire. Par exemple, si chaque ligne repr&eacute;sentait le niveau de bonheur au fil du temps dans les diff&eacute;rents quartiers d&rsquo;une ville, la ligne rouge serait une bonne option pour mettre en &eacute;vidence le bonheur d&rsquo;un quartier en particulier. Par contre, si la ligne rouge ne v&eacute;hicule pas de message particulier, le contraste peut mener &agrave; une importante source de confusion.</p>

<p>Maintenant, jetons un &oelig;il &agrave; la carte ci-dessous qui montre le niveau d&#39;excellence dans diff&eacute;rentes parties d&#39;un pays appel&eacute; Relethonie:</p>

<figure><img alt="rainbow map" src="../images/sections/06/Perception-rainbow-map-fr.png" /></figure>

<p>Comment interpr&eacute;ter ce graphique? Il semble y avoir une sorte de division entre l&#39;est et l&#39;ouest du pays, n&rsquo;est-ce pas? En fait, cette division apparente est le r&eacute;sultat de l&rsquo;important contraste entre les zones vertes claires et les zones vertes fonc&eacute;es. Il semblerait donc, qu&rsquo;il y ait une plus grande diff&eacute;rence entre ces deux parties qu&rsquo;entre, par exemple, les zones jaunes et les zones vertes claires (&agrave; gauche du graphique). Mais quand on regarde la l&eacute;gende, on s&rsquo;aper&ccedil;oit que la diff&eacute;rence entre les parties jaune et verte claire est la m&ecirc;me que celle qui s&eacute;pare les parties verte claire et verte fonc&eacute;e: un seul niveau d&#39;excellence.</p>

<figure><img alt="rainbow difference" src="../images/sections/06/Perception-color-contrast-difference-fr.png" /></figure>

<p>Une bonne pratique est de faire attention &agrave; la couleur et au contraste dans vos repr&eacute;sentations. Quand des gens voient des zones &agrave; fort contraste dans vos graphiques, ils vont probablement y attacher une certaine importance ou penser que vous aviez l&#39;intention de souligner un &eacute;l&eacute;ment en le mettant en &eacute;vidence avec une diff&eacute;rence de couleurs.</p>

<h3>DIFF&Eacute;RENCES DE FORMES</h3>

<p>Notre cerveau a plus de mal &agrave; faire la diff&eacute;rence entre les formes d&rsquo;un graphique. Pour illustrer ce point, notez combien de temps il vous faut pour trouver le cercle rouge dans chacune des figures ci-dessous:</p>

<figure><img alt="red circle" src="../images/sections/06/Perception-find-circle-color-vs-shape-fr.png" />
<figcaption>
<p>Adapt&eacute; de: Healey, Christopher G., Kellogg S. Booth, et James T. Ennis. &ldquo;High-Speed Visual Estimation Using Preattentive Processing.&rdquo; ACM Transactions on Computer-Human Interaction 3.2 (1996): 4.</p>
</figcaption>
</figure>

<p>Avez-vous trouv&eacute; plus rapidement le cercle dans la premi&egrave;re figure? C&rsquo;est le cas pour la plupart des gens, et ce, parce que notre cerveau diff&eacute;rencie plus facilement les couleurs que les formes. Cela est vrai m&ecirc;me si un autre facteur est en train de changer de fa&ccedil;on al&eacute;atoire et interf&egrave;re avec ce que nous voyons.<span data-type="footnote">Healey, Christopher G., Kellogg S. Booth, and James T. Enns. &quot;High-Speed Visual Estimation Using Preattentive Processing.&quot; ACM Transactions on Computer-Human Interaction 3.2 (1996): 107-135. Web. 16 Juine 2014.</span> Par exemple, voyez combien de temps il vous faut pour trouver la limite dans chacune des figures ci-dessous:</p>

<figure><img alt="boundary" src="../images/sections/06/Perception-find-boundary-color-vs-shape-fr.png" />
<figcaption>
<p>Adapt&eacute; de: Healey, Christopher G., Kellogg S. Booth, et James T. Ennis. &ldquo;High-Speed Visual Estimation Using Preattentive Processing.&rdquo; ACM Transactions on Computer-Human Interaction 3.2 (1996): 5.</p>
</figcaption>
</figure>

<p>La plupart d&#39;entre nous trouvent la limite de couleurs (entre le rouge et le bleu) repr&eacute;sent&eacute;e dans la figure de gauche plus rapidement que  la limite des formes (entre les cercles et les carr&eacute;s) repr&eacute;sent&eacute;e dans la figure de droite. Dans l&#39;image de gauche, les objets sont organis&eacute;s par couleur tandis que la forme est en train de changer de fa&ccedil;on al&eacute;atoire. L&#39;inverse est vrai dans l&#39;image de droite: les objets sont organis&eacute;s par forme tandis que la couleur change au hasard. </p>

<p>Tout cela nous am&egrave;ne &agrave; nous questionner sur la pertinence d&#39;utiliser des ic&ocirc;nes et des pictogrammes dans nos visualisations &eacute;tant donn&eacute; que les ic&ocirc;nes les plus simples sont d&eacute;finis par leurs formes, et non pas par leurs couleurs. Heureusement pour nous, le chapitre sur <a href="ch15.html">L&#39;importance de la couleur, de la police et du choix des ic&ocirc;nes</a> r&eacute;pond &agrave; cette question:</p>

<blockquote>La r&egrave;gle devrait &ecirc;tre: Si vous pouvez clarifier quelque chose en utilisant le petit espace mis &agrave; votre disposition sans utiliser d&rsquo;ic&ocirc;ne, n&rsquo;en utilisez pas. [...] D&egrave;s que vous entendez quelqu&rsquo;un demander &ldquo;Qu&rsquo;est-ce que cette ic&ocirc;ne signifie?&rdquo;, vous avez perdu la bataille pour la simplicit&eacute;.</blockquote>

<p>Les ic&ocirc;nes peuvent &ecirc;tre une fa&ccedil;on intelligente et utile d&#39;illustrer une id&eacute;e tout en assurant attrait et beaut&eacute; visuelle &agrave; vos infographies, mais pour &ecirc;tre efficaces, elles doivent trouver le juste &eacute;quilibre entre le d&eacute;tail et la clart&eacute;. Trop de d&eacute;tails conduit &agrave; des ic&ocirc;nes qui sont difficiles &agrave; distinguer les unes des autres; trop peu de d&eacute;tails conduit &agrave; des ic&ocirc;nes qui sont trop abstraites. Si les formes sont trop compliqu&eacute;es et trop simples, cela conduit tout simplement &agrave; un public confus.</p>

<p>Passons &agrave; un petit exercice. Des bonnes ic&ocirc;nes peuvent communiquer un message  sans n&eacute;cessairement la pr&eacute;sence de couleurs. Chacune des trois cartes ci-dessous montre l&#39;emplacement des h&ocirc;pitaux et des biblioth&egrave;ques dans une zone g&eacute;ographique. En se basant uniquement sur les ic&ocirc;nes, laquelle de ces carte est la plus facile &agrave; comprendre?</p>

<figure><img alt="icon maps" src="../images/sections/06/Perception-choose-best-icons-fr.png" /></figure>

<h3>Diff&eacute;rences de perspectives</h3>

<p>Nous vivons dans un monde en 3 dimensions. Les objets qui nous entourent, les films que nous regardons, les jeux auxquels nous jouons, sont tous en 3 dimensions. Quand il est question de mod&eacute;lisation visuelle ou de cartographie, il peut &ecirc;tre tr&egrave;s tentant de ne pas seulement se contenter de  banals graphiques &agrave; 2 dimensions. Le probl&egrave;me est que le r&eacute;sultat n&rsquo;est pas toujours &agrave; la hauteur des attentes et que les lecteurs finissent plus &eacute;tourdis qu&rsquo;&eacute;blouis.</p>

<p>Comme mentionn&eacute; pr&eacute;c&eacute;demment, notre cerveau a d&eacute;j&agrave; un peu de mal &agrave; distinguer les formes bidimensionnelles entre elles. Ajouter une troisi&egrave;me dimension &agrave; ces formes am&egrave;ne souvent encore plus de confusion. Afin d&rsquo;illustrer ce principe, regardons deux graphiques repr&eacute;sentant la m&ecirc;me information. Selon vous, lequel est le plus facile &agrave; lire? </p>

<figure><img alt="3D bar" src="../images/sections/06/Perception-3d-bar-fr.png" /></figure>

<figure><img alt="2D bar" src="../images/sections/06/Perception-2d-bar-fr.png" /></figure>

<p>La difficult&eacute; &agrave; lire les graphiques n&rsquo;est pas la seule raison d&rsquo;&eacute;viter l&rsquo;utilisation de visualisations en 3D. Une autre raison est d&rsquo;ordre cognitif. Notre cerveau associe les diff&eacute;rences de perspectives avec des diff&eacute;rences de taille. Vous avez probablement d&eacute;j&agrave; exp&eacute;riment&eacute; ce ph&eacute;nom&egrave;ne &agrave; plusieurs reprises, que vous regardiez en bas d&rsquo;une rue ou en haut d&rsquo;un gratte-ciel, les objets au premier plan paraissent plus grands que ceux en arri&egrave;re-plan. </p>

<p>Prenez par exemple une table de cuisine carr&eacute;e. Vous savez que puisqu&rsquo;elle est carr&eacute;e, tous ses c&ocirc;t&eacute;s ont une dimension identique. Mais en la regardant de c&ocirc;t&eacute;, notre perception change:</p>

<figure><img alt="table perspective" src="../images/sections/06/Perception-table-perspective-fr.png" /></figure>

<p>Dans cette deuxi&egrave;me perspective, il semble que le c&ocirc;t&eacute; le plus proche de nous est plus grand que le c&ocirc;t&eacute; qui se trouve derri&egrave;re.</p>

<p>Pour cette raison, de nombreux types de visualisations 3D peuvent &ecirc;tre trompeurs. Selon vous, dans le camembert ci-dessous, quelle tranche est la plus grande: la tranche rouge ou la tranche verte? La tranche bleue ou de la tranche jaune? </p>

<figure><img alt="3D pie" src="../images/sections/06/Perception-3d-pie-fr.png" /></figure>

<p>En fait, la tranche rouge et la tranche verte sont de m&ecirc;me taille. La tranche jaune, quant &agrave; elle, est deux plus fois plus grande que la bleue. Ceci est beaucoup plus clair une fois le graphique repr&eacute;sent&eacute; en 2 dimensions : </p>

<figure><img alt="2D pie" src="../images/sections/06/Perception-2d-pie-fr.png" /></figure>

<p>Donc, &agrave; moins d&rsquo;avoir une tr&egrave;s bonne raison d&#39;utiliser des graphiques en 3D, il est pr&eacute;f&eacute;rable de les &eacute;viter.  Mais si les graphiques en 3D ne sont pas id&eacute;aux, il existe des exceptions pour lesquelles ils peuvent &ecirc;tre utiles. C&rsquo;est par exemple le cas dans certains types de mod&eacute;lisations scientifiques, tels que des mod&egrave;les repr&eacute;sentant le cerveau humain ou encore de cartes qui mod&eacute;lisent la topographie d&#39;une r&eacute;gion g&eacute;ographique quelconque. Il existe des cas o&ugrave; la 3D am&eacute;liore la visualisation. Assurez-vous seulement qu&rsquo;elle aide &agrave; la compr&eacute;hension.</p>

<h2>Comment comparer les diff&eacute;rences?</h2>

<p>Qu&#39;avons-nous appris jusqu&#39;&agrave; pr&eacute;sent? Que notre cerveau est tr&egrave;s dou&eacute; pour remarquer les diff&eacute;rences de couleurs et de contrastes, mais moins pour interpr&eacute;ter les diff&eacute;rences de formes et de perspectives. D&#39;une mani&egrave;re g&eacute;n&eacute;rale, plus le nombre de diff&eacute;rences dans un graphique est &eacute;lev&eacute;, plus il nous faut du temps pour le comprendre. Aidons donc notre cerveau en minimisant le nombre de diff&eacute;rences &agrave; interpr&eacute;ter! Pour cela, il est important d&#39;&ecirc;tre coh&eacute;rant dans les graphiques que nous mettons en place. </p>

<h3>Alignement constant</h3>

<p>Notre cerveau est plut&ocirc;t dou&eacute; pour comparer des diff&eacute;rences de longueur, &agrave; condition que les &eacute;l&eacute;ments que nous comparons partagent un point de r&eacute;f&eacute;rence commun.<span data-type="footnote">Cleveland, William S. and Robert McGill. &quot;Graphical Perception and Graphical Methods for Analyzing Scientific Data.&quot; Science 229.4716 (1985): 828-833. Web. 16 Juine 2014.</span> Essayez par exemple de comparer les longueurs des barres dans le suivant graphique :</p>

<figure><img alt="unaligned bars" src="../images/sections/06/Perception-unaligned-bar-fr.png" /></figure>

<p>Essayez maintenant de refaire le m&ecirc;me exercice avec le graphique ci-dessous : </p>

<figure><img alt="aligned bars" src="../images/sections/06/Perception-aligned-bar-fr.png" /></figure>

<p>L&rsquo;interpr&eacute;tation &eacute;tait plus simple avec le deuxi&egrave;me graphique, n&rsquo;est-ce pas? M&ecirc;me si les deux graphiques &agrave; barres ont un axe horizontal avec les m&ecirc;mes &eacute;tiquettes et les m&ecirc;mes marques de graduation, le deuxi&egrave;me graphique minimise les diff&eacute;rences que notre cerveau doit traiter en faisant d&eacute;buter toutes les barres au m&ecirc;me niveau. Un alignement constant permet &agrave; notre cerveau de se concentrer sur les longueurs sans avoir &agrave; se soucier du point de d&eacute;part de chaque barre. L&rsquo;interpr&eacute;tation est donc plus facile.</p>

<h3>Unit&eacute;s coh&eacute;rentes</h3>

<p>Il peut arriver un moment o&ugrave; vous voudrez repr&eacute;senter deux ensembles de donn&eacute;es sur un m&ecirc;me graphique. Exemple : un graphique &agrave; double lignes ou un diagramme &agrave; double bandes.  Une id&eacute;e tr&egrave;s int&eacute;ressante... tant que vous respectez le principe de coh&eacute;rence.</p>

<p>Le graphique &agrave; barres suivant compare combien il en co&ucirc;terait d&rsquo;acheter des objets magiques aux &Eacute;tats-Unis et au Royaume-Uni:</p>

<figure><img alt="inconsistent units" src="../images/sections/06/Perception-inconsistent-units-fr.png" /></figure>

<p>Il semble que les accessoires de magie co&ucirc;tent bien moins chers au Royaume-Uni! Cependant, il faut faire attention. Se contenter de comparer les longueurs des barres rouges par rapport aux bleues n&rsquo;est pas suffisant. Il y a une autre diff&eacute;rence dont nous devons tenir compte: les unit&eacute;s sur les axes verticaux sont diff&eacute;rentes. A gauche, les unit&eacute;s sont en dollars am&eacute;ricains, tandis qu&rsquo;&agrave; droite, les unit&eacute;s sont en euros. Ainsi, afin de comparer avec pr&eacute;cision les prix entre les deux pays, nous devons soit convertir les dollars en euros, soit les euros en dollars. Certaines personnes peuvent faire ce genre de conversion de devises ais&eacute;ment, et ils m&eacute;ritent d&#39;&ecirc;tre f&eacute;licit&eacute;s pour leur admirable comp&eacute;tence en math&eacute;matiques. Les autres vont se pencher sur cette t&acirc;che en se demandant pourquoi le designer de ce diagramme &agrave; barres est  si cruel. Une bonne pratique est donc de convertir les diff&eacute;rentes unit&eacute;s &agrave; des unit&eacute;s coh&eacute;rentes afin que votre public ne soit  pas oblig&eacute; &agrave; le faire par lui-m&ecirc;me :</p>

<figure><img alt="consistent units dollars" src="../images/sections/06/Perception-consistent-units-dollars-fr.png" /></figure>

<figure><img alt="consistent units euros" src="../images/sections/06/Perception-consistent-units-euros-fr.png" /></figure>

<p>Au final, on peut constater que les objets magiques co&ucirc;tent le m&ecirc;me prix aux &Eacute;tats-Unis et au Royaume-Uni.</p>

<h3>Echelles coh&eacute;rentes</h3>

<p>En plus d&rsquo;unit&eacute;s coh&eacute;rentes, vos graphiques devraient aussi avoir des &eacute;chelles coh&eacute;rantes. Par exemple, le graphique ci-dessous compare le temps qu&#39;il faudrait &agrave; un Terrien et &agrave; un Martien  pour ma&icirc;triser leurs diff&eacute;rents superpouvoirs:</p>

<figure><img alt="inconsistent scales" src="../images/sections/06/Perception-inconsistent-scales-fr.png" /></figure>

<p>En comparant les barres, nous serions tent&eacute;s de conclure que les  Martiens  prennent plus de temps &agrave; ma&icirc;triser leurs superpouvoirs que les Terriens, mais une fois encore, les axes verticaux sont diff&eacute;rents. Si cette fois les unit&eacute;s sont conformes (les deux axes utilisent les  heures comme unit&eacute;), les &eacute;chelles, elles, sont diff&eacute;rentes. Sur le c&ocirc;t&eacute; gauche, la balance est en milliers d&#39;heures pour les Terriens, alors que sur le c&ocirc;t&eacute; droit, la balance est en centaines d&#39;heures pour les Martiens. Les m&ecirc;mes donn&eacute;es avec des &eacute;chelles coh&eacute;rentes ressembleraient &agrave; cela : </p>

<figure><img alt="consistent scales" src="../images/sections/06/Perception-consistent-scales-fr.png" /></figure>

<p>Un graphe avec des &eacute;chelles coh&eacute;rentes permet de constater avec &eacute;vidence que les Martiens ma&icirc;trisent leurs pouvoirs beaucoup plus rapidement que les Terriens. Peut-&ecirc;tre parce qu&#39;ils ont moins de gravit&eacute; sur leur plan&egrave;te, allez savoir.</p>

<h2>Transparence</h2>

<p>Lorsque l&rsquo;on parle de visualisation de donn&eacute;es et de transparence, il est important de garder &agrave; l&rsquo;esprit que les donn&eacute;es que l&rsquo;on ne montre pas sont aussi importantes que celles qui sont affich&eacute;es. Notre but principal est de donner aux lecteurs le contexte complet de la situation incluant toute information suppl&eacute;mentaire dont ils pourraient avoir besoin pour interpr&eacute;ter correctement nos graphiques.</p>

<h3>Graphiques cumulatifs</h3>

<p>Une valeur cumulative vous donne une information sur le combien jusqu&rsquo;&agrave; maintenant. Par exemple, disons que vous voudriez garder une trace sur le nombre d&rsquo;apparitions de super-h&eacute;ros qu&rsquo;il y a dans votre quartier:</p>

<table>
	<tbody>
		<tr>
			<th>
			<p>Mois</p>
			</th>
			<th>
			<p>Nombre d&#39;observations de superh&eacute;ros</p>
			</th>
			<th>
			<p>Nombre cumulatif d&#39;observations de superh&eacute;ros</p>
			</th>
		</tr>
		<tr>
			<td>Janvier</td>
			<td>60</td>
			<td>60</td>
		</tr>
		<tr>
			<td>F&eacute;vruary</td>
			<td>40</td>
			<td>100 = 60 + 40</td>
		</tr>
		<tr>
			<td>Mars</td>
			<td>38</td>
			<td>138 = 60 + 40 + 38</td>
		</tr>
		<tr>
			<td>Avril</td>
			<td>30</td>
			<td>168 = 60 + 40 + 38 + 30</td>
		</tr>
		<tr>
			<td>Mai</td>
			<td>25</td>
			<td>193 = 60 + 40 + 38 + 30 + 25</td>
		</tr>
		<tr>
			<td>Juine</td>
			<td>26</td>
			<td>219 = 60 + 40 + 38 + 30 + 25 + 26</td>
		</tr>
		<tr>
			<td>Juillet</td>
			<td>20</td>
			<td>239 = 60 + 40 + 38 + 30 + 25 + 26 + 20</td>
		</tr>
		<tr>
			<td>Ao&ucirc;tust</td>
			<td>18</td>
			<td>257 = 60 + 40 + 38 + 30 + 25 + 26 + 20 + 18</td>
		</tr>
		<tr>
			<td>Septembre</td>
			<td>30</td>
			<td>287 = 60 + 40 + 38 + 30 + 25 + 26 + 20 + 18 + 30</td>
		</tr>
		<tr>
			<td>Octobre</td>
			<td>62</td>
			<td>349 = 60 + 40 + 38 + 30 + 25 + 26 + 20 + 18 + 30 + 62</td>
		</tr>
		<tr>
			<td>Novembre</td>
			<td>75</td>
			<td>424 = 60 + 40 + 38 + 30 + 25 + 26 + 20 + 18 + 30 + 62 + 75</td>
		</tr>
		<tr>
			<td>D&eacute;cembre</td>
			<td>90</td>
			<td>514 = 60 + 40 + 38 + 30 + 25 + 26 + 20 + 18 + 30 + 62 + 75 + 90</td>
		</tr>
	</tbody>
</table>

<p>La premi&egrave;re colonne nous indique le nombre d&#39;observations pour chaque mois, ind&eacute;pendamment des autres mois. La deuxi&egrave;me colonne nous donne le nombre d&#39;observations &agrave; ce jour en additionnant les nombres ligne apr&egrave;s ligne. Par exemple, pour janvier il y avait 60 observations de super-h&eacute;ros, de sorte que le total est 60. En f&eacute;vrier, il y avait 40 observations, ce qui signifie que le total est jusqu&#39;&agrave; pr&eacute;sent de 100 parce que les 40 observations de f&eacute;vrier se sont ajout&eacute;s aux 60 de janvier. Et ainsi de suite pour chaque mois qui suit. </p>

<p>Pourquoi faisons-nous tous ces calculs? Afin de les utiliser dans un graphe cumulatif.</p>

<div data-type="warning"><p>Si vous cr&eacute;ez  un graphique cumulatif, il est important que vous en informiez vos lecteurs. </p></div>

<p>Pourquoi? Regardons ce graphique indiquant des donn&eacute;es non cumulatives sur une base mensuelle:</p>

<figure><img alt="noncumulative graph" src="../images/sections/06/Perception-noncumulative-line-fr.png" /></figure>

<p>Notez le comportement de la ligne trac&eacute;e: le nombre d&#39;observations mensuelles diminue g&eacute;n&eacute;ralement au mois d&rsquo;Ao&ucirc;t, puis augmente jusqu&#39;&agrave; la fin de l&#39;ann&eacute;e. Les super h&eacute;ros sont apparemment plus occup&eacute;s pendant les mois de vacances et viennent moins dans votre quartier.</p>

<p>Comparez maintenant le graphique ci-dessus de avec le graphique cumulatif ci-dessous:</p>

<figure><img alt="cumulative graph" src="../images/sections/06/Perception-cumulative-line-fr.png" /></figure>

<p>Vous remarquerez que la ligne trac&eacute;e ne ressemble pas &agrave; la premi&egrave;re. Celle du graphique  cumulatif ne cesse d&#39;augmenter parce que les chiffres ne cessent de s&rsquo;ajouter les uns aux autres. Il est facile de regarder un graphique cumulatif et de penser &agrave; tort qu&#39;il nous montre une tendance qui augmente syst&eacute;matiquement lorsque ce n&rsquo;est pas vraiment le cas. </p>

<p>Il est ainsi important de pr&eacute;venir votre public lorsque vous utilisez un graphe cumulatif afin d&rsquo;&eacute;viter une mauvaise interpr&eacute;tation des donn&eacute;es.</p>

<h3>Contexte</h3>

<p>Sans contexte, les histoires que nous essayons de raconter au travers de nos graphiques n&rsquo;auront pas de point de r&eacute;f&eacute;rence sur lequel nous pourrons nous baser pour interpr&eacute;ter les diff&eacute;rences. Par exemple, trouvez-vous que la tendance suivante est habituelle ou non?</p>

<figure><img alt="no context" src="../images/sections/06/Perception-no-context-line-fr.png" /></figure>

<p>Alternativement, trop de donn&eacute;es peuvent submerger une audience. Dans ce cas, le contexte est perdu parmi tous les renseignements et devient plut&ocirc;t une v&eacute;rit&eacute; trop compliqu&eacute;e. Par exemple, n&rsquo;est-il pas plus difficile de remarquer et d&rsquo;analyser  la ligne rouge dans le graphique ci-dessous?</p>

<figure><img alt="too much context" src="../images/sections/06/Perception-too-much-context-line-fr.png" /></figure>

<p>C&rsquo;est pourquoi la visualisation des donn&eacute;es est difficile! Vous devez comprendre comment pr&eacute;senter vos donn&eacute;es d&#39;une mani&egrave;re qui permette aux lecteurs de voir clairement les tendances et de comparer avec pr&eacute;cision les diff&eacute;rences. Par exemple, jetons un coup d&#39;&oelig;il au graphique suivant:</p>

<figure><img alt="good context" src="../images/sections/06/Perception-good-context-line-fr.png" /></figure>

<p>Si vous voulez montrer &agrave; votre audience &agrave; quel point le nombre d&rsquo;apparitions de super-h&eacute;ros a chang&eacute; au fil du temps, pr&eacute;senter les donn&eacute;es sur un laps de temps annuel donne plus de contexte et est plus int&eacute;ressant que sur un laps de temps mensuel. Et au lieu de montrer les courbes de tendance pour des dizaines de villes &agrave; travers le monde, votre graphique sera moins encombr&eacute; et plus pertinent pour votre public si vous vous focalisez sur votre propre quartier par exemple. Une bonne pratique est aussi d&rsquo;inclure un point de r&eacute;f&eacute;rence, par exemple une moyenne globale, afin que les voisins qui composent votre audience r&eacute;alisent si leur quartier est typique ou non.</p>

<p>Le chapitre suivant et dernier de ce livre aura pour but de d&eacute;tailler d&rsquo;une fa&ccedil;on plus importante les r&egrave;gles li&eacute;es au contexte et souligne d&rsquo;autres fa&ccedil;ons graphiques pouvant induire en erreur un public. Rappelez-vous: &ecirc;tre coh&eacute;rent et transparent doit &ecirc;tre la base de vos visualisations.</p>
</section>
</section>
