<section data-type="chapter" class="yellow">
<header>
 <div class="icon"><img src="../images/sections/05/AnatomyGraphic-icon-map-fr.png" /></div>
 <p>Chapitre 14</p>
 <h1>Anatomie d&rsquo;un graphique</h1>
 <p data-type="author">Par Amanda Makulec Adapt&eacute; par Genevi&egrave;ve Boucher</p>
</header>
<section data-type="sect1">

<p>Apr&egrave;s avoir fait un prototype de votre graphique, la prochaine &eacute;tape pour cr&eacute;er une visualisation claire et percutante est de s&rsquo;assurer que tous les &eacute;l&eacute;ments sont bien identifi&eacute;s ou annot&eacute;s. Les &eacute;l&eacute;ments textuels ajout&eacute;s au graphique aident les lecteurs &agrave; mieux comprendre l&rsquo;histoire que racontent les donn&eacute;es. Ils doivent aussi permettre &agrave; n&rsquo;importe qui de capter le message du graphique d&rsquo;un coup d&rsquo;oeil, sans explications additionnelles.</p>

<p>Prenons un moment pour, d&egrave;s le d&eacute;part, pour clarifier quelques termes. Quand nous parlons d&rsquo;&eacute;tiquettes de donn&eacute;es, de cat&eacute;gories, d&rsquo;axes et de l&eacute;gende, nous parlons des diff&eacute;rents &eacute;l&eacute;ments retrouv&eacute;s sur le graphique de la Figure 1.</p>

<figure><img alt="Different components of a graph" src="../images/sections/05/AnatomyGraphic-graph-anatomy-fr.png" /></figure>

<p>Une des fa&ccedil;ons les plus convaincantes de montrer la valeur qu&rsquo;ajoutent les &eacute;tiquettes textuelles sur un graphique est de pr&eacute;senter le m&ecirc;me graphique avec et sans ces &eacute;tiquettes. Prenons deux graphiques pr&eacute;sentant le nombre de m&eacute;dailles olympiques gagn&eacute;es par diff&eacute;rents pays aux Jeux Olympiques d&rsquo;hiver de Sotchi en 2014. </p>

<figure><img alt="Graph with stock labels" src="../images/sections/05/AnatomyGraphic-default-labels-bar-fr.png" /></figure>

<figure><img alt="Graph with better labels" src="../images/sections/05/AnatomyGraphic-good-labels-bar-fr.png" /></figure>

<p>Les deux graphiques pr&eacute;sentent les m&ecirc;mes donn&eacute;es (et montrent que l&rsquo;&eacute;quipe du pays h&ocirc;te, la Russie, a remport&eacute; la course aux m&eacute;dailles!). Le premier graphique contient le texte ajout&eacute; par d&eacute;faut dans Excel. Si l&rsquo;on compare les deux graphes, nous nous rendons bien compte que le premier pr&eacute;sente une information limit&eacute;e tandis que le second raconte une histoire claire. L&rsquo;usage intelligent d&rsquo;&eacute;tiquettes textuelles plus d&eacute;taill&eacute;es aide beaucoup &agrave; la compr&eacute;hension du graphique.</p>

<p>En effet, un simple ajout de texte aide le lecteur &agrave; se faire une id&eacute;e de ce qu&rsquo;il ou elle lit. Regardez le titre, les axes, la l&eacute;gende et l&rsquo;annotation des donn&eacute;es. L&rsquo;ajout de ces &eacute;l&eacute;ments vous donne l&rsquo;opportunit&eacute; d&rsquo;aider le lecteur &agrave; comprendre le message que vous voulez partager &agrave; travers votre graphique.</p>

<p>Toutefois, malgr&eacute; l&rsquo;importance qu&rsquo;a le texte pour vous aider &agrave; raconter votre histoire, il prend de la place et remplit rapidement l&rsquo;espace. Il doit donc rester aussi simple et direct que possible. Surcharger les axes ou les &eacute;tiquettes ou utiliser des titres excessivement longs sature rapidement votre repr&eacute;sentation graphique et diminue son impact. Les graphiques les mieux r&eacute;ussis sont souvent &eacute;l&eacute;gants par leur simplicit&eacute;. Avec les logiciels aujourd&rsquo;hui disponibles, un changement ne demande que quelques clics de souris et quelques commandes au clavier. Donc, n&rsquo;ayez pas peur de faire des essais avec vos &eacute;tiquettes textuelles pour trouver le parfait &eacute;quilibre! Essayez d&rsquo;ajouter diff&eacute;rentes &eacute;tiquettes, de les &eacute;diter, de les retirer au besoin jusqu&rsquo;&agrave; ce que vous ayez trouv&eacute; le bon &eacute;quilibre. Celui vous permettant de communiquer votre message le plus efficacement possible.</p>

<p>Dans la plupart des cas, vous voudrez que votre repr&eacute;sentation graphique soit compr&eacute;hensible par elle-m&ecirc;me, sans explications narratives additionnelles. Cela requiert parfois d&rsquo;ajouter du texte au graphique pour articuler le mesage plus clairement. Par exemple, en ajoutant des sous-titres au-dessus ou sous le graphe.</p>

<h2>Des axes clairs et pertinents</h2>

<p>Commen&ccedil;ons par d&eacute;finir quelques termes afin d&rsquo;&eacute;viter toute confusion dans leur utilisation. Les <a class="glossterm" target="_blank" href="glossary01.html#label-category">&eacute;tiquettes de cat&eacute;gories</a> sont les petites marques et les cat&eacute;gories que l&rsquo;on retrouve le long des axes servant &agrave; identifier les donn&eacute;es. Les titres des axes sont les courts textes que l&rsquo;on retrouve &agrave; proximit&eacute; des axes servant &agrave; identifier les variables pr&eacute;sent&eacute;es. Vous pouvez vous r&eacute;f&eacute;rer &agrave; la Figure 1 si n&eacute;cessaire!</p>

<figure><img src="../images/sections/05/AnatomyGraphic-graph-anatomy-fr.png" alt="Different components of a graph" /></figure>

<p>Les <a class="glossterm" target="_blank" href="glossary01.html#label-axis">titres sur les axes</a> doivent donner &agrave; vos lecteurs une br&egrave;ve description de la variable associ&eacute; &agrave; un axe donn&eacute;. En fonction des donn&eacute;es avec lesquelles vous travaillez, vous aurez peut-&ecirc;tre des titres extr&ecirc;mement longs et descriptifs pour chacune de vos variables (si quelqu&rsquo;un a construit votre tableau de donn&eacute;es et a ajout&eacute; beaucoup d&rsquo;informations qualitatives par exemple). &Agrave; l&rsquo;oppos&eacute;, vous serez peut-&ecirc;tre confront&eacute; &agrave; des noms de variables tr&egrave;s courts et abr&eacute;g&eacute;s (comme c&rsquo;est souvent le cas lorsque l&rsquo;on travaille avec des donn&eacute;es qui doivent &ecirc;tre trait&eacute;es par des logiciels). Dans tous les cas, ce que vous &eacute;crivez le long des axes devraient d&eacute;buter par le titre de l&rsquo;axe (nom de la variable) et &ecirc;tre suivi par les unit&eacute;s des donn&eacute;es que vous pr&eacute;sentez (pourcentage, devise, etc.). Les titres des axes rappellent &agrave; vos lecteurs l&rsquo;information que vous partagez avec eux et limitent la confusion. Car des kilos et des tonnes, ce n&rsquo;est pas la m&ecirc;me chose!</p>

<h2>&Eacute;tiqueter les donn&eacute;es qualitatives et les axes</h2>

<div data-type="aside"><p>Il est important de trouver un &eacute;quilibre entre &ldquo;donner assez d&rsquo;information &agrave; votre public&rdquo; et &ldquo;garder le texte simple&rdquo;. Assurez-vous de toujours inclure assez d&rsquo;informations pour expliquer les donn&eacute;es que vous pr&eacute;sentez tout en gardant le texte simple afin de ne pas saturer le graphique.</p></div>

<p>Dans notre exemple sur les m&eacute;dailles olympiques, l&rsquo;axe horizontal pr&eacute;sente le nombre de m&eacute;dailles gagn&eacute;es aux jeux olympiques de Sotchi de 2014. Lors de la cr&eacute;ation du graphe, plusieurs it&eacute;rations sont normalement n&eacute;cessaires avant de trouver les bonnes &eacute;tiquettes d&rsquo;axes et le bon titre de graphe. Lorsque vous avez choisi un titre pour un axe, demandez-vous comment votre lecteur interpr&eacute;tera cette information. Un axe intitul&eacute; &ldquo;M&eacute;dailles&rdquo; semble ad&eacute;quat, mais qu&rsquo;est-ce que cela signifie exactement? Les m&eacute;dailles gagn&eacute;es? Les m&eacute;dailles perdues? Les m&eacute;dailles d&rsquo;or? Les m&eacute;dailles gagn&eacute;es en 2014 seulement? Les m&eacute;dailles gagn&eacute;es au cours de tous les jeux olympiques d&rsquo;hiver? Le titre de votre graphique peut aider &agrave; clarifier ces questions et le titre de votre axe vous donne aussi la chance de raconter votre histoire.</p>

<p>Au lieu de &ldquo;M&eacute;dailles&rdquo;, intitulons l&rsquo;axe horizontal &ldquo;Nombre total de m&eacute;dailles olympiques gagn&eacute;es (2014)&rdquo;. L&rsquo;utilisation du mot &ldquo;total&rdquo; vous garantit que le lecteur sait que vous parlez de toutes les sortes de m&eacute;dailles, pas seulement d&rsquo;une sorte (or, argent ou bronze) ou ou d&rsquo;une seule cat&eacute;gorie (ski de fond, ski alpin...). Le mot &ldquo;olympique&rdquo;, quant &agrave; lui, garantit que votre lecteur sait que vous parlez du compte des m&eacute;dailles des jeux olympiques seulement et non celui des jeux olympiques et paralympiques. Finalement, &ldquo;2014&rdquo; rappelle au lecteur l&rsquo;ann&eacute;e au cours de laquelle ont &eacute;t&eacute; gagn&eacute;es toutes ces m&eacute;dailles. Vous auriez aussi pu inclure certains de ces d&eacute;tails dans le titre du graphique, dont on parlera plus tard dans ce chapitre.</p>

<h2>Unit&eacute;s</h2>

<p>Quand nous nous r&eacute;f&eacute;rons aux unit&eacute;s, nous parlons de &ldquo;pourcentages&rdquo;, &ldquo;millions&rdquo; , &ldquo;degr&eacute; celsius&rdquo; et autres termes d&eacute;crivant le type d&rsquo;information que vous pr&eacute;sentez au lecteur. Les unit&eacute;s sont importantes lorsque vous partagez des donn&eacute;es. Particuli&egrave;rement, lorsque vous pr&eacute;sentez des pourcentages au lieu de totaux ou si vous avez utilisez un multiplicateur (par exemple, millions d&rsquo;habitants).</p>
  <figure>
  <img src="../images/sections/05/AnatomyGraphic-population-units-bar-fr.png" alt="Different components of a graph" />
  <figcaption>Dans ce graphique pr&eacute;sentant la population par pays, les mots &ldquo;en millions&rdquo; font une grosse diff&eacute;rence. C&rsquo;est tr&egrave;s facile d&rsquo;oublier de mettre les unit&eacute;s. Ne vous laissez pas prendre. Les donn&eacute;es de population proviennent de <a href="http://www.census.gov/popclock/" target="_blank">http://www.census.gov/popclock/</a></figcaption>
  </figure>
<p>Il est important d&rsquo;&ecirc;tre clair lorsqu&rsquo;on inscrit nos unit&eacute;s. Assurez-vous de faire quelques v&eacute;rifications rapides lors de l&rsquo;ajout de vos titres &agrave; vos axes :</p>

<ul>
	<li>Assurez-vous d&rsquo;&ecirc;tre coh&eacute;rent lorsque vous pr&eacute;sentez diff&eacute;rents types de donn&eacute;es en utilisant un axe double dans un graphique : vous ne voulez pas afficher une variable en mois et l&rsquo;autre en ann&eacute;e sur le m&ecirc;me axe!</li>
	<li>Assurez-vous d&rsquo;&eacute;crire le nom complet de l&rsquo;unit&eacute; au lieu d&rsquo;utiliser des abr&eacute;viations (par exemple, millim&egrave;tres au lieu de mm).</li>
	<li>Les symboles constituent parfois une aide alternative aux mots dans du texte (ils &eacute;conomisent de l&rsquo;espace). Assurez-vous d&rsquo;indiquer clairement ce que le symbole repr&eacute;sente. Par exemple, vous pourriez utiliser &ldquo;$&rdquo; au lieu de &ldquo;dollar&rdquo;. Cependant, ce symbole est utilis&eacute; pour les devises de plus de 30 pays. Il vous faut alors pr&eacute;ciser ce que vous avez en t&ecirc;te (par exemple, CAD$, US$, Mex$).</li>
</ul>

<p>Dans certains cas, pour simplifier la visualisation, vous pouvez vous en tirer en omettant le titre de l&rsquo;axe notamment si vous pr&eacute;sentez des donn&eacute;es cat&eacute;gorielles et que les cat&eacute;gories s&rsquo;expliquent d&rsquo;elles-m&ecirc;mes. Dans notre exemple des m&eacute;dailles olympiques, nous avons &eacute;num&eacute;r&eacute; les noms des pays sur l&rsquo;axe vertical. Si vous pensez que votre public est capable de reconna&icirc;tre que les valeurs list&eacute;es en ordonn&eacute;e sont des pays, il n&rsquo;est pas n&eacute;cessaire de compliquer le graphique en ajoutant le titre, &ldquo;Pays&rdquo;, &agrave; l&rsquo;axe des y. Si vous avez des doutes quant &agrave; la capacit&eacute; de votre public &agrave; reconna&icirc;tre ce que sont vos cat&eacute;gories, jouez de prudence et &eacute;tiquetez votre axe.</p>
 
<h2>Position et format</h2>

<p>Le titre de l&rsquo;axe horizontal doit &ecirc;tre align&eacute; parall&egrave;lement aux &eacute;tiquettes de l&rsquo;axe. La police de caract&egrave;res devrait &ecirc;tre assez grande pour &ecirc;tre lisible, mais ne doit pas dominer tout le graphique.</p>

<p>Il existe un d&eacute;bat pour savoir si les &eacute;tiquettes de l&rsquo;axe vertical devraient &ecirc;tre parall&egrave;les &agrave; l&rsquo;axe ou non. D&rsquo;un c&ocirc;t&eacute;, aligner le texte verticalement montre clairement que le texte est directement associ&eacute; &agrave; l&rsquo;axe vertical. Il y a souvent plus de place pour &eacute;crire le titre de l&rsquo;axe si on fait une rotation de 90 degr&eacute; de ce dernier. D&rsquo;une autre c&ocirc;t&eacute;, les humains ne sont pas tr&egrave;s habiles pour lire du texte orient&eacute; verticalement. Les lecteurs se seront s&ucirc;rement amen&eacute;s &agrave; plisser les yeux ou &agrave; tourner la t&ecirc;te pour comprendre le graphique. Si vous avez assez de place et que le titre de l&rsquo;axe est court, vous pouvez envisager de garder le texte &agrave; l&rsquo;horizontal. Ci-dessous, vous trouverez deux exemples montrant ce qu&rsquo;il faut &eacute;viter lorsque l&rsquo;on place un titre sur l&rsquo;axe vertical.</p>

  <figure><img src="../images/sections/05/AnatomyGraphic-positioning-y-axis-labels-fr.png" alt="Positioning y-axis labels" /></figure>

<p>Les cat&eacute;gories doivent aussi &ecirc;tre bien &eacute;tiquet&eacute;es. Assurez-vous que tous les mots et tous les nombres sont faciles &agrave; lire. Votre lecteur ne devrait pas avoir &agrave; jour les contorsionnistes pour comprendre votre graphique. Voici quelques astuces pour bien formater les &eacute;tiquettes de vos axes:</p>

 <ul>
   <li>Lorsque c&rsquo;est possible, &eacute;vitez de pivoter le texte &agrave; 45 degr&eacute;s. Cela est couramment vu sur les diagrammes &agrave; barres verticales lorsque le texte est assez long, mais cela rend le texte difficile &agrave; lire. Si vous vous retrouvez avec un axe horizontal dense dont les &eacute;tiquettes ont &eacute;t&eacute; pivot&eacute;es, essayez de modifier le type de votre graphique. Un diagramme &agrave; barres horizontales sera plus appropri&eacute; dans ce cas car les &eacute;tiquettes y seront plus faciles &agrave; lire.</li>

  <figure><img src="../images/sections/05/AnatomyGraphic-rotated-vs-horizontal-labels-fr.png" alt="Comparing text on two charts" /></figure>

   <li>Simplifiez vos &eacute;tiquettes. Si dans les donn&eacute;es originales que vous voulez pr&eacute;senter les cat&eacute;gories comportent de longues cha&icirc;nes de caract&egrave;res, pensez &agrave; la fa&ccedil;on dont vous pouvez les simplifiez sans en alt&eacute;rer le sens.</li>

  <figure><img src="../images/sections/05/AnatomyGraphic-detailed-vs-simple-labels-fr.png" alt="Chart with too much detail in labels" /></figure>

   <li>Utiliser les caract&egrave;res gras et italiques raisonnablement et seulement lorsqu&rsquo;ils ajoutent de l&rsquo;information. Par exemple, vous pourriez utiliser des caract&egrave;res gras pour l&rsquo;&eacute;tiquette d&rsquo;une cat&eacute;gorie associ&eacute;e &agrave; des donn&eacute;es que vous voulez mettre en &eacute;vidence.</li>

  <figure><img src="../images/sections/05/AnatomyGraphic-strategic-label-emphasis-fr.png" alt="Using emphasis in charts" /></figure>
</ul>

<h3>&Eacute;tiqueter vos donn&eacute;es</h3>

<p>&Eacute;tiqueter ou ne pas &eacute;tiqueter ses donn&eacute;es, voil&agrave; la question. Une &eacute;tiquette de donn&eacute;es est normalement utilis&eacute;e sur un graphe pour indiquer la valeur d&rsquo;un point repr&eacute;sent&eacute;. Les &eacute;tiquettes de donn&eacute;es sont couramment ajout&eacute;es &agrave; c&ocirc;t&eacute; d&rsquo;une barre ou d&rsquo;un point sur un graphique. Elles sont tr&egrave;s utiles quand le public a besoin d&rsquo;avoir acc&egrave;s aux valeurs repr&eacute;sent&eacute;es . Si vous d&eacute;cidez d&rsquo;en ajouter, les &eacute;tiquettes &agrave; ajouter d&eacute;pendent de votre public et de l&rsquo;histoire que vous tentez de raconter &agrave; travers votre diagramme ou votre graphique. Les &eacute;tiquettes de donn&eacute;es peuvent ajouter de la valeur et du d&eacute;tail &agrave; votre repr&eacute;sentation, mais elles peuvent tout aussi bien l&rsquo;encombrer et embrouiller votre public.</p>

<p>Vous n&rsquo;avez pas besoin de limiter vos &eacute;tiquettes aux valeurs elles-m&ecirc;mes, quoique les valeurs num&eacute;riques sont les plus fr&eacute;quemment ajout&eacute;es. Vous pouvez aussi &eacute;tiqueter les barres/points/etc. pour mettre en &eacute;vidence de l&rsquo;information sp&eacute;cifique en ajoutant une description textuelle quand cela est appropri&eacute;. Par exemple, supposons que vous &ecirc;tes en train de cr&eacute;er un diagramme complexe pr&eacute;sentant le nombre de m&eacute;dailles olympiques gagn&eacute;es par un pays donn&eacute; au cours des 50 derni&egrave;res ann&eacute;es. Vous voudrez peut-&ecirc;tre mettre en &eacute;vidence l&rsquo;ann&eacute;e o&ugrave; le plus de m&eacute;dailles ont &eacute;t&eacute; gagn&eacute;es. Une &eacute;tiquette &ldquo;Meilleure r&eacute;colte de m&eacute;dailles&rdquo; &agrave; c&ocirc;t&eacute; de la donn&eacute;e de cette ann&eacute;e prolifique permet au lecteur de saisir rapidement son importance (au lieu de juste contempler la donn&eacute;e brute).</p>

<p>Lorsque vous d&eacute;cidez comment utiliser les &eacute;tiquettes de donn&eacute;es pour cr&eacute;er un impact, pensez &agrave; votre public. A-t-il besoin de conna&icirc;tre les valeurs exactes des donn&eacute;es que vous pr&eacute;sentez sur votre diagramme? Essayez-vous de montrer une tendance? Utilisez-vous votre graphique pour aider votre public &agrave; identifier rapidement des pics et des creux? Tout d&eacute;pend de l&rsquo;information dont votre public a besoin. Selon le cas, vous pourriez choisir l&rsquo;une des trois approches d&rsquo;&eacute;tiquetage suivantes:</p>

<h3>Option 1: &Eacute;tiqueter tous les points</h3>

<figure><img alt="Graph with better labels" src="../images/sections/05/AnatomyGraphic-good-labels-bar-fr.png" /></figure>

<p>&Eacute;tiqueter tous les points garantit que votre public peut lire la valeur exacte de chaque donn&eacute;e pr&eacute;sent&eacute;e. Sur un diagramme &agrave; barres ou sur un histogramme, cela &eacute;limine le besoin d&rsquo;ajouter une grille comme rep&egrave;re. La couleur et la position sont deux facteurs importants &agrave; consid&eacute;rer lorsqu&rsquo;on ajoute toutes ces valeurs sur un graphique. Sur des diagrammes &agrave; barres ou sur des graphes &agrave; secteurs (aussi appel&eacute;s camembert), on peut placer l&rsquo;&eacute;tiquette de donn&eacute;es dans la barre ou dans le secteur pour aider le lecteur &agrave; identifier rapidement l&rsquo;information importante. Vous pourriez aussi la placer &agrave; l&rsquo;ext&eacute;rieur, mais mettre l&rsquo;&eacute;tiquette &agrave; l&rsquo;int&eacute;rieur diminue les risques que votre lecteur interpr&egrave;te mal les donn&eacute;es.</p>

<figure>
  <img src="../images/sections/05/AnatomyGraphic-inside-vs-outside-data-labels-fr.png" alt="Position of data labels on bars" />
  <figcaption>Dans ce diagramme &agrave; barres, deux &eacute;tiquettes de donn&eacute;es sont trop grandes pour &ecirc;tre positionn&eacute;es &agrave; l&rsquo;int&eacute;rieur de leur barre. Un lecteur jetant un coup d&rsquo;oeil rapide au graphique pourrait accidentellement s&rsquo;imaginer que les barres sont plus longues qu&rsquo;elles ne le sont en r&eacute;alit&eacute;. Faites attention &agrave; la fa&ccedil;on dont vous positionner les &eacute;tiquettes car elles peuvent influencer la perception visuelle.</figcaption>
</figure>

<p>&Eacute;tiqueter tous les points peut apporter de l&rsquo;information d&eacute;taill&eacute;e, mais peut aussi donner au graphique une apparence d&eacute;sordonn&eacute;e, notamment lorsqu&rsquo;il y a beaucoup de valeurs &eacute;tiquet&eacute;es. Les nuages de points constituent de beaux exemples de graphes devenant tr&egrave;s encombr&eacute;s lorsque tous les points sont &eacute;tiquet&eacute;s, particuli&egrave;rement si les &eacute;tiquettes pr&eacute;sentent du texte (noms de pays) comme &agrave; la Figure 4. Il y a tellement d&rsquo;&eacute;tiquettes qu&rsquo;elles se chevauchent! Cela devient tr&egrave;s difficile &agrave; lire pour ne pas dire illisible!</p>

<figure><img alt="Example of scatter plot with messy data labels" src="../images/sections/05/AnatomyGraphic-messy-data-labels-scatterplot-fr.png" /></figure>

<p>Demandez-vous si votre public a vraiment besoin de conna&icirc;tre la valeur exacte de chaque point. Demandez-vous aussi si ce que vous voulez vraiment montrer est une tendance ou un contraste . Si vous r&eacute;pondez oui &agrave; l&rsquo;une de ces deux questions, vous voulez probablement utiliser l&rsquo;option 2.</p>

<h3>Option 2: &Eacute;tiqueter les donn&eacute;es &agrave; mettre en &eacute;vidence</h3>

<p>Quand vous essayez de montrer comment des donn&eacute;es sp&eacute;cifiques se comparent &agrave; d&rsquo;autres (par exemple, comment un pays se compare aux autres) ou que vous essayez de mettre en &eacute;vidence une tendance ou un contraste entre des valeurs &eacute;lev&eacute;es et des valeurs basses, limiter les &eacute;tiquettes de donn&eacute;es &agrave; ce que vous voulez montrer peut guider votre lecteur. Voici deux exemples pour deux publics diff&eacute;rents.</p>

<figure><img alt="Bar graph with highest and lowest bars labeled" src="../images/sections/05/AnatomyGraphic-highlighted-data-bar-fr.png" /></figure>

<p>Si votre public est int&eacute;ress&eacute; par la grande &eacute;tendue de valeurs associ&eacute;es au nombre de m&eacute;dailles gagn&eacute;es par les dix pays ayant le mieux perform&eacute; aux jeux olympiques, &eacute;tiquetez la valeur la plus &eacute;lev&eacute;e et la valeur la plus basse. En n&rsquo;&eacute;tiquetant que les extr&ecirc;mes, vous mettez en &eacute;vidence l&rsquo;&eacute;tendue des valeurs. De plus, un formatage diff&eacute;rent pour ces donn&eacute;es ajoute encore plus &agrave; la mise en &eacute;vidence. Mettre les barres des valeurs &eacute;lev&eacute;es et basses d&rsquo;une couleur diff&eacute;rente, par exemple, permet de les rep&eacute;rer rapidement.</p>

<figure><img alt="Bar graph with &Eacute;tats-Unis highlighted" src="../images/sections/05/AnatomyGraphic-france-labeled-fr.png" /></figure>

<p>Si votre public provient d&rsquo;un pays en particulier et qu&rsquo;il veut voir comment leur r&eacute;colte de m&eacute;dailles se compare &agrave; celle des autres pays, mettez en &eacute;vidence les donn&eacute;es de ce pays seulement (par exemple, la France).</p>

<h3>Option 3: Aucune &eacute;tiquette</h3>

<figure><img alt="Stacked bar without extra labels" src="../images/sections/05/AnatomyGraphic-no-data-labels-bar-fr.png" /></figure>

<p>Nous construisons des graphiques pour simplifier la fa&ccedil;on de pr&eacute;senter de l&rsquo;information. Si vous pouvez efficacement transmettre votre message sans compliquer votre repr&eacute;sentation graphique avec des &eacute;tiquettes et du texte suppl&eacute;mentaire, n&rsquo;en ajoutez pas! R&eacute;servez l&rsquo;utilisation des &eacute;tiquettes pour les occasions o&ugrave; vous aurez besoin d&rsquo;un diff&eacute;rent niveau de d&eacute;tail. Par d&eacute;faut, n&rsquo;en utilisez pas et ajoutez-en ensuite au besoin.</p>

<div data-type="warning">
<p>&Agrave; cause de la fa&ccedil;on dont le cerveau humain per&ccedil;oit les angles et les aires, il est difficile d&rsquo;&eacute;valuer visuellement les valeurs associ&eacute;es aux diff&eacute;rents secteurs d&rsquo;un graphe &agrave; secteurs. Pour cette raison, c&rsquo;est une bonne id&eacute;e d&rsquo;ajouter des &eacute;tiquettes de donn&eacute;es aux graphes &agrave; secteurs pour que l&rsquo;interpr&eacute;tation soit claire.</p>
</div>

<h2>Simple and Powerful L&eacute;gendes</h2>

<p>En ajoutant <a class="glossterm" target="_blank" href="glossary01.html# legend ">une l&eacute;gende</a>, on s&rsquo;assure que le lecteur saura ce que les diff&eacute;rentes couleur, formes et motifs sur le graphique repr&eacute;sentent. Quand vous pr&eacute;sentez un seul type de donn&eacute;es et que la couleur ou le motif n&rsquo;a aucune signification particuli&egrave;re, vous n&rsquo;avez pas besoin d&rsquo;une l&eacute;gende (comme dans les exemples de diagrammes &agrave; barres pr&eacute;sent&eacute;s au d&eacute;but du chapitre o&ugrave; l&rsquo;on ne pr&eacute;sentait que le d&eacute;compte de m&eacute;dailles gagn&eacute;es). Si vous avez plus d&rsquo;un type de donn&eacute;es repr&eacute;sent&eacute;s sur le m&ecirc;me graphique ou diagramme, une l&eacute;gende est essentielle.</p>

<p>Supposons qu&rsquo;au lieu de pr&eacute;senter le nombre totales de m&eacute;dailles gagn&eacute;es, vous voulez pr&eacute;senter le nombre total de m&eacute;dailles par type (or, argent, bronze). Vous pourriez inclure toutes les donn&eacute;es sur le m&ecirc;m graphique en utilisant une couleur diff&eacute;rente pour repr&eacute;senter les diff&eacute;rents types.</p>

  <figure><img src="../images/sections/05/AnatomyGraphic-no-data-labels-bar-fr.png" alt="Stacked bar without extra labels" /></figure>

<p>Ici, chaque couleur repr&eacute;sente un seul type de m&eacute;daille et ce type est clairement identifi&eacute; dans la l&eacute;gende qui se trouve dans le haut du graphique. Imaginez comment votre public regardera votre graphique pour d&eacute;cider de l&rsquo;emplacement de la l&eacute;gende. Dans un coin, la l&eacute;gende peut &ecirc;tre difficile &agrave; rep&eacute;rer. Par contre, si elle se trouve sur le graphique dans un espace vide (ou les barres sont plus courtes par exemple), elle peut devenir une source de distraction.</p>

<p>Le graphique ci-dessus est un bon exemple de l&rsquo;importance de bien positionner la l&eacute;gende. En alignant la l&eacute;gende au haut du diagramme &agrave; barres, il devient facile pour le lecteur de faire la correspondance entre les couleurs et la cat&eacute;gorie de donn&eacute;es (ou dans ce cas-ci, de m&eacute;dailles). Quoique le positionnement de la l&eacute;gende rel&egrave;ve en partie d&rsquo;un choix esth&eacute;tique, il ne faut pas minimiser les cons&eacute;quences de ce choix. Une l&eacute;gende bien plac&eacute;e peut aider votre public dans l&rsquo;interpr&eacute;tation de votre graphe.</p>

<h2>Des titres concis, mais percutants</h2>

<p>Enfin! Vous avez &eacute;tiquet&eacute; vos axes. Vous avez ajout&eacute; (ou d&eacute;cid&eacute; de ne pas ajouter) des &eacute;tiquettes &agrave; vos donn&eacute;es. Vous vous &ecirc;tes assur&eacute; que les cat&eacute;gories et les valeurs le long des axes sont lisibles. Vous avez maintenant l&rsquo;opportunit&eacute; de raconter votre histoire en 1-2 lignes de textes et c&rsquo;est le moment de choisir le titre de votre graphique. Le titre devrait &eacute;noncer bri&egrave;vement le message se trouvant &agrave; l&rsquo;origine de votre graphe ou diagramme. Vous avez b&acirc;ti ce graphique pour communiquer un message, quel est-il? Pas besoin d&rsquo;une phrase compl&egrave;te. Le titre devrait n&eacute;anmoins &ecirc;tre facile &agrave; comprendre, sans langage ou syntaxe compliqu&eacute;s.</p>

<p>Avant de choisir un titre, il est important de r&eacute;fl&eacute;chir &agrave; qui est votre public. Mais aussi dans quel contexte votre graphique sera-t-il publi&eacute; ? &Ecirc;tes-vous un journaliste ajoutant un graphe &agrave; un article? Un blogger cr&eacute;ant un article tr&egrave;s visuel ? Ou peut-&ecirc;tre un scientifique partageant ses r&eacute;sultats dans une revue r&eacute;vis&eacute;e par ses pairs? Un scientifique doit &eacute;noncer clairement la relation qui unit les deux variables pr&eacute;sent&eacute;es. Le journaliste doit plut&ocirc;t trouver un titre acrrocheur mettant en &eacute;vidence le message qu&rsquo;il veut partager.</p>

<p>Les titres de base &eacute;noncent clairement la relation qui existe entre la variable ind&eacute;pendante, sur l&rsquo;axe horizontal, et la variable d&eacute;pendante, sur l&rsquo;axe vertical. Par exemple, nous avons intitul&eacute; notre graphe sur la r&eacute;colte des m&eacute;dailles olympiques &ldquo;Le nombre de m&eacute;dailles gagn&eacute;es par les dix pays ayant le mieux perform&eacute;, Jeux olympiques d&rsquo;hiver de Sotchi, 2014&rdquo;. Ce titre indique au lecteur qu&rsquo;il est en train de regarder le nombre total de m&eacute;dailles gagn&eacute;es par pays et que la liste de pays est limit&eacute;e aux dix pays ayant gagn&eacute; le plus de m&eacute;dailles aux jeux olympiques d&rsquo;hiver de Sotchi en 2014. Chaque &eacute;l&eacute;ment du titre ajoute de la valeur et donne de l&rsquo;information. Il n&rsquo;y a rien de mal &agrave; utiliser un titre comme celui-l&agrave;. Quoique pas tr&egrave;s accrocheur, il est direct et r&eacute;v&egrave;le clairement &agrave; votre lecteur en quoi consiste le graphe.</p>

<p>En d&eacute;cidant de votre titre, vous pouvez aussi saisir l&rsquo;opportunit&eacute; d&rsquo;&eacute;noncer la conclusion qui devrait &ecirc;tre tir&eacute;e de votre graphique. Par exemple, prenons l&rsquo;exemple o&ugrave; le d&eacute;compte de m&eacute;dailles de la France &eacute;tait mis en &eacute;vidence. Si vous voulez qu&rsquo;on retienne que la France s&rsquo;est class&eacute;e huiti&egrave;me dans la r&eacute;colte de m&eacute;dailles (tous types confondus), vous pourriez intituler votre graphique &ldquo;La France se classe huiti&egrave;me dans le d&eacute;compte des m&eacute;dailles gagn&eacute;es, Jeux olympiques de Sotchi, 2014&rdquo;. Vous trouverez souvent ce genre de titres dans les journaux et dans d&rsquo;autres publications racontant une histoire pr&eacute;cise. Le titre du graphique offre une opportunit&eacute; suppl&eacute;mentaire de mettre certaines donn&eacute;es en &eacute;vidence et d&rsquo;amplifier votre message. Profitez-en!!</p>

<h2>&Agrave; la recherche de commentaires</h2>

<p>Un des meilleurs moyens de voir si votre graphique ou votre diagramme transmet clairement votre message est de demander &agrave; quelqu&rsquo;un d&rsquo;impartial de vous donner son opinion. C&rsquo;est le moment de demander aux amis ou aux coll&egrave;gues de prendre cinq minutes de leur temps pour nous donner leurs commentaires. Demandez &agrave; ces personnes d&rsquo;identifier toute information qu&rsquo;elles consid&egrave;rent manquante. Rappelez-vous qu&rsquo;il ne faut pas prendre les commentaires personnellement. Les meilleurs graphiques et diagrammes sont le fruit de plusieurs brouillons et r&eacute;visions. Ils n&rsquo;auraient s&ucirc;rement pas aussi bons sans l&rsquo;aide de plusieurs collaborateurs.</p>

<p>Les contributeurs de ce livre ont mis sur pied un groupe pour vous permettre de recevoir des commentaires sur vos repr&eacute;sentations graphiques. Si vous cherchez des commentaires constructifs honn&ecirc;tes provenant de gens tout &agrave; fait objectifs, le site <a href="http://helpmeviz.com/">HelpMeViz</a> est exactement ce qu&rsquo;il vous faut.</p>

<p>Cette derni&egrave;re v&eacute;rification est un bon moyen de s&rsquo;assurer que vos &eacute;tiquettes, titres et l&eacute;gende sont assez d&eacute;taill&eacute;s. Si des modifications constructives vous sont sugg&eacute;r&eacute;es, retournez &agrave; votre fichier source et faites quelques petits changements. Ce sera du temps bien investi et, au bout du compte, votre repr&eacute;sentation graphique n&rsquo;en sera que meilleure !</p>
</section>
</section>
