<section class="blue" data-type="chapter">
<header>
 <div class="icon"><img src="../images/sections/05/ColorFontIcons-icon-ampersand-fr.png" /></div>
 <p>Chapitre 15</p>
 <h1>L&rsquo;importance de la couleur, de la police de caract&egrave;res et des ic&ocirc;nes</h1>
 <p data-type="author">Par Howard Coale Adapt&eacute; par Genevi&egrave;ve Boucher</p>
</header>

<section data-type="sect1">
<h2>La forme contraint (souvent) la fonction</h2>

<p>&Eacute;couter un chanteur talentueux interpr&eacute;ter quelques mesures de &ldquo;Ne me quitte pas&rdquo; est pratiquement toujours plus agr&eacute;able que d&rsquo;&eacute;couter quelqu&rsquo;un marmonner en continue la c&eacute;l&egrave;bre formule d&rsquo;Einstein, E=MC2.   Mais cette pr&eacute;f&eacute;rence n&rsquo;est aucunement repr&eacute;sentative de la valeur de l&rsquo;information pr&eacute;sent&eacute;e.  Au contraire, cela montre comment l&rsquo;exp&eacute;rience peut modifier la perception d&rsquo;une information.  Autrement dit, en tant que designer d&rsquo;information, nous devrions tenter de ressembler davantage au chanteur qui plait &agrave; tous plut&ocirc;t qu&rsquo;&agrave; la personne qui marmonne.  Non, cela ne veut pas dire qu&rsquo;il faut &ldquo;tout changer pour rendre beau&rdquo;.  Cela signifie plut&ocirc;t qu&rsquo;il faut d&rsquo;abord et surtout reconna&icirc;tre que la pr&eacute;sentation d&rsquo;une information crue n&rsquo;est pas suffisante. Vous devez concevoir une &ldquo;exp&eacute;rience de l&rsquo;information&rdquo;.  Il faut pr&eacute;senter les donn&eacute;es d&rsquo;une fa&ccedil;on plaisante.</p>

<p>Dans ce chapitre, nous couvrirons quelques principes de base du design.  Nous d&eacute;crirons aussi quelques outils utilis&eacute;s pour influencer, orienter, clarifier, am&eacute;liorer et aiguiser l&rsquo;exp&eacute;rience et la compr&eacute;hension qu&rsquo;a le public des donn&eacute;es qui lui sont pr&eacute;sent&eacute;es.  Plus sp&eacute;cifiquement, nous discuterons de polices de caract&egrave;res, de hi&eacute;rarchies, de couleurs et d&rsquo;ic&ocirc;nes.</p>

<h3>LE MYTHE DE L&rsquo;OBJECTIVIT&Eacute;</h3>

<p>Avant de s&rsquo;attaquer aux bases du design, nous devons bien comprendre comment ce dernier peut influencer notre perception de l&rsquo;information.  En soi, la visualisation de donn&eacute;es &eacute;quivaut &agrave; raconter une histoire et aucune histoire n&rsquo;est jamais racont&eacute;e de fa&ccedil;on objective.  La repr&eacute;sentation graphique de donn&eacute;es a &eacute;t&eacute; utilis&eacute;e efficacement par le pass&eacute; autant pour de mauvaises que pour de bonnes fins :  autant par des dictateurs pour justifier des actes de violence que par des scientifiques pour pr&eacute;senter des r&eacute;sultats de recherche in&eacute;dits.</p>

<p>Ce faisant, une r&egrave;gle importante en visualisation de donn&eacute;es est d&rsquo;&ecirc;tre bien conscient que vous pr&eacute;sentez (en quelque sorte) un point de vue qui est biais&eacute;.  Si vous n&rsquo;acceptez pas cela, vous aurez peu de chance de juger efficacement de l&rsquo;honn&ecirc;tet&eacute;, de la pr&eacute;cision, de la v&eacute;racit&eacute;, de l&rsquo;&eacute;l&eacute;gance ou de l&rsquo;utilit&eacute; de votre solution de pr&eacute;sentation.  M&ecirc;me le diagramme le plus classique devrait tenter de captiver et d&rsquo;inspirer cette partie de l&rsquo;esprit humain constamment &agrave; la recherche de sens et d&rsquo;explications.  L&rsquo;esprit humain ne se contente pas de gober de l&rsquo;information, il veut comprendre.  </p>

<p>Vous qui lisez ces lignes &ecirc;tes peut-&ecirc;tre un chercheur scientifique.  Et peut-&ecirc;tre que vous mourrez d&rsquo;envie d&rsquo;intervenir dans la discussion en demandant : &ldquo;Mon graphique pr&eacute;sente le nombre de fois o&ugrave; un rat a tourn&eacute; &agrave; gauche ou &agrave; droite dans un labyrinthe.  Comment mon graphique pourrait-il refl&eacute;ter un biais ou une perspective subjective? &rdquo;   En fait, m&ecirc;me si les donn&eacute;es illustr&eacute;es montrent que le rat a tourn&eacute; 35 fois &agrave; gauche et 22 fois &agrave; droite, la fa&ccedil;on dont la pr&eacute;sentation des donn&eacute;es est construite indiquera - g&eacute;n&eacute;ralement en une ou deux secondes-- au lecteur ce qui est important et ce qui ne l&rsquo;est pas.  &Ecirc;tre conscient de ce fait durant le processus de conception peut vous amener &agrave; produire une repr&eacute;sentation graphique plus efficace et vous place dans une meilleure position pour r&eacute;fl&eacute;chir &agrave; ce que vous voulez exprimer.</p>

<h2>Polices de caract&egrave;res et texte </h2>

<h3>VISIBILIT&Eacute; ET LISIBILIT&Eacute;</h3>

<p>Lorsque l&rsquo;on veut cr&eacute;er une exp&eacute;rience &agrave; partir d&rsquo;un ensemble de donn&eacute;es pr&eacute;cis, la r&egrave;gle la plus importante est de s&rsquo;efforcer de privil&eacute;gier la simplicit&eacute; dans chacun des choix qui se pr&eacute;sentent. </p><p>Le style de la pr&eacute;sentation ne devrait jamais recevoir toute l&rsquo;attention (le style esth&eacute;tique devrait soutenir les donn&eacute;es, pas l&rsquo;inverse!).  Ceci s&rsquo;applique &agrave; chaque aspect de la repr&eacute;sentation graphique, du choix du graphe ou du diagramme en passant par la s&eacute;lection de la police de caract&egrave;res.  Dans le monde de la typographie, l&rsquo;&eacute;quilibre entre la visibilit&eacute; et la lisibilit&eacute; est une d&eacute;cision que doit prendre le typographe lors  de la conception d&rsquo;une police.  Les polices qui sont  lisibles  (i.e. un caract&egrave;re se distingue ais&eacute;ment des autres) ne sont pas n&eacute;cessairement toutes visibles (i.e. con&ccedil;ues de mani&egrave;re &agrave; supporter et faciliter la lecture pour que le lecteur assimile bien la signification du texte sans &ecirc;tre distrait par la police).</p>

<p>Ainsi, il y a plusieurs polices de caract&egrave;res qui sont sp&eacute;cialement con&ccedil;ues pour capter l&rsquo;attention.  Par exemple: </p>

<figure><img alt="Display fonts" src="../images/sections/05/ColorFontIcons-display-fonts-fr.png" /></figure>

<p>Ces &ldquo;caract&egrave;res de titrage&rdquo; constituent de bons exemples de polices qui sont visibles, mais non lisibles.   Ces polices ont &eacute;t&eacute; cr&eacute;&eacute;es  pour mettre en &eacute;vidence de petits bouts de texte, comme des titres, ou pour ajouter du style (au lieu de communiquer l&rsquo;information rapidement et de mani&egrave;re transparente).  De fa&ccedil;on g&eacute;n&eacute;rale, vous devriez &eacute;viter d&rsquo;utiliser des caract&egrave;res de titrage pour faire de la visualisation de donn&eacute;es car ce genre de police demande un effort suppl&eacute;mentaire au lecteur.  Vous ne pouvez pas vous permettre que vos lecteurs perdent une seconde, ou m&ecirc;me une demi-seconde, &agrave; essayer de d&eacute;chiffrer ce que le texte indique.  Vous ne voulez pas non plus qu&rsquo;une police influence votre public.   En effet, il arrive que certaines polices soient automatiquement associ&eacute;es &agrave; certains types de contenu dans la t&ecirc;te des gens.  Difficile de ne pas penser &agrave; Charlie Brown quand on aper&ccedil;oit la police Comic Sans.  </p>

<p>Nous pouvons ici faire un rapprochement entre la visualisation de donn&eacute;es et la narration &eacute;crite.  Si le public devient trop attentif au style utilis&eacute; pour raconter l&rsquo;histoire, il peut devenir distrait et passer &agrave; c&ocirc;t&eacute; du sens ou des d&eacute;tails importants du contenu rapport&eacute;.  Pour r&eacute;sumer,  vous devrez utiliser des polices de caract&egrave;res qui sont lisibles et vous efforcez de les pr&eacute;senter de mani&egrave;re visible.</p>

<p>Les polices qui font un bon travail en visualisation de donn&eacute;es pour communiquer un message sans trop attirer l&rsquo;attention sur elles-m&ecirc;mes incluent Helvetica, Arial et Gill Sans.  En g&eacute;n&eacute;ral, il est pr&eacute;f&eacute;rable d&rsquo;utiliser des polices sans Serif pour les nombres (dans n&rsquo;importe quel type de diagrammes) car les polices Serif ont tendance &agrave; ajouter du &ldquo;bruit visuel&rdquo; plus difficile &agrave; interpr&eacute;ter. Par exemple :</p>

<figure><img alt="Comparison of sans serif and serif fonts" src="../images/sections/05/ColorFontIcons-sans-serif-vs-serif-fonts-fr.png" /></figure>

<p>Croyez-le ou non, votre cerveau prend une fraction de seconde de plus &agrave; d&eacute;chiffrer les nombres de droite.  Pourquoi?  Parce que les polices Serif pr&eacute;sentent des variations de style aux extr&eacute;mit&eacute;s des caract&egrave;res, au niveau de leur taille et de leur forme, ce qui demande plus d&rsquo;efforts &agrave; nos yeux et &agrave; notre cerveau.</p>

<figure><img alt="Highlight serif font" src="../images/sections/05/ColorFontIcons-highlighted-serifs-fr.png" /></figure>

<p>Comme la visualisation de donn&eacute;es a pour objectif d&rsquo;acc&eacute;l&eacute;rer le processus de compr&eacute;hension, vous voulez rester loin de tout ce qui pourrait ralentir la vitesse de compr&eacute;hension de votre lecteur, m&ecirc;me si &ccedil;a se joue en fractions de seconde.</p>

<h2>Hi&eacute;rarchie</h2>

<p>Concernant la vitesse de compr&eacute;hension, sachez que l&rsquo;un des moyens les plus utiles pour l&rsquo;acc&eacute;l&eacute;rer est d&rsquo;utiliser une hi&eacute;rarchie.  Une hi&eacute;rarchie r&eacute;f&egrave;re aux fa&ccedil;ons dont nous organisons et classons l&rsquo;information dans le but de permettre &agrave; notre public de capter plus facilement et plus rapidement la signification de ce qu&rsquo;il lit ou regarde.</p>

<p>L&rsquo;exemple le plus familier de l&rsquo;utilisation d&rsquo;une hi&eacute;rarchie est probablement le bon vieux plan que nous faisions &agrave; l&rsquo;&eacute;cole avant d&rsquo;&eacute;crire un texte.  En morcelant l&rsquo;information en titres, sous-titres, informations importantes et d&eacute;tails, vous cr&eacute;ez une carte claire de vos intentions.  Il est alors possible de le survoler rapidement  pour absorber le contenu en ne s&rsquo;attardant qu&rsquo;aux d&eacute;tails qui nous int&eacute;ressent.</p>

<p>Une repr&eacute;sentation graphique avec une hi&eacute;rarchie claire indique au lecteur comment saisir l&rsquo;information et dans quel ordre, que ce soit de la plus importante &agrave; la moins importante ou bien de l&rsquo;id&eacute;e g&eacute;n&eacute;rale aux d&eacute;tails pertinents.</p><p>Une hi&eacute;rarchie peut aussi donner au lecteur la libert&eacute; de choisir sur quelles donn&eacute;es il portera son attention.  Ceci est particuli&egrave;rement utile quand une grande quantit&eacute; de donn&eacute;es est pr&eacute;sent&eacute;e.</p>

<p>Les polices de caract&egrave;res peuvent aider &agrave; &eacute;tablir une hi&eacute;rarchie : en variant leur taille (11pt vs 14pt) ou leur style (gras, italique, lettres majuscules), on varie aussi l&rsquo;importance du texte associ&eacute;.</p><p>La couleur, lorsqu&rsquo;utilis&eacute;e de fa&ccedil;on s&eacute;lective et coh&eacute;rente, peut aussi aider &agrave; construire une hi&eacute;rarchie en accentuant certains aspects et en guidant les yeux du lecteur de fa&ccedil;on &agrave; faciliter la compr&eacute;hension.  Parmi les autres moyens fr&eacute;quemment utilis&eacute;s, nous retrouvons les retours de ligne, les &eacute;num&eacute;rations (listes de points num&eacute;rot&eacute;s ou non), les indentations, etc.  </p><p>Les moyens et les m&eacute;thodes pour cr&eacute;er des hi&eacute;rarchie sont infinis, mais souvenez-vous que la r&egrave;gle d&rsquo;or est la simplicit&eacute;!  Vous ne voulez pas que les moyens utilis&eacute;s pour &eacute;laborer une hi&eacute;rarchie distraient votre public de l&rsquo;exp&eacute;rience que vous essayez de cr&eacute;er.</p>

<h2>Couleur</h2>

<h3>EN NOIR ET BLANC D&rsquo;ABORD, LA COULEUR ENSUITE</h3>

<p>Pour paraphraser le designer Paul Rand, si un design n&rsquo;a pas de sens en noir et blanc, il en aura encore moins avec de la couleur.  Ceci ne signifie pas que toutes les repr&eacute;sentations graphiques de donn&eacute;es doivent &ecirc;tre en noir et blanc.  Toutefois, il faut &ecirc;tre conscient qu&#39;un graphique repose sur un &eacute;quilibre entre les lignes et les aires, le fonc&eacute; et le clair, l&rsquo;agencement et la structure.   Ces &eacute;l&eacute;ments constituent les fondations de toutes repr&eacute;sentations visuelles et devraient pouvoir se suffire &agrave; eux-m&ecirc;mes.</p>

<p>Depuis le d&eacute;but, nous avons convenu que nous construisons des repr&eacute;sentations graphiques de nos donn&eacute;es pour les rendre plus claires, plus compr&eacute;hensibles et plus accessibles.  Pour leur donner un contexte qui les rend plus facilement interpr&eacute;tables.  </p><p>La couleur est un outil qui ne devrait jamais &ecirc;tre utilis&eacute; comme point de d&eacute;part.  Tentez toujours de concevoir et de planifier vos graphes et diagrammes en noir et blanc autant que possible.  Appliquez ensuite de la couleur d&#39;une fa&ccedil;on conventionnelle en ayant comme objectif principal d&rsquo;accentuer certains points et d&rsquo;am&eacute;liorer la compr&eacute;hension.  Au moment d&rsquo;ajouter de la couleur, gardez en t&ecirc;te les trois points qui suivent.</p>

<h3>N&rsquo;OUBLIEZ PAS LE GRIS</h3>

<p>Le gris est l&rsquo;une des plus importantes couleurs de votre palette car il rehausse les couleurs adjacentes.  Dans le monde du design d&rsquo;information, le gris est critique pour modifier, clarifier et &eacute;quilibrer presque toutes les palettes de couleurs et nuancer la compr&eacute;hension globale d&rsquo;un graphe.</p>

<figure><img alt="Simple color palette" src="../images/sections/05/ColorFontIcons-palette-with-gray-fr.png" /></figure>

<h3>LES COULEURS PEUVENT &Ecirc;TRE UTILIS&Eacute;ES POUR EXPRIMER UNE VALEUR</h3>

<p>N&rsquo;oubliez pas que la couleur peut &ecirc;tre utilis&eacute;e pour d&eacute;signer des valeurs.  Ceci dit, lorsque vous utilisez la couleur pour repr&eacute;senter une &eacute;tendue de valeurs ou une gradation de n&rsquo;importe quel type, n&rsquo;oubliez pas de regarder votre graphique en retirant toute la couleur/saturation.  Ceci aide &agrave; garantir que les diff&eacute;rents tons choisis apparaissent vraiment comme des valeurs diff&eacute;rentes pour les yeux.</p>

<figure><img alt="Comparison of color graph and grayscale version" src="../images/sections/05/ColorFontIcons-color-vs-grayscale-fr.png" /></figure>

<h3>LE R&Ocirc;LE DES ESPACES BLANCS DANS LA PERCEPTION DE LA COULEUR</h3>

<p>Si vous &eacute;tiez en train de peindre, vous pourriez m&eacute;langer les couleurs pour qu&rsquo;elles se fondent les unes dans les autres pour cr&eacute;er un effet unifi&eacute;.  Quoique joli, ce n&rsquo;est pas conseill&eacute; en visualisation de donn&eacute;es.  En effet, chaque couleur utilis&eacute;e doit l&rsquo;&ecirc;tre pour une raison et se doit d&rsquo;&ecirc;tre distincte.  Si vous cr&eacute;ez un graphique o&ugrave; un lent d&eacute;grad&eacute; de couleurs a une signification particuli&egrave;re  -- comme &ccedil;a peut &ecirc;tre le cas si vous repr&eacute;sentez des donn&eacute;es sur le climat, les &eacute;lections ou tout autre variable continue -- , le changement et la fusion des couleurs deviennent alors importants pour l&rsquo;interpr&eacute;tation des donn&eacute;es.  </p><p>Cependant, dans de nombreux cas, les couleurs ont besoin d&rsquo;&ecirc;tre s&eacute;par&eacute;es les unes des autres puisqu&rsquo;elles repr&eacute;senteront une valeur ou un attribut unique.  Elles aident ainsi le lecteur &agrave; faire clairement la distinction entre les valeurs.  Dans ces cas-l&agrave;, les couleurs ont besoin d&rsquo;espace pour respirer et les espaces blancs sont l&agrave; pour &ccedil;a.</p>

<figure><img alt="Boxes with and without whitespace" src="../images/sections/05/ColorFontIcons-palette-with-whitespace-fr.png" /></figure>

<h2>Ic&ocirc;nes</h2>

<h3>UNE PETITE HISTOIRE</h3>

<p>La premi&egrave;re interface graphique (&ldquo;graphical user interface&rdquo; ou GUI) a &eacute;t&eacute; introduite par Xerox en 1981 sur l&rsquo;ordinateur personnel Star, aussi connu sous le nom &ldquo;8010 Information System&rdquo;.  Les id&eacute;es qui ont inspir&eacute; cette interface ont d&rsquo;abord &eacute;t&eacute; explor&eacute;es en 1975 par l&rsquo;un de ses concepteurs principaux, David Canfield Smith, dans sa th&egrave;se de doctorat intitul&eacute;e &ldquo;Pygmalion : un environnement de programmation cr&eacute;atif&rdquo; (Pygmalion: A Creative Programming Environment). Quelques ann&eacute;es plus tard, Steve Jobs a &ldquo;emprunt&eacute;&rdquo; les id&eacute;es de Smith et de Xerox pour son ordinateur Macintosh.  Et le reste s&rsquo;est encha&icirc;n&eacute;. Seulement quelques d&eacute;cennies plus tard, les deux tiers des sept milliards de personnes peuplant la Terre utilisent un t&eacute;l&eacute;phone mobile largement pilot&eacute; par une interface graphique bas&eacute;e sur des ic&ocirc;nes.</p>

<p>Pourtant, les pictogrammes simples et faciles &agrave; retenir sont utilis&eacute;s depuis le N&eacute;olitique pour repr&eacute;senter de l&rsquo;information trop complexe pour &ecirc;tre expliqu&eacute;e en un minimum d&rsquo;espace.  Dans le domaine de la visualisation de donn&eacute;es, on utilisait d&eacute;j&agrave; l&rsquo;iconographie au 15 si&egrave;cle.  &Agrave; cette &eacute;poque, elle empruntait plusieurs notions &agrave; d&rsquo;autres disciplines connues qui n&eacute;cessitaient  pr&eacute;cision et exactitude en dessin telles que l&rsquo;architecture, la d&eacute;fense militaire, la cartographie, l&rsquo;alchimie et l&rsquo;astronomie. </p>

<h3>SOYEZ SCEPTIQUE ET PRIVIL&Eacute;GIEZ LE SENS LITT&Eacute;RAL</h3>

<p>L&rsquo;utilisation des ic&ocirc;nes est maintenant tellement r&eacute;pandue et habituelle que ces derni&egrave;res sont souvent ajout&eacute;es sans trop de r&eacute;flexion.  Les gens ont l&rsquo;impression que des ic&ocirc;nes sont n&eacute;cessaires pour qu&rsquo;une application mobile soit une application mobile ou pour qu&rsquo;un site web soit convivial.  Il en r&eacute;sulte que nous les voyons sans trop nous demander pourquoi elles sont l&agrave; en premier lieu.</p>

<p>C&rsquo;est pourquoi, lorsque vous cr&eacute;ez des repr&eacute;sentations graphiques, vous devrez consid&eacute;rer l&rsquo;utilisation des ic&ocirc;nes avec prudence.  Si vous pouvez clarifier quelque chose en utilisant le petit espace mis &agrave; votre disposition sans utiliser d&rsquo;ic&ocirc;ne, n&rsquo;en utilisez pas.  Pourquoi?  Parce les ic&ocirc;nes peuvent parfois rendre les choses plus obscures, pas  plus claires.  D&egrave;s que vous entendez quelqu&rsquo;un demander &ldquo;Qu&rsquo;est-ce que cette ic&ocirc;ne signifie?&rdquo;, vous avez perdu la bataille pour la simplicit&eacute;.  Ceci est vrai pour les ic&ocirc;nes qui sont utilis&eacute;es comme identifiants m&eacute;taphoriques en infographie ou en visualisation de donn&eacute;es.  C&rsquo;est aussi vrai pour les ic&ocirc;nes fonctionnelles qui accomplissent une t&acirc;che ou r&eacute;v&egrave;lent plus d&rsquo;informations dans le cas d&rsquo;une repr&eacute;sentation interactive.</p>

<figure><img alt="Pictogram for temperature preference" src="../images/sections/05/ColorFontIcons-many-icons-pictogram-fr.png" /></figure>

<p>Il serait tr&egrave;s difficile de ne pas comprendre ce que les ic&ocirc;nes repr&eacute;sentent ici ; une ic&ocirc;ne en forme de personne &eacute;quivaut &agrave; une personne.  La repr&eacute;sentation est tr&egrave;s litt&eacute;rale et c&rsquo;est pourquoi il est facile de la comprendre.  En effet,  plus une ic&ocirc;ne est litt&eacute;rale et simple, plus elle est efficace.  Le choix des ic&ocirc;nes s&rsquo;apparente au choix d&rsquo;une police de caract&egrave;res : si les lecteurs prennent trop de temps &agrave; d&eacute;crypter leur signification, ils passeront souvent &agrave; c&ocirc;t&eacute; du sens du contenu qui leur est pr&eacute;sent&eacute;.  Voici une autre version de la figure pr&eacute;c&eacute;dente pr&eacute;sentant la m&ecirc;me information :</p>

<figure><img alt="Single icon pictogram for temperature preference" src="../images/sections/05/ColorFontIcons-single-icon-pictogram-fr.png" /></figure>

<p>Ce sont exactement les m&ecirc;mes donn&eacute;es qui sont pr&eacute;sent&eacute;es ici.  Vous ne trouvez pas que cela prend plus de temps &agrave; comprendre la repr&eacute;sentation?  Pourquoi?  Parce qu&rsquo;avant que les lecteurs puissent correctement interpr&eacute;ter les donn&eacute;es, ils doivent cr&eacute;er une m&eacute;taphore complexe dans leur t&ecirc;te.  D&rsquo;abord, la repr&eacute;sentation demande aux lecteurs d&rsquo;imaginer que l&rsquo;ic&ocirc;ne repr&eacute;sente les vingt sujets &agrave; la fois tout en leur demandant aussi de diviser cette personne m&eacute;taphorique selon un ensemble de crit&egrave;res.  Aussi simple qu&rsquo;elles puissent para&icirc;tre, les ic&ocirc;nes requi&egrave;rent que l&rsquo;esprit les repr&eacute;sente comme quelque chose d&rsquo;autre. Plus vous demandez &agrave; un symbole de repr&eacute;senter quelque chose loin de son sens (donc moins il est litt&eacute;ral), moins le r&eacute;sultat est clair.  Quand vient le temps d&rsquo;utiliser des symboles et des ic&ocirc;nes de toutes sortes, restez-en &agrave; une signification simple.</p>

<p>Lorsque vous utilisez des ic&ocirc;nes dans vos graphes, vous devriez toujours vous assurer qu&rsquo;elles ont la bonne taille.  Une erreur fr&eacute;quente consiste &agrave; adater la taille d&rsquo;une ic&ocirc;ne dans les deux dimensions, ce qui m&egrave;ne &agrave; une comparaison visuelle incorrecte.  Dans l&rsquo;image ci-dessous, la hauteur de la personne a &eacute;t&eacute; tripl&eacute;e pour indiquer que la valeur du groupe B est trois fois celle du groupe A.  Cependant, afin de garder le ratio de l&rsquo;image, la largeur a aussi &eacute;t&eacute; tripl&eacute;e.  La personne repr&eacute;sentant le groupe B devient donc neuf fois plus grande que la personne imag&eacute;e du groupe A au lieu de trois. </p>

<figure><img alt="Improper scaling" src="../images/sections/05/ColorFontIcons-improper-scaling-fr.png" /></figure>


<h3>SOYEZ CONSCIENTS DE VOS BESOINS FUTURS </h3>

<p>Lorsque de nouveaux courtiers rejoignent une soci&eacute;t&eacute; d&rsquo;investissement, il n&rsquo;est pas rare que quelqu&rsquo;un leur montre les logiciels utilis&eacute;s par la compagnie dans la salle des march&eacute;s en disant : &ldquo;Sois sans crainte, tu comprendras tout ce que les ic&ocirc;nes veulent dire apr&egrave;s quelques semaines&rdquo;.  Une prolif&eacute;ration massive d&rsquo;ic&ocirc;nes dans une interface ou une repr&eacute;sentation graphique indique souvent que des options ont &eacute;t&eacute; ajout&eacute;es apr&egrave;s la planification et la d&eacute;finition du design et, dans le contexte d&rsquo;une visualisation de donn&eacute;es interactive,  apr&egrave;s que le d&eacute;veloppement ait eu lieu.</p>

<p>Voici un exemple simplifi&eacute; d&rsquo;un type de menu dynamique  d&rsquo;ic&ocirc;nes souvent retrouv&eacute; dans les tableaux de bord d&rsquo;analyse financi&egrave;re.  Il est probablement pass&eacute; par plusieurs it&eacute;rations o&ugrave; des fonctionnalit&eacute;s ont &eacute;t&eacute; ajout&eacute;es avec le temps.</p>

<figure><img alt="Icon dashboard" src="../images/sections/05/ColorFontIcons-dashboard-icons-fr.png" /></figure>

<p>Un des d&eacute;fis les plus importants dans la repr&eacute;sentation graphique de donn&eacute;es est de trouver comment garder les choses le plus simple possible en g&eacute;rant bien l&rsquo;augmentation de la complexit&eacute; des choix offerts aux lecteurs ou aux utilisateurs.  Beaucoup d&rsquo;informations doivent parfois &ecirc;tre pr&eacute;sent&eacute;es en m&ecirc;me temps.  Les ic&ocirc;nes sont parfois utilis&eacute;es pour r&eacute;soudre ce probl&egrave;me, mais comme vous pouvez voir dans l&rsquo;exemple pr&eacute;c&eacute;dent, elles cr&eacute;ent parfois de la confusion.</p>

<p>Le meilleur moyen d&rsquo;&eacute;viter cela est de prendre son temps durant le travail initial de conception pour &eacute;valuer quelles pourraient &ecirc;tre les exigences des prochaines it&eacute;rations.  Demandez-vous quelles options ou quels affichages pourraient &ecirc;tre ajout&eacute;s dans le futur.  Ou bien, dans le cas d&rsquo;un affichage complexe et interactif des donn&eacute;es, demandez-vous quelles fonctionnalit&eacute;s pourraient &ecirc;tre introduites et si ces fonctionnalit&eacute;s changeraient la nature de votre repr&eacute;sentation dans son ensemble.</p>

<p>Ces principes constituent seulement quelques-unes des lignes directrices &agrave; garder en t&ecirc;te lors de l&rsquo;utilisation des ic&ocirc;nes en infographie ou dans l&rsquo;&eacute;laboration d&rsquo;une visualisation complexe de donn&eacute;es.</p>
</section>
</section>
