<section class="green" data-type="chapter">
<header>
<div class="icon"><img src="../images/sections/05/illustrate.png" /></div>

<p>Chapitre 12</p>

<h1>Choisir ses donn&eacute;es et la mani&egrave;re de les pr&eacute;senter</h1>

<p data-type="author">Par Margie Henry Adapt&eacute; par Genevi&egrave;ve Boucher</p>
</header>

<section data-type="sect1">
<p>Pour cr&eacute;er une visualisation graphique r&eacute;ussie de ses donn&eacute;es, il faut d&rsquo;abord pr&eacute;parer le terrain. Si elle est ex&eacute;cut&eacute;e soigneusement, cette &eacute;tape pr&eacute;paratoire nous aide &agrave; d&eacute;terminer quels aspects de nos donn&eacute;es visualiser et comment bien le faire. Pour bien pr&eacute;parer le terrain, il faut commencer par un petit remue-m&eacute;ninge. Vous pouvez le faire seul dans un moment de calme ou bien en &eacute;quipe. L&rsquo;exercice vise deux objectifs : d&eacute;finir votre message et identifier votre public cible. La s&eacute;quence n&rsquo;est pas importante. Vous pouvez commencer par l&rsquo;un ou l&rsquo;autre mais les deux sujets sont &agrave; traiter !</p>

<h2>D&eacute;finir votre message</h2>

<p>Avant de s&rsquo;attaquer &agrave; la fa&ccedil;on de pr&eacute;senter les donn&eacute;es, prenez quelques minutes pour d&eacute;cider de ce que vous voulez dire. Oubliez un instant vos r&eacute;seaux sociaux, &eacute;loignez-vous de votre ordinateur et consid&eacute;rer le message pr&eacute;cis que vous voulez communiquer. Demandez-vous : &ldquo;Qu&rsquo;est-ce que je sais? Qu&rsquo;est-ce que cela signifie? Et pourquoi est-ce que je crois que c&rsquo;est important?&rdquo;.</p>

<p>Consid&eacute;rons un jeu de donn&eacute;es contenant des observations sur les effets de la consommation de diff&eacute;rents types de boissons caf&eacute;in&eacute;es. Ne vous arr&ecirc;tez pas &agrave; &ldquo;la caf&eacute;ine affecte le corps&rdquo;. Vous ne voulez jamais pr&eacute;senter des donn&eacute;es qui m&egrave;neraient &agrave; la question : &ldquo;Mais encore?&rdquo;. Il faut creuser un peu plus. Soyez plus pr&eacute;cis. Que disent vos donn&eacute;es &agrave; propos de la fa&ccedil;on dont la caf&eacute;ine affecte le corps? Est-ce que les effets sont tous mauvais? Ou tous bons? Est-ce une combinaison des deux? Est-ce que les effets diff&egrave;rent selon l&rsquo;&acirc;ge ou le sexe de la personne? Est-ce que certaines boissons sont meilleures ou pires que d&rsquo;autres pour la sant&eacute;? Est-ce que cela d&eacute;pend seulement du taux de caf&eacute;ine? Votre r&eacute;ponse doit &ecirc;tre concise, claire et aller droit au but. Une affirmation telle que &ldquo;une consommation mod&eacute;r&eacute;e de caf&eacute; permet de r&eacute;duire le risque de d&eacute;velopper certaines maladies car le caf&eacute; contient des antioxydants&rdquo; va beaucoup plus loin que notre affirmation originale statuant que &ldquo;la caf&eacute;ine affecte le corps&rdquo;. Mieux encore, notre seconde affirmation d&eacute;finit un axe clair pour orienter nos repr&eacute;sentations graphiques en plus de mettre en place le langage &agrave; utiliser pour communiquer notre message &agrave; notre public.</p>

<p>Est-ce que des souvenirs de vos cours de r&eacute;daction commencent &agrave; remonter &agrave; la surface? On y apprenait que pour &eacute;crire un bon texte, on devait d&rsquo;abord d&eacute;finir notre message et organiser nos id&eacute;es. La cr&eacute;ation d&rsquo;un graphique clair s&rsquo;apparente beaucoup &agrave; la r&eacute;daction d&rsquo;un texte. Et si vous ne pouvez pas r&eacute;sumer votre message en seulement quelques phrases concises, c&rsquo;est probablement parce que vous ne ma&icirc;triser pas assez votre sujet. C&rsquo;est un peu dur comme affirmation, mais pas autant que de pr&eacute;senter nos graphiques &agrave; un public perdu qui se d&eacute;sint&eacute;resse tranquillement. Combattez l&rsquo;envie de sauter cette &eacute;tape! Si vous &ecirc;tes le type papier-crayon, allez-y, &eacute;crivez votre message dans votre bloc-notes. Vous pourrez vous y r&eacute;f&eacute;rer &agrave; tout moment durant votre processus de <a class="glossterm" href="glossary01.html#visualization-data" target="_blank">cr&eacute;ation de repr&eacute;sentations de donn&eacute;es</a>.</p>

<p>Pour r&eacute;sumer simplement, vos chances de cr&eacute;er une repr&eacute;sentation convaincante, captivante et bien organis&eacute;e sont infiniment plus &eacute;lev&eacute;es si vous vous basez sur un message clair et cibl&eacute;.</p>

<h2>Comprendre votre public cible</h2>

<p>Vous avez d&eacute;termin&eacute; votre message. Consid&eacute;rons maintenant l&rsquo;importance de bien comprendre son public. Cela vous aidera grandement &agrave; d&eacute;terminer quelles donn&eacute;es utiliser et comment les illustrer.</p>

<p>Le public de vos repr&eacute;sentations graphiques peut &ecirc;tre de diff&eacute;rentes natures. Vous pr&eacute;senterez peut-&ecirc;tre vos graphiques dans le cadre d&rsquo;une pr&eacute;sentation orale ou peut-&ecirc;tre que vos graphiques seront publi&eacute;s dans une revue ou sur le web. Peu importe si votre public est un auditoire ou des lecteurs, prenez un moment pour vous demander : &ldquo; Quelle information a le plus de valeur pour mon public?&rdquo;, &ldquo;Quel r&ocirc;le ma repr&eacute;sentation visuelle jouera dans ce dialogue entre lui et moi?&rdquo; et &ldquo;Quelle(s) r&eacute;action(s)/action(s) ai-je envie de provoquer?&rdquo;. Prendriez-vous le temps d&rsquo;expliquer des notions &eacute;l&eacute;mentaires de math&eacute;matiques &agrave; des ing&eacute;nieurs? En principe, la bonne r&eacute;ponse est non. Vous perdriez un peu votre temps. Plus vous connaitrez votre public cible, plus grandes seront vos chances de cr&eacute;er une pr&eacute;sentation visuelle r&eacute;ussie et appr&eacute;ci&eacute;e.</p>

<p>Imaginons que vous pr&eacute;sentiez des donn&eacute;es sur &ldquo;La protection de l&rsquo;environnement au nouveau mill&eacute;naire&rdquo; dans trois situations diff&eacute;rentes : (1) sur un blog visit&eacute; principalement par des environnementalistes; (2) dans une salle de classe; (3) lors d&rsquo;un &eacute;v&eacute;nement de lev&eacute;e de fonds pour une fondation oeuvrant pour la protection de l&rsquo;environnement. Est-ce que vous utiliseriez les m&ecirc;mes donn&eacute;es et les m&ecirc;mes explications pour ces trois publics? Les pr&eacute;senteriez-vous de la m&ecirc;me fa&ccedil;on? Esp&eacute;rons que non! Vous devriez &ecirc;tre en mesure d&rsquo;&eacute;valuer ce qui est le plus pertinent de pr&eacute;senter &agrave; votre public m&ecirc;me si vous n&rsquo;avez jamais rencontr&eacute; personnellement ses membres.</p>

<p>Dans notre premier sc&eacute;nario, nous pouvons supposer que les visiteurs du blog sont d&eacute;j&agrave; int&eacute;ress&eacute;s par votre sujet : la protection de l&rsquo;environnement. Ils ont peut-&ecirc;tre eux-m&ecirc;mes pass&eacute; du temps &agrave; se documenter sur ce sujet. On peut supposer qu&rsquo;une partie de ces visiteurs sont des visiteurs r&eacute;guliers qui veulent conna&icirc;tre votre point de vue; ils vous voient peut-&ecirc;tre comme un expert. Votre blog n&rsquo;est probablement pas le seul site qu&rsquo;ils visitent pour s&rsquo;informer sur le sujet, mais celui-ci pourrait devenir un jour leur pr&eacute;f&eacute;r&eacute;! Nous pouvons au moins consid&eacute;rer qu&rsquo;ils sont arriv&eacute;s sur votre blog de fa&ccedil;on intentionnelle (et non pas &agrave; cause d&rsquo;une erreur de leur moteur de recherche pr&eacute;f&eacute;r&eacute;!). Dans un tel cas, l&rsquo;ampleur et la profondeur du contenu sont primordiales. Vous pouvez prendre plus de temps pour explorer, d&eacute;construire et restructurer les donn&eacute;es. Si votre site a pour but d&rsquo;inciter les visiteurs &agrave; aller plus loin dans leur r&eacute;flexion, vous pouvez pr&eacute;senter des &eacute;l&eacute;ments visuels qui posent des questions ou qui forcent les visiteurs &agrave; remettre en question leurs propres croyances.</p>

<p>Le sc&eacute;nario de la salle de classe est un peu diff&eacute;rent. Vous pouvez a priori supposer que votre public poss&egrave;de tr&egrave;s peu de connaissances sur le sujet (m&ecirc;me si, comme toujours, certains en conna&icirc;tront toujours plus sur votre sujet que d&rsquo;autres). Aussi, la pr&eacute;sence des &eacute;tudiants est peut-&ecirc;tre obligatoire et non volontaire. Dans un tel cas, garder leur int&eacute;r&ecirc;t repr&eacute;sentera un d&eacute;fi. Vous voudrez pr&eacute;senter des graphiques captivants, vulgarisant les concepts, captant l&rsquo;attention et traitant des probl&egrave;mes environnementaux les plus urgents afin de les interpeller. Vous devrez porter une attention particuli&egrave;re &agrave; votre vocabulaire : expliquez les mots les plus techniques et incluez davantage d&rsquo;indicateurs visuels qualitatifs (bon/mauvais, positif/n&eacute;gatif) que quantitatifs. Votre repr&eacute;sentation graphique a pour but d&rsquo;insister sur l&rsquo;importance de prot&eacute;ger l&rsquo;environnement, elle doit laisser peu de place aux doutes.</p>

<p>Enfin, dans notre troisi&egrave;me sc&eacute;nario, vous pr&eacute;sentez vos donn&eacute;es devant un public lors d&rsquo;une lev&eacute;e de fonds. Cette audience a besoin de sentir que la protection de l&rsquo;environnement est une cause qui m&eacute;rite leur support financier. Nous pouvons supposer que ce public sera compos&eacute; de toutes sortes de gens : des donateurs int&eacute;ress&eacute;s, leurs accompagnateurs d&eacute;sint&eacute;ress&eacute;s (qui sont l&agrave; pour les boissons et la nourriture gratuites), des experts du domaine, des employ&eacute;s, des stagiaires... Vous pouvez supposer qu&rsquo;ils s&rsquo;attendront &agrave; un discours &eacute;quilibr&eacute; entre les sentiments (principalement l&rsquo;urgence d&rsquo;agir) et les faits (qui se doivent d&rsquo;&ecirc;tre solides). Comme nous avons pr&eacute;sum&eacute; que cette foule est compos&eacute;e d&rsquo;une panoplie de gens aux attentes diff&eacute;rentes, vous voudrez utiliser un langage qui est &agrave; la fois familier et facile &agrave; comprendre sans toutefois para&icirc;tre condescendant. Ce public s&rsquo;attend &agrave; ce que leur int&eacute;r&ecirc;t pour la protection de l&rsquo;environnement soit confirm&eacute; et vos repr&eacute;sentations graphiques devraient aller en ce sens. Comme pour le groupe d&rsquo;&eacute;tudiants, aucune question &eacute;vidente ne doit rester sans r&eacute;ponse.</p>

<div data-type="warning">
<p>Pr&eacute;senter du contenu bas&eacute; sur les sentiments ne signifie pas qu&rsquo;il faut laisser de c&ocirc;t&eacute; des faits majeurs parce qu&rsquo;ils ne s&rsquo;inscrivent pas bien dans notre histoire id&eacute;ale ou n&rsquo;appuient pas notre message. Soyez tr&egrave;s vigilant et m&ecirc;me si vous &ecirc;tes motiv&eacute; par une cause, faites de votre mieux pour vous assurer que vos valeurs n&rsquo;interf&egrave;rent pas avec une pr&eacute;sentation exacte des donn&eacute;es.</p>
</div>

<p>Maintenant que nous avons discut&eacute; de l&rsquo;importance de d&eacute;finir un message cl&eacute; et de celle de bien identifier son public, il est temps de se demander quelles donn&eacute;es doivent &ecirc;tre illustr&eacute;es.</p>

<h2>Quelles donn&eacute;es illustrer?</h2>

<p>Si vous devez pr&eacute;senter plusieurs graphiques devant un public, il faut vous servir de chaque graphique pour faire progresser une histoire. Comme les pages d&rsquo;un roman policier qui nous conduisent progressivement vers la r&eacute;solution de l&rsquo;&eacute;nigme. Le but est de pr&eacute;senter une s&eacute;quence ou un ensemble de faits qui conduiront graduellement votre public vers votre message cl&eacute;. Les donn&eacute;es que vous choisissez d&rsquo;illustrer doivent d&eacute;finir le contexte, &eacute;tablir les principaux points d&rsquo;int&eacute;r&ecirc;t et expliquer comment ces &eacute;l&eacute;ments sont reli&eacute;s entre eux. Choisissez ce que vous pr&eacute;sentez avec attention pour appuyer votre histoire, mais ne censurez jamais de donn&eacute;es pour prouver un point de vue. L&rsquo;histoire que vous racontez par l&rsquo;interm&eacute;diaire de vos graphiques doit &ecirc;tre bas&eacute;e sur ce que les donn&eacute;es ont &agrave; dire, pas seulement sur ce que vous voulez dire.</p>

<p>Prenez, par exemple, le tableau suivant pr&eacute;sentant les scores de Q.I d&rsquo;enfants adopt&eacute;s en bas &acirc;ge et le statut socio&eacute;conomique (bas&eacute; sur le revenu et la profession) de leurs parents adoptifs et biologiques. Ces donn&eacute;es sont tir&eacute;es de l&rsquo;article &ldquo;Children&rsquo;s IQs and SES of Biological and Adoptive Parents in a Balanced Cross-Fostering Study&rdquo; (Capron, C. et Duyme, M., 1989).</p>

<table>
	<tbody>
		<tr>
			<th>Q.I.</th>
			<th>Adoptif Parent SES</th>
			<th>SSE des parents biologiques</th>
		</tr>
		<tr>
			<td>136</td>
			<td>&Eacute;lev&eacute;</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>99</td>
			<td>&Eacute;lev&eacute;</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>121</td>
			<td>&Eacute;lev&eacute;</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>133</td>
			<td>&Eacute;lev&eacute;</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>125</td>
			<td>&Eacute;lev&eacute;</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>131</td>
			<td>&Eacute;lev&eacute;</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>103</td>
			<td>&Eacute;lev&eacute;</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>115</td>
			<td>&Eacute;lev&eacute;</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>116</td>
			<td>&Eacute;lev&eacute;</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>117</td>
			<td>&Eacute;lev&eacute;</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>94</td>
			<td>&Eacute;lev&eacute;</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>103</td>
			<td>&Eacute;lev&eacute;</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>99</td>
			<td>&Eacute;lev&eacute;</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>125</td>
			<td>&Eacute;lev&eacute;</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>111</td>
			<td>&Eacute;lev&eacute;</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>93</td>
			<td>&Eacute;lev&eacute;</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>101</td>
			<td>&Eacute;lev&eacute;</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>94</td>
			<td>&Eacute;lev&eacute;</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>125</td>
			<td>&Eacute;lev&eacute;</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>91</td>
			<td>&Eacute;lev&eacute;</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>98</td>
			<td>Bas</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>99</td>
			<td>Bas</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>91</td>
			<td>Bas</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>124</td>
			<td>Bas</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>100</td>
			<td>Bas</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>116</td>
			<td>Bas</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>113</td>
			<td>Bas</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>119</td>
			<td>Bas</td>
			<td>&Eacute;lev&eacute;</td>
		</tr>
		<tr>
			<td>92</td>
			<td>Bas</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>91</td>
			<td>Bas</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>98</td>
			<td>Bas</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>83</td>
			<td>Bas</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>99</td>
			<td>Bas</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>68</td>
			<td>Bas</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>76</td>
			<td>Bas</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>115</td>
			<td>Bas</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>86</td>
			<td>Bas</td>
			<td>Bas</td>
		</tr>
		<tr>
			<td>116</td>
			<td>Bas</td>
			<td>Bas</td>
		</tr>
	</tbody>
</table>

<p>On peut raconter deux histoires &agrave; partir de ce jeu de donn&eacute;es: &ldquo;L&rsquo;intelligence des enfants est limit&eacute;e par le statut socio-&eacute;conomique des parents adoptifs&rdquo; et &ldquo;L&rsquo;intelligence des enfants adopt&eacute;s est influenc&eacute;e par le statut socio-&eacute;nomique des parents adoptifs et biologiques&rdquo;.</p>

<h3>L&rsquo;intelligence des enfants est limit&eacute;e par le statut socio-&eacute;conomique (SSE) des parents adoptifs</h3>

<p>En ne regardant que le SSE des parents adoptifs, nous pouvons affirmer sans que ce soit faux que l&rsquo;intelligence des enfants est limit&eacute;e par le statut socio-&eacute;conomique des parents adoptifs. En effet, les enfants des familles adoptives au SSE &eacute;lev&eacute; ont un Q.I. moyen de pr&egrave;s de 112 tandis que les enfants adopt&eacute;s par des familles dont le SSE est bas ont un Q.I. moyen de 99. Cependant, cette histoire n&rsquo;utilise que la moiti&eacute; des informations pertinentes et disponibles : toutes les donn&eacute;es concernant le SES des parents biologiques sont laiss&eacute;es de c&ocirc;t&eacute;. Pourtant, il est logique de penser que le SES des parents biologiques joue un r&ocirc;le tout aussi important que celui de la famille adoptive. Pensons, par exemple, &agrave; l&rsquo;impact de la qualit&eacute; et du niveau des soins pr&eacute;nataux qui affectent le d&eacute;veloppement de l&rsquo;enfant in utero.</p>

<figure><img alt="IQ by adoptive parent SES" src="../images/sections/05/DecidingIllustrate-boxplot-ses-iq-fr.png" /></figure>

<h3>L&rsquo;intelligence des enfants adopt&eacute;s est influenc&eacute;e par le statut socio-&eacute;conomique des parents biologiques et adoptifs</h3>

<p>Un titre un petit peu moins accrocheur, mais tellement plus exact. Quand nous incluons &agrave; la fois les donn&eacute;es concernant les parents biologiques et les parents adoptifs, nous obtenons une image plus pr&eacute;cise de l&rsquo;impact que chacun a pu avoir sur le Q.I. de l&rsquo;enfant. En effet, en regardant les donn&eacute;es suivantes :</p>

<figure><img alt="&Eacute;lev&eacute; and low IQ scores" src="../images/sections/05/DecidingIllustrate-matrix-adoptive-biological-fr.png" /></figure>

<p>Il est plus correct d&rsquo;affirmer que le Q.I. d&rsquo;un enfant d&eacute;pend &agrave; la fois du statut socio&eacute;conomique de ses parents biologiques et de celui de ses parents adoptifs. Quand les deux pr&eacute;sentent un SSE &eacute;lev&eacute;, le Q.I. de l&rsquo;enfant a tendance &agrave; &ecirc;tre le plus &eacute;lev&eacute;. Si un des deux a un SSE &eacute;lev&eacute; et l&rsquo;autre un SSE bas (peu importe lequel), l&rsquo;enfant a typiquement un Q.I. dans la moyenne. Enfin, si les deux couples de parents ont un SSe bas, l&rsquo;enfant aura tendance &agrave; avoir un Q.I. en dessous de la moyenne.</p>

<p>Notre premi&egrave;re affirmation est un exemple de ce qui peut arriver quand on cr&eacute;e une histoire bas&eacute;e sur ce qu&rsquo;on veut dire et non pas sur ce que les donn&eacute;es ont &agrave; dire. Malheureusement, ce genre de situation o&ugrave; l&rsquo;on manipule les donn&eacute;es pour leur faire dire ce qui nous plait, n&rsquo;est ni rare ni invraisemblable. Il suffit de regarder les journaux pour trouver des exemples. Cela se produit m&ecirc;me parfois lors de conversations anodines entre amis ou coll&egrave;gues. L&rsquo;omission de faits majeurs et des variables qui y sont reli&eacute;es cr&eacute;e une image remplie de d&eacute;sinformation. Cela manque de cr&eacute;dibilit&eacute; et montre des biais &eacute;vidents. Notre seconde affirmation pr&eacute;sente beaucoup moins de biais tout en constituant une histoire plausible bas&eacute;e sur l&rsquo;ensemble des donn&eacute;es disponibles. Elle pr&eacute;sente le contexte, introduit toutes les variables et explique comment ces variables sont reli&eacute;es entre elles. M&ecirc;me si le r&eacute;sultat ne m&egrave;ne pas &agrave; un titre aussi sensationnaliste, la pr&eacute;sentation de toute l&rsquo;information pertinente est le seul moyen de maintenir sa cr&eacute;dibilit&eacute; et de prouver son point de vue de fa&ccedil;on irr&eacute;futable.</p>

<h2>Combien de donn&eacute;es illustrer ?</h2>

<p>Dans les paragraphes pr&eacute;c&eacute;dents, nous avons vu comment d&eacute;finir son message cl&eacute;, que l&rsquo;identification de son public &eacute;tait primordiale et nous avons d&eacute;fini un processus pour isoler les faits &agrave; illustrer. Nous sommes maintenant pr&ecirc;ts &agrave; d&eacute;terminer combien de donn&eacute;es nous avons besoin d&rsquo;utiliser.</p>

<p>Si mettre les donn&eacute;es en image suppose de rendre l&rsquo;information plus digeste, il faut faire attention &agrave; ne pas pr&eacute;senter plus de donn&eacute;es qu&rsquo;il n&rsquo;en faut. Pas plus qu&rsquo;attendues par le public ou plus que ce dont il a besoin pour comprendre notre message. Pendant que vous d&eacute;cidez de la quantit&eacute; de donn&eacute;es &agrave; illustrer, gardez en t&ecirc;te que quantit&eacute; n&rsquo;est pas toujours synonyme de qualit&eacute; &agrave; moins que ce soit pertinent et pr&eacute;sent&eacute; de fa&ccedil;on &agrave; soutenir le message cl&eacute;. Dans la plupart des cas, vos images feront partie d&rsquo;une trame narrative et/ou se retrouveront dans un &ldquo;entrep&ocirc;t de contenu&rdquo;.</p>

<p>Tel que pr&eacute;sent&eacute;e pr&eacute;c&eacute;demment, une trame narrative est simplement une histoire pr&eacute;sent&eacute;e en une s&eacute;quence de faits qui m&egrave;ne progressivement le public vers le message cl&eacute;. Quand vous pensez &agrave; une trame narrative, pensez &agrave; un rapport &eacute;crit, une pr&eacute;sentation PowerPoint ou &agrave; des articles de journaux ou de magazines. Vous voulez illustrer juste assez de donn&eacute;es pour que le public arrive facilement &agrave; identifier et comprendre votre point de vue sans s&rsquo;&eacute;puiser. Chaque graphique devrait avoir un but sp&eacute;cifique. &Eacute;viter d&rsquo;inclure des repr&eacute;sentations seulement parce qu&rsquo;elles sont impressionnantes. Pour faire un test, essayer d&rsquo;enlever une ou plusieurs graphiques ou de r&eacute;organiser l&rsquo;ordre de votre pr&eacute;sentation. Est-ce que votre trame narrative a encore un sens? Chaque repr&eacute;sentation visuelle devrait pouvoir &ecirc;tre pr&eacute;sent&eacute;e seule sans trop d&rsquo;explications orales ou &eacute;crites. Mais si elle n&rsquo;ajoute rien &agrave; la compr&eacute;hension de votre public, elle n&rsquo;est probablement pas n&eacute;cessaire!</p>

<p>Pour les membres du public qui en voudraient davantage, vous pouvez toujours ajouter des liens et des r&eacute;f&eacute;rences vers des repr&eacute;sentations additionnelles de vos donn&eacute;es comportant des commentaires plus d&eacute;taill&eacute;s pour approfondir le contexte et expliquer davantage l&rsquo;information trait&eacute;e. Si vous voulez impressionner les membres techniques de votre public, un appendix graphique peut m&ecirc;me &ecirc;tre partag&eacute; dans un r&eacute;pertoire <a href="https://github.com/" target="_blank">GitHub</a> et du code organis&eacute; dans une galerie gists comme sur <a href="http://bl.ocks.org/" target="_blank">bl.ocks.org</a>.</p>

<p>Un entrep&ocirc;t de contenu, d&rsquo;un autre c&ocirc;t&eacute;, peut &ecirc;tre vu comme un entrep&ocirc;t d&rsquo;information. Normalement constitu&eacute; de plusieurs trames narratives et de contenu ind&eacute;pendant, c&rsquo;est un cas o&ugrave; en faire plus peut &ecirc;tre synonyme de mieux. Contrairement au public des trames narratives, les visiteurs des entrep&ocirc;ts sont moins susceptibles de s&rsquo;&eacute;puiser &agrave; explorer des donn&eacute;es. Ils sont &agrave; l&rsquo;aise face &agrave; une grande quantit&eacute; de donn&eacute;es car ils s&rsquo;attendent &agrave; passer beaucoup de temps &agrave; d&eacute;velopper ou am&eacute;liorer leur compr&eacute;hension d&rsquo;un sujet. L&rsquo;entrep&ocirc;t n&rsquo;a pas besoin de se focaliser sur un seul message. Son audience recherche de nouvelles fa&ccedil;ons de traiter les donn&eacute;es, une diversit&eacute; de points de vue et diff&eacute;rentes descriptiosn d&rsquo;un m&ecirc;me sujet. Dans le sc&eacute;nario de l&rsquo;entrep&ocirc;t, le crit&egrave;re principal pour d&eacute;cider combien de donn&eacute;es illustrer devrait &ecirc;tre la cr&eacute;ation de redondance. Si votre repr&eacute;sentation n&rsquo;arrive pas &agrave; ajouter quelque chose de nouveau au contenu d&eacute;j&agrave; pr&eacute;sent ou ne permet pas d&rsquo;approfondir ou d&rsquo;&eacute;tendre le sujet, elle peut probablement &ecirc;tre laiss&eacute;e de c&ocirc;t&eacute;.</p>

<p>Pour imager le tout, imaginer un cin&eacute;phile et un g&eacute;rant de magasin. Ces deux personnes parcourent un blog pr&eacute;sentant les dates des films &agrave; venir, des critiques des r&eacute;alisateurs et des commentaires. Le cin&eacute;phile passe des heures sur le site, &eacute;tudie chaque illustration et le contenu qui s&rsquo;y rattache. Le g&eacute;rant veut simplement savoir quels films populaires commander pour la prochaine saison des f&ecirc;tes de fin d&rsquo;ann&eacute;e. Pour notre cin&eacute;phile, plus &eacute;quivaut &agrave; mieux, pour le manager, c&rsquo;est le contraire.: c&rsquo;est moins qui est mieux.</p>

<h2>&Eacute;dition et r&eacute;vision</h2>

<p>Vous avez fait votre remue-m&eacute;ninges, fait un tas de repr&eacute;sentations graphiques et choisi le meilleur sous-ensemble &agrave; inclure dans votre projet. Vous avez fait attention pour ne pas submerger votre auditoire et vous vous &ecirc;tes assur&eacute; que vos illustrations couvraient les points les plus importants sans &ecirc;tre redondants.</p>

<p>C&rsquo;est alors que des questions vous sont pos&eacute;es lors d&rsquo;une pr&eacute;sentation ou que vous lisez des commentaires &agrave; la suite d&rsquo;un article qui touchent pr&eacute;cis&eacute;ment les repr&eacute;sentations que vous avez laiss&eacute;es de c&ocirc;t&eacute;! Un peu frustrant et exasp&eacute;rant!! Dans tous les cas, si vous commencez &agrave; douter de vous, r&eacute;sistez &agrave; l&rsquo;envie d&rsquo;argumenter avec la personne ayant pos&eacute; la question, serrer les dents et continuer.</p>

<p>Cela arrive fr&eacute;quemment et c&rsquo;est tout &agrave; fait normal. Si vous faites un bon travail et que vous captivez votre public, il sera naturellement curieux et voudra en savoir plus. Votre public voudra peut-&ecirc;tre voir les m&ecirc;mes donn&eacute;es pr&eacute;sent&eacute;es diff&eacute;remment, aller plus loin ou avoir une vue plus globale. Si ces questions suivent les d&eacute;cisions que vous avez prises dans votre processus de s&eacute;lection, c&rsquo;est une bonne nouvelle! Cela signifie que vous &ecirc;tes sur la m&ecirc;me longueur d&rsquo;ondes que les gens que vous cibliez et qu&rsquo;ils sont int&eacute;ress&eacute;s par l&rsquo;histoire que vos donn&eacute;es racontent.</p>

<p>Il y a plusieurs moyens de garder (mais sans les mettre &agrave; l&rsquo;avant-plan) les repr&eacute;sentations qui n&rsquo;ont pas &eacute;t&eacute; choisies dans votre pr&eacute;sentation principale. Dans une pr&eacute;sentation orale, il est courant d&rsquo;avoir une collection de diapos en plus que l&rsquo;on garde apr&egrave;s le &ldquo;Merci&rdquo; usuel ou apr&egrave;s la diapo de conclusion. Ces diapos additionnelles contiennent g&eacute;n&eacute;ralement de l&rsquo;information qui pourrait &ecirc;tre int&eacute;ressante mais qui ne pouvait &ecirc;tre pr&eacute;sent&eacute;e &agrave; cause de la restriction de temps. &ldquo;Oui, Monsieur, pour r&eacute;pondre &agrave; votre question, j&rsquo;ai justement effectu&eacute; la comparaison par [industrie, ann&eacute;e, pays, genre]. Je peux vous montrer cela tout de suite&rdquo;. Voil&agrave; ce que vous r&eacute;pondez avec confiance si vous conservez la mati&egrave;re qui a &eacute;t&eacute; mise de c&ocirc;t&eacute;.</p>

<p>Une autre fa&ccedil;on de faire cela serait de publier des versions interactives de vos repr&eacute;sentations graphiques qui permettent aux visiteurs d&rsquo;approfondir et d&rsquo;explorer l&rsquo;information eux-m&ecirc;mes. Si vous &ecirc;tes capable de partager les jeux de donn&eacute;es brutes, c&rsquo;est encore mieux! De cette fa&ccedil;on, ceux qui veulent creuser les donn&eacute;es et les comprendre de diff&eacute;rentes fa&ccedil;ons en utilisant de nouvelles perspectives, auront l&rsquo;option de le faire. Nous discuterons plus en d&eacute;tails des graphiques statiques et interactifs dans le chapitre 16.</p>

<p>Pour terminer, si vous voulez recevoir des commentaires et que vous ne savez pas vers qui vous tournez, vous pouvez jeter un coup d&rsquo;oeil au site <a href="http://helpmeviz.com/" target="_blank">HelpMeViz</a>. HelpMeViz est une communaut&eacute; web o&ugrave; il est possible de publier les graphiques sur lesquels vous travaillez pour recevoir des suggestions amicales expliquant comment les am&eacute;liorer. Recevoir des commentaires sur vos repr&eacute;sentations de la part de votre public cible pour mieux r&eacute;pondre &agrave; leurs besoins fait partie du processus!</p>
</section>
</section>
