<section class="red" data-type="chapter">
<header>
 <div class="icon"><img src="../images/sections/05/GraphingCheckbox-icon-checkbox-fr.png" /></div>
 <p>Chapitre 13</p>
 <h1>Repr&eacute;senter graphiquement les r&eacute;ponses des questions &agrave; choix multiples</h1>
 <p data-type="author">Par Ellen Cooper Adapt&eacute; par Geoffrey Felix </p>
</header>

<section data-type="sect1">
<p>Ce chapitre se concentre sur les r&eacute;ponses  des questions &agrave; choix multiples, c&rsquo;est-&agrave;-dire o&ugrave; une question peut avoir plus d&#39;une r&eacute;ponse, le cas &eacute;ch&eacute;ant.</p>

<h2>Cases &agrave; cocher versus boutons radio</h2>

<p>Supposons que vous r&eacute;alisez un sondage et que vous &ecirc;tes int&eacute;ress&eacute; par les p&eacute;riph&eacute;riques multim&eacute;dias utilis&eacute;s par les participants au questionnaire au cours des six derniers mois. Les cases &agrave; cocher peuvent &ecirc;tre utilis&eacute;es afin de r&eacute;pertorier l&rsquo;ensemble des diff&eacute;rents dispositifs utilis&eacute;s par ces personnes lors des six derniers mois.  Les boutons radio, quant &agrave; eux,  permettent au participant de choisir une seule et unique r&eacute;ponse.  Par exemple, pour trouver quel p&eacute;riph&eacute;rique a &eacute;t&eacute; le plus utilis&eacute; pendant cette p&eacute;riode.  Comment choisir le type de question &agrave; ajouter &agrave; son formulaire ?  En fait, chaque type de question est valable.  Il doit &ecirc;tre utilis&eacute; selon l&rsquo;objectif poursuivi et selon l&rsquo;utilisation que l&rsquo;on veut faire des r&eacute;sultats r&eacute;colt&eacute;s.</p>

<h2>Qu&rsquo;est-ce qu&rsquo;une question &agrave; choix multiples avec cases &agrave; cocher?</h2>

<p>Voici la chose la plus importante &agrave; conna&icirc;tre &agrave; propos des cases &agrave; cocher.  Les questions avec cases &agrave; cocher ne sont pas vraiment des questions type. Ils sont en fait des raccourcis pour &eacute;crire une s&eacute;rie de questions sous la forme oui/non. Un r&eacute;pondand coche une case si la r&eacute;ponse s&rsquo;applique et laisse blanc sinon.</p>

<p>Nous utilisons les cases &agrave; cocher parce que cela rend les enqu&ecirc;tes plus simples et plus faciles &agrave; comprendre.  Dans l&rsquo;exemple ci-dessous, nous avons demand&eacute;, &ldquo;Lequel des appareils suivants avez-vous utilis&eacute;s au cours des 6 derniers mois?  S&eacute;lectionnez toutes les r&eacute;ponses qui s&rsquo;appliquent&rdquo;.  L&rsquo;hypoth&egrave;se est qu&#39;il est probable que la personne interrog&eacute;e ait utilis&eacute; plus d&#39;un dispositif &eacute;lectronique sur une p&eacute;riode de six mois.  Elle pourrait avoir utilis&eacute; un t&eacute;l&eacute;phone cellulaire et une tablette par exemple.</p>

<p>Poser comme une s&eacute;rie de questions oui/non, le questionnaire se pr&eacute;senterait ainsi :</p>

<table>
	<tbody>
		<tr>
			<th colspan="2">Au cours des six derniers mois, avez-vous utilis&eacute; un(e) : :</th>
		</tr>
		<tr>
			<td>Ordinateur de bureau PC?</td>
			<td>O / N</td>
		</tr>
		<tr>
			<td>Ordinateur de bureau Mac?</td>
			<td>O / N</td>
		</tr>
		<tr>
			<td>iPad?</td>
			<td>O / N</td>
		</tr>
		<tr>
			<td>Tablette (autre qu&rsquo;un iPad)?</td>
			<td>O / N</td>
		</tr>
		<tr>
			<td>Ordinateur portable (Mac ou PC)?</td>
			<td>O / N</td>
		</tr>
		<tr>
			<td>T&eacute;l&eacute;phone cellulaire</td>
			<td>O / N</td>
		</tr>
	</tbody>
</table>

<p>Avec les questions &agrave; choix multiples (cases &agrave; cocher), les r&eacute;pondants au sondage doivent seulement indiquer les r&eacute;ponses qui s&rsquo;appliquent &agrave; eux, alors qu&rsquo;avec une s&eacute;ries de questions oui / non, ils devraient r&eacute;pondre &agrave; toutes les questions, m&ecirc;me pour r&eacute;pondre  &ldquo;Non&rdquo; partout.  Avec les questions &agrave; choix multiples, on peut simplement fournir une option &ldquo;Aucun&rdquo; &agrave; la fin de la liste de choix pour g&eacute;rer cette situation. Quand plusieurs questions oui / non sont li&eacute;es, les cases &agrave; cocher permettent aussi d&rsquo;&eacute;viter les r&eacute;p&eacute;titions d&rsquo;instructions puisque toutes les questions sont regroup&eacute;es en une seule.</p>

<p>Ces changements contribuent &agrave; l&rsquo;am&eacute;lioration de la lisibilit&eacute;, du d&eacute;bit et de la taille du questionnaire en plus d&rsquo;am&eacute;liorer le taux de r&eacute;ponse globale. <br>Cependant, si vous voulez g&eacute;rer ad&eacute;quatement les donn&eacute;es r&eacute;colt&eacute;es &agrave; partir d&rsquo;un tel questionnaire, il est tr&egrave;s important de se rappeler que la structure sous-jacente des cases &agrave; cocher est, en fait, une s&eacute;rie de questions dichotomiques.</p>

<h2>Comment les r&eacute;ponses avec cases &agrave; cocher sont re&ccedil;ues?</h2>

<p>Comment vos r&eacute;sultats ou donn&eacute;es brutes sont compil&eacute;s d&eacute;pendra, bien s&ucirc;r, du programme utilis&eacute; pour d&eacute;finir et distribuer le questionnaire. L&rsquo;un des formats le plus utilis&eacute; est celui pr&eacute;sent&eacute; dans le tableau ci-dessous.  Cette structure de donn&eacute;es particuli&egrave;re refl&egrave;te le fait que les cases &agrave; cocher sont une fa&ccedil;on rapide de repr&eacute;senter une s&eacute;rie de questions oui / non.  Si nous revenons &agrave; l&rsquo;exemple des dispositifs &eacute;lectroniques, nous pouvons voir qu&rsquo;un &ldquo;1&rdquo; est affich&eacute; quand l&rsquo;appareil est s&eacute;lectionn&eacute; et un &ldquo;0&rdquo;, quand il ne l&rsquo;est pas.</p>

<table>
	<tbody>
		<tr>
			<th>Date</th>
			<th>Q1_PC</th>
			<th>Q1_Mac</th>
			<th>Q1_Tablette</th>
			<th>Q1_iPad</th>
			<th>Q1_Ordinateur portable</th>
			<th>Q1_Cellulaire</th>
			<th>Q1_Aucun</th>
		</tr>
		<tr>
			<td>10/02/2013</td>
			<td>1</td>
			<td>0</td>
			<td>1</td>
			<td>0</td>
			<td>0</td>
			<td>1</td>
			<td>0</td>
		</tr>
		<tr>
			<td>10/01/2013</td>
			<td>0</td>
			<td>1</td>
			<td>0</td>
			<td>1</td>
			<td>1</td>
			<td>1</td>
			<td>0</td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>1</td>
			<td>0</td>
			<td>0</td>
			<td>1</td>
			<td>0</td>
			<td>1</td>
			<td>0</td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>1</td>
			<td>0</td>
			<td>1</td>
			<td>0</td>
			<td>0</td>
			<td>1</td>
			<td>0</td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>0</td>
			<td>1</td>
			<td>0</td>
			<td>0</td>
			<td>1</td>
			<td>1</td>
			<td>0</td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>0</td>
			<td>1</td>
			<td>1</td>
			<td>0</td>
			<td>0</td>
			<td>1</td>
			<td>0</td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>1</td>
			<td>0</td>
			<td>0</td>
			<td>0</td>
			<td>1</td>
			<td>1</td>
			<td>0</td>
		</tr>
		<tr>
			<td>09/27/2013</td>
			<td>1</td>
			<td>0</td>
			<td>0</td>
			<td>0</td>
			<td>1</td>
			<td>1</td>
			<td>0</td>
		</tr>
		<tr>
			<td>09/26/2013</td>
			<td>1</td>
			<td>0</td>
			<td>0</td>
			<td>0</td>
			<td>1</td>
			<td>1</td>
			<td>0</td>
		</tr>
		<tr>
			<td>09/26/2013</td>
			<td>0</td>
			<td>0</td>
			<td>0</td>
			<td>0</td>
			<td>0</td>
			<td>0</td>
			<td>1</td>
		</tr>
		<tr>
			<td> </td>
			<td>6</td>
			<td>3</td>
			<td>3</td>
			<td>2</td>
			<td>5</td>
			<td>9</td>
			<td>1</td>
		</tr>
	</tbody>
</table>

<p>Vous pouvez &eacute;galement recevoir les r&eacute;sultats sous cette forme:</p>

<table>
	<tbody>
		<tr>
			<th>Date</th>
			<th>R&eacute;ponse</th>
		</tr>
		<tr>
			<td>10/02/2013</td>
			<td>PC, Tablette, Cellulaire</td>
		</tr>
		<tr>
			<td>10/01/2013</td>
			<td>Mac, iPad, Tablette, Cellulaire</td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>PC, iPad, Cellulaire</td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>PC, Tablette, Cellulaire</td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>Mac, Ordinateur portable, Cellulaire</td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>Mac, Tablette, Cellulaire</td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>PC, Ordinateur portable, Cellulaire</td>
		</tr>
		<tr>
			<td>09/27/2013</td>
			<td>PC, Ordinateur portable, Cellulaire</td>
		</tr>
		<tr>
			<td>09/26/2013</td>
			<td>PC, Ordinateur portable, Cellulaire</td>
		</tr>
		<tr>
			<td>09/26/2013</td>
			<td>None</td>
		</tr>
	</tbody>
</table>

<p>Ou de cette fa&ccedil;on:</p>

<table>
	<tbody>
		<tr>
			<th>Date</th>
			<th>Q1_PC</th>
			<th>Q1_Mac</th>
			<th>Q1_Tablette</th>
			<th>Q1_iPad</th>
			<th>Q1_Ordinateur portable</th>
			<th>Q1_Cellulaire</th>
			<th>Q1_Aucun</th>
		</tr>
		<tr>
			<td>10/02/2013</td>
			<td>Q1_PC</td>
			<td> </td>
			<td>Q1_Tablette</td>
			<td> </td>
			<td> </td>
			<td>Q1_Cellulaire</td>
			<td> </td>
		</tr>
		<tr>
			<td>10/01/2013</td>
			<td> </td>
			<td>Q1_Mac</td>
			<td> </td>
			<td>Q1_iPad</td>
			<td>Q1_Ordinateur portable</td>
			<td>Q1_Cellulaire</td>
			<td> </td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>Q1_PC</td>
			<td> </td>
			<td> </td>
			<td>Q1_iPad</td>
			<td> </td>
			<td>Q1_Cellulaire</td>
			<td> </td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>Q1_PC</td>
			<td> </td>
			<td>Q1_Tablette</td>
			<td> </td>
			<td> </td>
			<td>Q1_Cellulaire</td>
			<td> </td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td> </td>
			<td>Q1_Mac</td>
			<td> </td>
			<td> </td>
			<td>Q1_Ordinateur portable</td>
			<td>Q1_Cellulaire</td>
			<td> </td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td> </td>
			<td>Q1_Mac</td>
			<td>Q1_Tablette</td>
			<td> </td>
			<td> </td>
			<td>Q1_Cellulaire</td>
			<td> </td>
		</tr>
		<tr>
			<td>09/30/2013</td>
			<td>Q1_PC</td>
			<td> </td>
			<td> </td>
			<td> </td>
			<td>Q1_Ordinateur portable</td>
			<td>Q1_Cellulaire</td>
			<td> </td>
		</tr>
		<tr>
			<td>09/27/2013</td>
			<td>Q1_PC</td>
			<td> </td>
			<td> </td>
			<td> </td>
			<td>Q1_Ordinateur portable</td>
			<td>Q1_Cellulaire</td>
			<td> </td>
		</tr>
		<tr>
			<td>09/26/2013</td>
			<td>Q1_PC</td>
			<td> </td>
			<td> </td>
			<td> </td>
			<td>Q1_Ordinateur portable</td>
			<td>Q1_Cellulaire</td>
			<td> </td>
		</tr>
		<tr>
			<td>09/26/2013</td>
			<td> </td>
			<td> </td>
			<td> </td>
			<td> </td>
			<td> </td>
			<td> </td>
			<td>Q1_Aucun</td>
		</tr>
	</tbody>
</table>

<p>Les trois exemples ci-dessus repr&eacute;sentent les m&ecirc;mes r&eacute;ponses, mais ils sont format&eacute;s d&rsquo;une fa&ccedil;on diff&eacute;rente. Vu que les outils de collecte de donn&eacute;es formatent les r&eacute;ponses avec cases &agrave; cocher de diff&eacute;rentes fa&ccedil;ons, vous aurez probablement besoin de reformater les donn&eacute;es selon les exigences du logiciel de visualisation que vous utilisez. </p>

<p>R&eacute;sumons les possibles r&eacute;ponses obtenues &agrave; la question pos&eacute;e ci-dessus.</p>

<table class="tableizer-table">
	<tbody>
		<tr class="tableizer-firstrow">
			<th>Table 1 Appareils &eacute;lectroniques utilis&eacute;s</th>
			<th>Total</th>
		</tr>
		<tr>
			<td>PC</td>
			<td>421 (84%)</td>
		</tr>
		<tr>
			<td>Mac (ordinateur de bureau)</td>
			<td>300 (60%)</td>
		</tr>
		<tr>
			<td>Tablette</td>
			<td>285 (57%)</td>
		</tr>
		<tr>
			<td>iPad</td>
			<td>185 (37%)</td>
		</tr>
		<tr>
			<td>Ordinateur portable</td>
			<td>200 (40%)</td>
		</tr>
		<tr>
			<td>T&eacute;l&eacute;phone cellulaire </td>
			<td>450 (90%)</td>
		</tr>
	</tbody>
</table>

<p>Vous constaterez que le nombre total de r&eacute;ponses (1841) est sup&eacute;rieur au nombre de personnes qui ont r&eacute;pondu au questionnaire (N=500) ! Pourquoi?  Parce qu&rsquo;une case &agrave; cocher est en fait une s&eacute;rie de plusieurs questions oui / non rassembl&eacute;es en une seule.  Quel est le nombre total possible de cases coch&eacute;es dans une question &agrave; choix multiples?  C&rsquo;est le nombre d&rsquo;options de r&eacute;ponses &ldquo;r&eacute;elles&rdquo; possibles multipli&eacute;s par le nombre de   de r&eacute;pondants.  Ici, une option de r&eacute;ponse &ldquo;r&eacute;elle&rdquo; signifie: une r&eacute;ponse qui n&rsquo;est pas &ldquo;Aucun&rdquo;, &ldquo;N/A&rdquo; ou &ldquo;Pr&eacute;f&egrave;re ne pas r&eacute;pondre&rdquo;,  puisque selectionner une de ces options pourraient emp&ecirc;cher une personne de choisir d&lsquo;autres options en plus de celle-ci.  Pour notre questionnaire, Il y avait 6 appareils possibles (en plus du &ldquo;Aucun&rdquo;) pouvant &ecirc;tre s&eacute;lectionn&eacute;s et 500 r&eacute;pondants. Donc le nombre total de cases pouvant &ecirc;tre coch&eacute;es lors du sondage &eacute;tait de 3000 (6 x 500) et pas seulement 500.</p>

<h2>Afficher vos r&eacute;sultats</h2>

<p>&Eacute;tant donn&eacute; que le nombre total de r&eacute;ponses est sup&eacute;rieur au nombre de r&eacute;pondants, il faut faire preuve d&rsquo;une certaine prudence lors de la cr&eacute;ation de graphiques bas&eacute;s sur ces donn&eacute;es. Il y a plusieurs fa&ccedil;ons diff&eacute;rentes pour illustrer vos r&eacute;sultats, tout d&eacute;pend de l&rsquo;objectif de la question.</p> 

<h3>Diagramme &agrave; barres</h3>

<p>Une premi&egrave;re fa&ccedil;on est de construire un diagramme &agrave; barres et de baser les pourcentages sur le nombre de r&eacute;pondants qui ont choisi chaque choix de r&eacute;ponse.  Le graphique ci-dessous nous montre  clairement que les t&eacute;l&eacute;phones portables (90%) et les PCs (84%) sont les appareils &eacute;lectroniques ayant &eacute;t&eacute; les plus utilis&eacute;s au cours des six derniers mois.</p>

<figure><img alt="Electronic devices used" src="../images/sections/05/GraphingCheckbox-devices-respondents-bar-fr.png" /></figure>

<p>Cependant, le fait que le total fasse plus de 100% peut &ecirc;tre d&eacute;stabilisant pour certains. Une autre fa&ccedil;on d&rsquo;illustrer les r&eacute;sultats est de baser les pourcentages sur le total de r&eacute;ponses (1841).  L&#39;analyse des r&eacute;sultats sur la base du nombre total de r&eacute;ponses est utile lorsque vous voulez que la somme des pourcentages soit &eacute;gale &agrave; 100 % </p>

<figure><img alt="Electronic devices used" src="../images/sections/05/GraphingCheckbox-devices-mentions-bar-fr.png" /></figure>

<p>Gardez &agrave; l&#39;esprit que cette mani&egrave;re d&#39;afficher les donn&eacute;es est bas&eacute;e sur le nombre de r&eacute;ponses mentionnant un appareil, pas sur le nombre de consommateurs qui utilisent ce dispositif. On peut &ecirc;tre tent&eacute; de dire :  &quot;24 % des consommateurs ont utilis&eacute; un t&eacute;l&eacute;phone portable au cours des six derniers mois&quot; m&ecirc;me si le diagramme &agrave; barres ci-dessus n&#39;affiche pas cette information. </p>

<p>Plut&ocirc;t que le nombre de r&eacute;pondants (500), le graphique montre le nombre de r&eacute;ponses (1841) &agrave; notre enqu&ecirc;te sur les appareils &eacute;lectroniques. Il serait donc pr&eacute;f&eacute;rable de dire: &ldquo; Sur la base de tous les dispositifs mentionn&eacute;s, les t&eacute;l&eacute;phones portables ont &eacute;t&eacute; cit&eacute;s environ un quart (24%) du temps, suivi de pr&egrave;s par les PC (23%) &quot;.   Ce pourcentage repr&eacute;sente le nombre de mentions du t&eacute;l&eacute;phone (450) sur le total des mentions (1841) et refl&egrave;te ainsi fid&egrave;lement l&#39;affichage des informations.</p>

<p>En fonction de votre question, vous pouvez aussi regrouper vos donn&eacute;es. Peut-&ecirc;tre &ecirc;tes-vous plus int&eacute;ress&eacute; par le nombre d&rsquo;appareils utilis&eacute;s plut&ocirc;t que par les diff&eacute;rents types d&rsquo;appareils utilis&eacute;s.  Vous pourriez faire un histogramme comme celui ci-dessous. </p>

<figure><img alt="Percent by grouping" src="../images/sections/05/GraphingCheckbox-devices-reported-bar-fr.png" /></figure>

<div data-type="warning"><h3>ATTENTION AU DIAGRAMME CIRCULAIRE ET CASES &Agrave; COCHER</h3>

<p>N&#39;utilisez pas les diagrammes circulaires si vous fondez vos pourcentages sur le nombre de r&eacute;pondants qui ont choisi plusieurs choix de r&eacute;ponse! Les diagrammes circulaires sont utilis&eacute;s pour repr&eacute;senter un ensemble de relations dont le pourcentage total doit &ecirc;tre &eacute;gal &agrave; 100 %. Puisque la somme possible des pourcentages est sup&eacute;rieure &agrave; 100 % lorsque vous basez ces calculs sur le nombre de r&eacute;pondants, les diagrammes circulaires sont un mauvais choix pour afficher ce type de r&eacute;sultats.</p>
</div>

<h3>AU FIL DU TEMPS</h3>

<p>Si vos r&eacute;ponses ont &eacute;t&eacute; recueillies sur une p&eacute;riode de temps, disons 2009-2013, vous pouvez afficher les r&eacute;ponses avec un graphique en courbe comme pr&eacute;sent&eacute; ci-dessous.</p>

<figure><img alt="Line chart for checkboxes" src="../images/sections/05/GraphingCheckbox-devices-over-time-line-fr.png" /></figure>

<h2>Mesurer le sentiment</h2>

<p>Jusqu&#39;&agrave; pr&eacute;sent, nous avons examin&eacute; l&#39;utilisation des cases &agrave; cocher pour recueillir des donn&eacute;es num&eacute;riques (par exemple, les appareils &eacute;lectroniques utilis&eacute;s).</p><p>Les cases &agrave; cocher peuvent aussi &ecirc;tre utilis&eacute;es pour mesurer des sentiments. Le graphique ci-dessous pr&eacute;sente le sentiment d&rsquo;un propri&eacute;taire sur le fait de poss&eacute;der sa propre maison. </p><p>Dans ce cas, puisque le r&eacute;sultat correspond au pourcentage de propri&eacute;taires qui sont d&rsquo;accord avec les propositions, il est pr&eacute;f&eacute;rable de garder le graphique tel quel, avec un total sup&eacute;rieur &agrave; 100%</p>

<figure><img alt="Home ownership bar graph" src="../images/sections/05/GraphingCheckbox-homeowner-attitude-bar-fr.png" /></figure>
</section>
</section>
