<section class="green" data-type="chapter">
<header>
 <div class="icon"><img src="../images/sections/05/PrintWeb-icon-paper-smartphone-fr.png" /></div>
 <p>Chapitre 16</p>
 <h1>Imprim&eacute; vs web, statique vs interactif</h1>
 <p data-type="author">Par Sarah Rigdon Adapt&eacute; par Genevi&egrave;ve Boucher</p>
</header>

<section data-type="sect1">
<p>Les graphiques que vous cr&eacute;erez seront probablement destin&eacute;s &agrave; un environnement statique ou &agrave; un environnement interactif.  Dans les deux cas, il y a des consid&eacute;rations &agrave; prendre en compte d&egrave;s le d&eacute;part.  Que veut-on dire au juste par statique et interactif?</p>

<h2>Imprim&eacute;  vs web; statique vs interactif</h2>

<p>Vous pouvez cr&eacute;er des <a class="glossterm" href="glossary01.html#graphic-static" target="_blank">graphiques statiques</a> destin&eacute;s &agrave; l&rsquo;impression, au web ou aux deux.  Avec un graphique statique, vous devrez fournir tout ce que vous voulez que le public voit sans intervention de sa part.  Le plus grand effort demand&eacute; &agrave; un lecteur regardant un graphique statique est de tourner une page, descendre dans la page ou peut-&ecirc;tre de l&rsquo;agrandir.   De fa&ccedil;on g&eacute;n&eacute;rale, les graphiques statiques pr&eacute;sentent de l&rsquo;information qui ne change pas.</p>

<p>Vous pouvez aussi cr&eacute;er des <a class="glossterm" href="glossary01.html#graphic-interactive" target="_blank">graphiques interactifs</a> pour l&rsquo;impression, pour le web ou pour les deux.  Les graphiques interactifs offrent typiquement aux lecteurs l&rsquo;opportunit&eacute; de creuser l&rsquo;information, requ&eacute;rant normalement un nombre d&rsquo;actions plus ou moins grand de leur part.  Vous &ecirc;tes s&ucirc;rement en train de vous demander :  &ldquo;Une impression interactive, &ccedil;a existe?&rdquo;.  Et oui, &ccedil;a existe, m&ecirc;me si ce n&rsquo;est pas aussi commun que sur le web.  Pensons &agrave; :</p>

<ul>
	<li>Des projets interactifs</li>
	<li>Des installations artistiques</li>
	<li>Des folioscopes</li>
	<li>Des livres anim&eacute;s</li>
</ul>

<p>Donc, statique n&rsquo;est pas n&eacute;cessairement synonyme d&rsquo;imprim&eacute; et interactif n&rsquo;est pas n&eacute;cessairement synonyme de web.</p>

<p>Derni&egrave;re chose : l&rsquo;antonyme de statique n&rsquo;est pas interactif.  C&rsquo;est changeant ou dynamique.  <a class="glossterm" href="glossary01.html#graphic-motion" target="_blank">Les graphiques anim&eacute;s</a> ne requi&egrave;rent pas l&rsquo;interaction du lecteur, mais ils ne sont pas statiques non plus.  N&rsquo;importe quel journal t&eacute;l&eacute;vis&eacute; vous donnera des exemples de ce genre de graphique.  Animer un graphique peut garder l&rsquo;attention des auditeurs, du moins au d&eacute;part.  Mais au fil du temps (ou du fil de nouvelles),  la fatigue s&rsquo;installe.  Les graphiques anim&eacute;s sont souvent impressionnants, mais demandez-vous toujours si l&rsquo;animation est n&eacute;cessaire pour communiquer l&rsquo;information d&eacute;sir&eacute;e et soyez prudent pour ne pas en abuser.</p>

<p>Il est temps d&rsquo;aborder les concepts de base &agrave; consider lors de la cr&eacute;ation de graphiques statiques et interactifs destin&eacute;s &agrave; l&rsquo;impression et au web.</p>

<h2>Couleur</h2>

<p>Concernant la couleur, il y a beaucoup de questions &agrave; consid&eacute;rer avant de choisir une palette, particuli&egrave;rement si vous travaillez dans l&rsquo;impression.  Avez-vous acc&egrave;s &agrave; toutes les couleurs ou devez-vous travailler en noir et blanc?  Si vous travaillez en couleur, identifiez le gain apport&eacute; par la couleur qui justifie la diff&eacute;rence de co&ucirc;t par rapport au noir et blanc.  Apr&egrave;s tout, une &eacute;chelle de gris ou l&rsquo;utilisation de deux tons peut aussi communiquer une grande quantit&eacute; d&rsquo;information.  Est-ce qu&rsquo;une impression couleur est vraiment n&eacute;cessaire?</p>

<p>Combien de couleurs sont disponibles pour le travail imprim&eacute;?  Quel papier sera utilis&eacute;?  Les couleurs varient et n&rsquo;ont pas le m&ecirc;me effet en fonction du type de papier (journal, magazine, imprimante).  Ou peut-&ecirc;tre envisagez-vous une impression sur de la marchandise promotionnelle?  Une bonne compagnie de marchandises promotionnelles vous aidera &agrave; obtenir des t-shirts, sacs, boutons et collants r&eacute;ussis, mais vous voudrez n&eacute;anmoins anticiper les probl&egrave;mes.</p>

<p>Sur le web, une grande partie de ces restrictions disparait.  Mais pas toutes.  Plusieurs designers de graphiques doivent s&rsquo;adapter &agrave; la palette de couleurs du site web o&ugrave; sera publi&eacute; leur graphique.  Ils doivent poser des questions telles que : est-ce que le vert utilis&eacute; par le site web d&eacute;tone &agrave; c&ocirc;t&eacute; du rose bonbon du graphique?  Est-ce que les couleurs choisies compl&egrave;tent subtilement le logo du site?  Les r&eacute;ponses &agrave; ces questions peuvent avoir un impact sur la fa&ccedil;on dont le public re&ccedil;oit le design final.</p>

<h2>Taille</h2>

<p>Prenez du recul et regardez l&rsquo;espace dont vous disposez pour travailler.  Vous devez consid&eacute;rer la taille autant pour le web que pour l&rsquo;impression papier.</p>

<p>Avec l&rsquo;impression papier, la taille de la page contraint vos graphiques, mais cela peut aussi &ecirc;tre un avantage car vous n&rsquo;avez qu&rsquo;un seul design &agrave; faire d&rsquo;une largeur et hauteur d&eacute;finies.</p>

<p>Sur le web,  vous pouvez souvent ajouter une fonctionalit&eacute; d&rsquo;agrandissement ou permettre l&rsquo;ouverture d&rsquo;une version plus grande d&rsquo;un graphique dans une fen&ecirc;tre s&eacute;par&eacute;e du navigateur.  Vous devez donc consid&eacute;rer les impacts qu&rsquo;un agrandissement et/ou un d&eacute;placement auront sur l&rsquo;exp&eacute;rience de l&rsquo;utilisateur.  Un graphique bien pens&eacute; devrait fournir l&rsquo;information cl&eacute; de mani&egrave;re claire et &eacute;l&eacute;gante avec un minimum d&rsquo;effort requis du c&ocirc;t&eacute; de l&rsquo;utilisateur.</p>

<p>Les appareils mobiles doivent aussi &ecirc;tre pris en compte puisque de plus en plus de gens les utilisent pour parcourir le web.  Garder en t&ecirc;te que pr&egrave;s du deux tiers des propri&eacute;taires de t&eacute;l&eacute;phones cellulaires utilisent maintenant leur t&eacute;l&eacute;phone pour naviguer sur internet et que pour vingt pourcent d&rsquo;entre eux, c&rsquo;est leur principal outil pour y acc&eacute;der.  Il est difficile de bien voir les d&eacute;tails sur un petit &eacute;cran, mais vous ne voulez pas que vos utilisateurs aient &agrave; plisser les yeux pour comprendre votre graphique!   Pour &eacute;viter cela, il est possible de construire des graphiques r&eacute;actifs -- qui changent automatiquement leur aspect en fonction des dimensions de l&rsquo;&eacute;cran de l&rsquo;utilisateur -- ou de cr&eacute;er un graphique diff&eacute;rent sp&eacute;cialement pour les appareils mobiles.  Compte tenu de ce ph&eacute;nom&egrave;ne, c&rsquo;est quelque chose que vous devez consid&eacute;rer quand vous publiez sur le web.</p>

<figure><img alt="Pie chart on different width screens" src="../images/sections/05/PrintWeb-responsive-pie-on-mobile-fr.png" /></figure>

<figure><img alt="Bar chart on mobile device" src="../images/sections/05/PrintWeb-responsive-bar-on-mobile-fr.png" /></figure>

<p>Plusieurs appareils mobiles (et de plus en plus de moniteurs d&rsquo;ordinateurs de bureau et d&rsquo;ordinateurs portables) offrent un &eacute;cran &agrave; grande r&eacute;solution souvent appel&eacute; &eacute;cran Retina.  Une image statique cr&eacute;&eacute;e avec une r&eacute;solution web standard de 72 ppp (points par pouce ou dots per inches -dpi- ) sera un peu floue sur un &eacute;cran r&eacute;tina.  Vous aurez besoin de cr&eacute;er des versions de meilleure r&eacute;solution si vous voulez que vos images soient nettes sur, par exemple, un iPad nouveau mod&egrave;le.  Vous pouvez aussi cr&eacute;er vos images en utilisant des polices web et des &eacute;l&eacute;ments graphiques vectoriels (SVG).  Ainsi, vos images seront toujours impeccables peu importe la r&eacute;solution de l&rsquo;&eacute;cran.  Toutefois, il faut savoir que certains navigateurs web plus anciens (notamment Internet Explorer 8 et moins) ne supportent pas le format SVG.</p>

<div data-type="sidebar">
<h3>Qu&rsquo;est-ce qu&rsquo;un SVG?</h3>

<p>SVG vient de Scalable Vecteur Graphic.  En fran&ccedil;ais, on parle de graphiques vectoriels adaptables.   Ce format permet l&rsquo;affichage d&rsquo;images pouvant &ecirc;tre redimensionn&eacute;es sans pixellisation.  En effet, ce sont des des expressions math&eacute;matiques qui permettent de dessiner les diff&eacute;rents traits qui composent l&rsquo;image.  Les images vectorielles, contrairement aux images bitmap (aussi connus sous le nom de graphiques &agrave; trames ou raster graphics) qui utilisent des bits de couleurs sp&eacute;cifiques associ&eacute;s &agrave; diff&eacute;rentes r&eacute;gions d&rsquo;une image, seront impeccables m&ecirc;me lorsqu&rsquo;une tr&egrave;s grande taille d&rsquo;image est demand&eacute;e.  Les images bitmap seront floues lorsque regard&eacute;es &agrave; une grande r&eacute;solution, mais elles sont n&eacute;anmoins parfois n&eacute;cessaires pour afficher des combinaisons de couleurs complexes.  Une photographie est un bon exemple d&rsquo;image bitmap et un simple cercle est un bon exemple d&rsquo;une image qui peut facilement &ecirc;tre dessin&eacute;e en format vectoriel.</p>

<figure><img alt="Bitmap vs. vector images" src="../images/sections/05/PrintWeb-vector-vs-bitmap-fr.png" /></figure>

<p>Plusieurs outils pour cr&eacute;er des graphiques interactifs pour le web (comme <a href="http://d3js.org/" target="_blank">D3.js</a>) utilisent le format SVG pour la visualisation.  Cependant, la plupart des graphiques statiques sont publi&eacute;s en utilisant un format bitmap sous forme de JPEG ou de PNG.</p>
</div>

<p>Lorsqu&rsquo;on parle de taille, on ne parle pas seulement de la taille de l&rsquo;image &agrave; l&rsquo;&eacute;cran.  On doit aussi faire attention &agrave; la taille de notre fichier.  De nos jours, de plus en plus de gens dans le monde utilisent des appareils mobiles pour naviguer sur le web.  Non seulement, cela peut prendre du temps pour t&eacute;l&eacute;charger une grosse image sur un r&eacute;seau mobile, mais dans certaines parties du globe, chaque megabyte de donn&eacute;es g&eacute;n&egrave;re un co&ucirc;t additionnel pour l&rsquo;utilisateur.  Soyez gentil pour vos lecteurs et tentez le plus possible de r&eacute;duire la taille de vos images.</p>

<h2>Disposition</h2>

<p>Avec les images statiques, le d&eacute;fi est de fournir toute l&rsquo;information requise en un ou deux cadres.  Il n&rsquo;y a pas de survol ou de clic de souris pour permettre la s&eacute;lection de certains d&eacute;tails ou la d&eacute;selection de certains autres (par exemple, afficher seulement les donn&eacute;es collect&eacute;es entre 1988 et 1996).  Faites en sorte que vos donn&eacute;es les plus importantes soient bien visibles.  Si vous cr&eacute;ez une version statique d&rsquo;un graphique interactif,  gardez en t&ecirc;te que vous ne serez peut-&ecirc;tre pas capable de montrer tout ce qui &eacute;tait accessible dans la version originale interactive.  Si c&rsquo;est possible, vous pouvez toujours fournir l&#39;URL de la version originale afin que vos lecteurs aient acc&egrave;s aux donn&eacute;es brutes et &agrave; l&rsquo;interactivit&eacute;.  De cette fa&ccedil;on,  ils auront l&rsquo;option d&rsquo;approfondir leur exp&eacute;rience et de creuser l&rsquo;information li&eacute;e aux parties du graphe qui n&rsquo;ont pas &eacute;t&eacute; incluses dans la version imprim&eacute;e.</p>

<p>Si vous cr&eacute;ez des graphiques interactifs, assurez-vous de tester tous les &eacute;l&eacute;ments de contr&ocirc;le de l&rsquo;int&eacute;ractivit&eacute;.  Est-ce que les contr&ocirc;les sont bien visibles et fonctionnels?  Est-ce que les boutons et listes de s&eacute;lection sont sur le c&ocirc;t&eacute; ou font partie du graphique?  L&rsquo;utilisateur a-t-il besoin de parcourir la page pour ajuster les options d&eacute;sir&eacute;es?  Testez vos graphiques dans diff&eacute;rents navigateurs et assurez-vous que tout s&rsquo;affiche et fonctionne comme pr&eacute;vu!</p>

<h3>Concernant les graphiques statiques sur le web</h3>

<p>Ces graphiques ne sont pas n&eacute;cessairement interactifs, m&ecirc;me si les lecteurs peuvent les agrandir.  Puisque le graphique lui-m&ecirc;me ne change pas,  les consid&eacute;rations li&eacute;es &agrave; la disposition sont moins critiques mais s&rsquo;appliquent n&eacute;anmoins.  Le fait d&rsquo;&ecirc;tre publi&eacute;s sur le web donne aux graphiques statiques une composante interactive que les graphiques imprim&eacute;s ne poss&egrave;dent pas.  Par exemple, ils peuvent &ecirc;tre li&eacute;s &agrave; leur source de donn&eacute;es, &agrave; d&rsquo;autres graphiques ou &agrave; une autre page web pertinente.  Les &eacute;crans des appareils portables constituent aussi un d&eacute;fi pour les graphiques statiques particuli&egrave;rement parce que leur disposition ne change pas dynamiquement pour accommoder les &eacute;crans plus petits ou les diff&eacute;rents ratios largeur-hauteur.</p>

<figure><img alt="Complex map on mobile device" src="../images/sections/05/PrintWeb-map-detail-loss-on-mobile-fr.png" />
<figcaption>Les &eacute;tiquettes de texte et les d&eacute;tails visuels qui sont clairs sur grand &eacute;cran sont parfois difficiles ou impossibles &agrave; lire sur un appareil mobile.</figcaption>
</figure>

<p>M&ecirc;me si les liens URL affich&eacute;s sur une image statique ne peuvent &ecirc;tre directement cliqu&eacute;s, il arrive fr&eacute;quemment que des &eacute;diteurs consciencieux reproduisent ces liens directement sous l&rsquo;image pour que les lecteurs puissent facilement acc&eacute;der aux donn&eacute;es source.</p>

<figure><img alt="Citing sources" src="../images/sections/05/PrintWeb-source-link-fr.png" /></figure>

<h3>Peser le besoin d&rsquo;interactivit&eacute;</h3>

<p>Cr&eacute;er des graphiques interactifs est de plus en plus facile avec l&rsquo;apparition de nouveaux logiciels et applications.  L&rsquo;interactivit&eacute; peut &ecirc;tre non seulement tr&egrave;s impressionnante, mais aussi utile pour pr&eacute;senter diff&eacute;rents types d&rsquo;information plus efficacement que dans un graphique statique.  Toutefois, vous croiserez certainement des images interactives qui ne font que rendre l&rsquo;information plus confuse!  Ou bien, vous verrez des images qui semblent int&eacute;ressantes au d&eacute;part, mais vous vous rendrez compte en jouant avec qu&rsquo;il n&rsquo;y a aucune valeur ajout&eacute;e, que du bonbon.  Vous n&rsquo;apprenez rien de nouveau et l&rsquo;information aurait tr&egrave;s bien pu &ecirc;tre pr&eacute;sent&eacute;e aussi clairement sur une image statique.  Quelle d&eacute;ception!</p>

<p>Pourquoi perdre du temps &agrave; cr&eacute;er un graphique interactif s&rsquo;il n&rsquo;y a aucun gain &agrave; faire? L&rsquo;interactivit&eacute; est un outil et devrait &ecirc;tre utilis&eacute;e quand cela permet d&rsquo;am&eacute;liorer un graphique statique ou quand cela ajoute de la valeur &agrave; l&rsquo;information et apporte quelque chose que l&rsquo;image statique ne peut fournir.</p>

<p>Par exemple, prenez le graphe &agrave; barres suivant:</p>

<figure><img alt="Pointless hover" src="../images/sections/05/PrintWeb-data-labels-hover-vs-default-fr.png" /></figure>

<p>Dans la figure ci-dessus, les &eacute;tiquettes interactives ne sont pas n&eacute;cessaires pour la compr&eacute;hension des lecteurs.  Les &eacute;tiquettes peuvent &ecirc;tre ajout&eacute;es sur le graphique ce qui rend ce dernier plus facile &agrave; comprendre et demande moins d&rsquo;effort de la part du lecteur.  Quand vous pr&eacute;sentez un petit graphique simple avec une seule variable, l&rsquo;interactivit&eacute; peut faire d&eacute;vier votre message.</p>

<div data-type="note">
<p>Il y a plusieurs exemples fantastiques o&ugrave; l&rsquo;interactivit&eacute; ajoute de la valeur &agrave; la visualisation, mais vous ne devriez pas syst&eacute;matiquement en ajouter &agrave; vos graphiques juste parce que c&rsquo;est tendance.  Assurez-vous que vous am&eacute;liorez r&eacute;ellement l&rsquo;exp&eacute;rience de l&rsquo;usager.  Par exemple, l&rsquo;interactivit&eacute; peut grandement aider &agrave; mettre en valeur un graphique qui pr&eacute;sente un jeu de donn&eacute;es riche que vous voulez que l&rsquo;usager explore.  Disons que vous voulez pr&eacute;senter comment diff&eacute;rents groupes de consommateurs boivent leur caf&eacute;.  Une visualisation interactive pourrait permettre aux utilisateurs de filtrer par groupe d&eacute;mographique et d&rsquo;explorer les diff&eacute;rentes tendances de consommation parmi ces groupes. </p>
</div>

<p>Les graphiques interactifs peuvent ajouter beaucoup de valeur lorsque vous avez un jeu de donn&eacute;es riche. Par exemple, disons que vous d&eacute;sirez savoir comment plusieurs groupes de consommateurs boivent leur caf&eacute;. Un graphique interactif pourrait vous permettre de filtrer par groupe d&eacute;mographique et ainsi explorer les diff&eacute;rents patterns de consommation.</p>

<figure><img alt="Interactive exploration" src="../images/sections/05/PrintWeb-interactive-exploration-line-fr.png" /></figure>

<p>Dans les graphiques statiques, vous ne pouvez pas utiliser d&rsquo;effets visuels comme du mouvement ou un changement de couleur pour transmettre votre message.  D&rsquo;un autre c&ocirc;t&eacute;, m&ecirc;me si les graphiques interactifs peuvent incorporer des effets visuels pour montrer des tendances dans le temps, ils am&egrave;nent parfois leur lot de difficult&eacute;s techniques.  Soyez conscient de la compatibilit&eacute; entre les ordinateurs et les navigateurs.  Certaines des visualisations interactives les plus complexes demandent beaucoup de puissance de calcul et peuvent &ecirc;tre lentes sur des machines moins puissantes comme des t&eacute;l&eacute;phones intelligents.  Les visualisations cr&eacute;&eacute;es avec Flash ne s&rsquo;afficheront pas sur les iPhones ou iPads et celles cr&eacute;&eacute;es en SVG ne fonctionneront pas dans Internet Explorer 8 et moins.  Les visualisations interactives construites pour un ordinateur avec souris pourraient &ecirc;tre difficiles voire impossibles &agrave; utiliser sur un appareil &agrave; &eacute;cran tactile si les cr&eacute;ateurs ont oubli&eacute; de tester et d&rsquo;optimiser les graphiques pour les interactions tactiles.</p>

<p>Tous les mediums pour partager une visualisation -- que ce soit statique ou interactive -- auront leurs forces et leurs faiblesses.  Pensez &agrave; votre histoire, votre public et comment les lecteurs auront acc&egrave;s &agrave; vos visualisations.  Cherchez &agrave; obtenir des r&aacute;ctions de vos usagers et continuez &agrave; it&eacute;rer.  Et si vous voulez recevoir des commentaires amicaux et des suggestions concernant vos visualisations en cours, n&rsquo;h&eacute;sitez pas &agrave; les publier sur <a href="http://helpmeviz.com/">HelpMeViz</a>.</p>
</section>
</section>
