<div data-type="part" class="blue">
 <header>
  <h1><img src="../images/sections/05/visualizing-data.png" />Visualiser des donn&eacute;es</h1>
 </header>

 <section class="content">
 <p>Vous avez enfin toutes vos donn&eacute;es. Elles ont &eacute;t&eacute; collect&eacute;es, pr&eacute;par&eacute;es et nettoy&eacute;es avec soin. Il est maintenant temps de se lancer! On pourrait m&ecirc;me dire qu&rsquo;il est maintenant temps de mettre la main &agrave; la p&acirc;te (pour reprendre l&rsquo;analogie culinaire de la premi&egrave;re section)! Visualiser ses donn&eacute;es, c&rsquo;est comme cuisiner un bon plat. Plusieurs ingr&eacute;dients doivent &ecirc;tre combin&eacute;s pour arriver au r&eacute;sultat final. Certains ressortiront nettement dans votre plat, alors que d&rsquo;autres joueront un r&ocirc;le de support ou auront un go&ucirc;t trop subtil pour &ecirc;tre go&ucirc;t&eacute;. Malgr&eacute; ces diff&eacute;rences, vous devez quand m&ecirc;me vous assurez que tous les ingr&eacute;dients ont &eacute;t&eacute; incorpor&eacute;s correctement pour obtenir un met succulent.</p>
 
 <p>Lorsque que l&rsquo;on cr&eacute;e une repr&eacute;sentation graphqiue de nos donn&eacute;es, il faut aussi r&eacute;fl&eacute;chir en terme d&rsquo;importance, de fonctionalit&eacute; et de pertinence. Pour bien comprendre, prenez encore l&rsquo;exemple du cuisinier. Si vous voulez mettre en valeur les l&eacute;gumes d&rsquo;une soupe aux l&eacute;gumes, vous voudrez les couper en d&eacute;s au lieu de les r&eacute;duire en pur&eacute;e. Et vous devrez trouver des bols pour le service parce que vous ne servirez certainement pas votre d&eacute;licieuse soupe dans des assiettes.</p>
 
 <p>De la m&ecirc;me fa&ccedil;on, d&eacute;cider du type de graphe et de la fa&ccedil;on de pr&eacute;senter vos donn&eacute;es d&eacute;pend des donn&eacute;es elles-m&ecirc;mes et du message qu&rsquo;elles v&eacute;hiculent. Certaines variables vont ressortir sur vos graphiques, d&rsquo;autres dispara&icirc;tront dans les calculs effectu&eacute;s pour obtenir le r&eacute;sultat final. Et ensuite, il y a les autres &eacute;l&eacute;ments &agrave; consid&eacute;rer : les polices de caract&egrave;res, les couleurs, le texte et les ic&ocirc;nes.</p>
 
 <p>Dans cette section, nous parlerons de la fa&ccedil;on de construire des repr&eacute;sentations graphiques qui raconte le mieux possible l&rsquo;histoire inh&eacute;rente aux donn&eacute;es. Nous verrons aussi quelques trucs pour bien choisir le type de graphique &agrave; utiliser et pour appliquer la touche finale appropri&eacute;e afin de cr&eacute;er des repr&eacute;sentations graphiques pertinentes que votre auditoire sera impatiente de consulter.</p>
 </section>
</div>
