<div data-type="part" class="yellow">
 <header>
 <h1><img src="../images/sections/03/collecting-data.png" />La collecte de donn&eacute;es</h1>
 </header>

 <section class="content">
<p>La collecte de donn&eacute;es est similaire &agrave; la collecte des ingr&eacute;dients pour une recette. Si vous voulez cr&eacute;er un excellent plat, vous aurez envie de commencer avec les bons ingr&eacute;dients, ce qui signifie que vous aurez &agrave; prendre de nombreuses d&eacute;cisions  &agrave; l&#39;avance.</p>

<p>Par exemple, si vous avez besoin de miel, voulez-vous un miel g&eacute;n&eacute;rique ou une vari&eacute;t&eacute; sp&eacute;cifique comme un miel &agrave; la fleur d&#39;oranger?  Est-ce que la marque du miel est importante? Doit-il &ecirc;tre biologique? Pr&eacute;f&eacute;rez-vous qu&rsquo;il provienne d&rsquo;un producteur local ou d&rsquo;un supermarch&eacute;? </p><p>Et qui va rassembler tous ces ingr&eacute;dients?  Si vous ne disposez pas de temps, &ecirc;tes-vous pr&ecirc;ts &agrave; payer quelqu&#39;un pour les obtenir pour vous, m&ecirc;me si cela signifie que vous pourriez ne pas obtenir exactement ce que vous voulez?</p> 

<p>Vous devez prendre des d&eacute;cisions similaires avant la collecte de donn&eacute;es. Vous pouvez obtenir toutes vos donn&eacute;es en posant des questions ouvertes &agrave; l&rsquo;occasion d&rsquo;enqu&ecirc;tes &laquo; papier &raquo; que vous posez &agrave; des gens choisis au hasard, mais cela ne donnera peut-&ecirc;tre pas les r&eacute;sultats les plus logiques.  Il est parfois plus efficace de les r&eacute;cup&eacute;rer d&rsquo;une autre fa&ccedil;on : certains types de collectes sont plus appropri&eacute;s pour certains types de donn&eacute;es.   Et parfois vous pourrez ne pas avoir assez de temps ou d&#39;argent pour recueillir les donn&eacute;es dont vous avez besoin par vous-m&ecirc;me.</p> 

<p>Dans cette section, nous allons parler des m&eacute;thodes de collecte de donn&eacute;es pour vous aider &agrave; d&eacute;terminer o&ugrave; et comment obtenir efficacement l&rsquo;information que vous cherchez.  Nous allons aussi pr&eacute;senter comment trier les informations dont vous avez vraiment besoin.  Allons faire quelques courses !</p> 

 </section>
</div>
