<section class="red" data-type="chapter">
<header>
<div class="icon"><img src="../images/sections/03/scale.png" /></div>

<p>Chapitre 5</p>

<h1>M&eacute;thodes suppl&eacute;mentaires de collecte de donn&eacute;es</h1>
 <p data-type="author">Par Dyanna Gregory Adapt&eacute; par Nadia Belnet</p>
</header>

<section data-type="sect1">
<p>Tous les types de donn&eacute;es ne se pr&ecirc;tent pas &agrave; une collecte via des enqu&ecirc;tes. Les enqu&ecirc;tes sont des outils d&eacute;claratifs qui interviennent &agrave; un moment donn&eacute;. Par cons&eacute;quent, les mesures exactes, les impressions et les donn&eacute;es relatives aux &eacute;v&eacute;nements qui se produisent dans la dur&eacute;e peuvent &ecirc;tre difficiles &agrave; saisir via une enqu&ecirc;te. Cependant, ce sont des &eacute;l&eacute;ments importants dont vous pourriez avoir besoin. Voyons donc quelques outils suppl&eacute;mentaires &agrave; utiliser pour collecter ces types de donn&eacute;es.</p>

<table>
	<tbody>
		<tr>
			<th>M&eacute;thode</th>
			<th>&Agrave; utiliser si : </th>
		</tr>
		<tr>
			<td>M&eacute;thode directe</td>
			<td>Les valeurs doivent &ecirc;tre exactes <br /> L&rsquo;information est susceptible d&rsquo;&ecirc;tre biais&eacute;e si elle est d&eacute;clarative</td>
		</tr>
		<tr>
			<td>Groupes de discussion</td>
			<td>Vous ne savez pas exactement ce que vous souhaitez demander;<br /> 
			 Vous &ecirc;tes int&eacute;ress&eacute;(e) par le spectre complet des r&eacute;actions de vos participants sur de multiples sujets;<br /> 
			 Vous &ecirc;tes int&eacute;ress&eacute;(e) par la dynamique de groupe;<br />
				Vous &ecirc;tes int&eacute;ress&eacute;(e) par le processus de d&eacute;cision.
			</td>
		</tr>
		<tr>
			<td>Observation</td>
			<td>Ce que vous mesurez est facilement et publiquement observable;<br />
			 Vous souhaitez prendre des notes sur le comportement des participants.
			</td>
		</tr>
		<tr>
			<td>Examen de documents existants</td>
			<td>Les donn&eacute;es qui vous int&eacute;ressent sont d&eacute;j&agrave; enregistr&eacute;es quelque part  (par exemple, sur des re&ccedil;us, des journaux de trafic web, etc.).
			</td>
		</tr>
		<tr>
			<td>Rapports r&eacute;currents (journaux)</td>
			<td>Need to track variables over time;<br />
			Information likely to be biased if recalled later
			</td>
		</tr>

	</tbody>
</table>

<h2>Mesure directe</h2>

<p>Ce sont des donn&eacute;es qui devraient &ecirc;tre mesur&eacute;es plut&ocirc;t que collect&eacute;es par un sondage si vous essayez d&rsquo;obtenir une statistique exacte et correcte.  De nombreuses variables m&eacute;dicales, par exemple, sont difficiles voire impossibles &agrave; recueillir avec pr&eacute;cision en utilisant un questionnaire. Disons, par exemple, que vous deviez collecter des donn&eacute;es sur le poids des participants au d&eacute;but d&rsquo;une &eacute;tude.  Plusieurs raisons poussent souvent les gens &agrave; d&eacute;clarer un nombre pouvant &ecirc;tre inexact : </p><p></p>

<ul>
	<li>Le manque d&rsquo;information : la personne ne connaissait pas vraiment son poids quand on le lui a demand&eacute;.</li>
	<li>Social expectation: they felt there was a &quot;correct&quot; answer they were supposed to give</li>
	<li>La facilit&eacute; de r&eacute;ponse : elle connaissait approximativement son poids et ne pensait pas qu&rsquo;une r&eacute;ponse pr&eacute;cise &eacute;tait n&eacute;cessaire ; &laquo; je p&egrave;se environ 80 kg, donc je vais dire cela &raquo;.</p><p></li>
	
</ul>

<p>Le fait qu&rsquo;une donn&eacute;e doive &ecirc;tre pr&eacute;cise d&eacute;pend de la mani&egrave;re dont l&rsquo;information sera utilis&eacute;e. Si vous ne vous souciez pas d&rsquo;avoir une mesure pr&eacute;cise et qu&rsquo;une estimation suffit, alors un sondage peut convenir pour obtenir l&rsquo;information d&eacute;sir&eacute;e en autant qu&rsquo;elle soit facilement et raisonnablement estimable par les personnes interrog&eacute;es. S&rsquo;il est important que la variable d&rsquo;int&eacute;r&ecirc;t soit &agrave; jour et exacte, la mesure directe devrait alors &ecirc;tre utilis&eacute;e.</p><p></p>

<p>Avec <a class="glossterm" target="_blank" href="glossary01.html#measurement-direct">la mesure directe</a>, un dispositif appropri&eacute; doit &ecirc;tre utilis&eacute; pour mesurer les variables puis enregistrer les valeurs au sein d&rsquo;un jeu de donn&eacute;es. C&rsquo;est souvent le cas pour les variables li&eacute;es &agrave; la sant&eacute; qu&rsquo;une personne ne serait pas en mesure de &laquo;simplement conna&icirc;tre&raquo;.  Les mesures sont habituellement captur&eacute;es via des formulaires et les donn&eacute;es sont ensuite transf&eacute;r&eacute;es depuis les formulaires vers un ensemble de donn&eacute;es.</p>

<p>Lorsqu&rsquo;on utilise des formulaires, on doit clairement indiquer comment on souhaite enregistrer la mesure. L&rsquo;unit&eacute; de mesure pr&eacute;f&eacute;r&eacute;e doit &ecirc;tre indiqu&eacute;e (par exemple lbs ou kg) tout comme la pr&eacute;cision avec laquelle vous voulez que la mesure soie enregistr&eacute;e (par exemple, nombre entier ou deux d&eacute;cimales).  L&rsquo;un des moyens les plus simples pour communiquer cela est par l&rsquo;attribution d&rsquo;un nombre pr&eacute;cis de cases de mani&egrave;re &agrave; ce que la personne qui prend la mesure sache combien de chiffres vous souhaitez enregistrer.</p>

<p>L&rsquo;image ci-dessous montre un exemple de formulaire pour saisir le poids d&rsquo;un adulte.  Le but ici est de collecter la mesure en kilogrammes avec deux chiffres apr&egrave;s la virgule.</p>

<figure><img alt="Food diary" src="../images/sections/03/CollectionMethods-weight-entry-form-fr.png" /></figure>

<p>Lorsque c&rsquo;est pertinent, il ne faut pas oublier d&rsquo;inclure un endroit o&ugrave; enregistrer quel dispositif a &eacute;t&eacute; utilis&eacute; pour prendre la mesure.</p><p></p>

<h2>Groupes de discussion</h2>

<p>Il est parfois utile d&rsquo;&eacute;tudier les gens pendant qu&rsquo;ils r&eacute;pondent &agrave; vos questions, de voir leur processus de pens&eacute;e et de les observer interagir avec les  autres.  Vous pouvez &eacute;galement avoir une grande vari&eacute;t&eacute; de sujets &agrave; couvrir (plus que ce qui est raisonnable pour une enqu&ecirc;te) ou ne pas savoir exactement quelles questions devraient &ecirc;tre pos&eacute;es. <a class="glossterm" target="_blank" href="glossary01.html#group-focus">Les groupes de discussion</a> peuvent aider dans ces situations.</p>

<p>Un groupe de discussion fonctionne grosso modo comme une r&eacute;union d&rsquo;un club de lecteurs. Un petit groupe de personnes (g&eacute;n&eacute;ralement entre 6 et 12 individus) est r&eacute;uni pour discuter d&rsquo;un sujet pr&eacute;cis, et cette discussion est dirig&eacute;e par un mod&eacute;rateur form&eacute;. Le mod&eacute;rateur pose une s&eacute;rie de questions de mani&egrave;re &agrave; obtenir des opinions plus approfondies que ce qu&rsquo;une enqu&ecirc;te seule pourrait recueillir.  Les groupes de discussion ont souvent plus de flexibilit&eacute; qu&rsquo;une enqu&ecirc;te dans la mesure o&ugrave; les questions ne sont pas compl&egrave;tement pr&eacute;d&eacute;termin&eacute;es. Le mod&eacute;rateur a plus de libert&eacute; pour explorer les r&eacute;ponses fournies par les participants et pour formuler de nouvelles questions bas&eacute;es sur ces r&eacute;ponses.  En outre, puisque les participants sont dans un groupe, les r&eacute;ponses d&rsquo;une personne peuvent amener les autres participants &agrave; avoir des r&eacute;ponses qu&rsquo;ils n&rsquo;auraient pas eues autrement.</p><p></p> 

<p>Cependant, la constitution du groupe et la pr&eacute;sence du mod&eacute;rateur peuvent cr&eacute;er des biais dans les r&eacute;ponses des participants.  Il est important de garder cela &agrave; l&rsquo;esprit lors de l&rsquo;examen et de l&rsquo;analyse de donn&eacute;es provenant d&rsquo;un groupe de discussion.</p>


<h2>Observation</h2>

<p>Parfois, l&rsquo;observation peut &eacute;galement &ecirc;tre une bonne m&eacute;thode de collecte de donn&eacute;es.  Revenons &agrave; notre &laquo; Salon fictif des cr&egrave;mes glac&eacute;es &raquo;.  Imaginons que vous ayez r&eacute;cemment achet&eacute; de nouveaux meubles pour le magasin et que vous envisagez quelques agencements diff&eacute;rents afin de voir lequel fonctionne le mieux pour le flux de client&egrave;le. Vous agencez en premier les meubles d&rsquo;une certaine fa&ccedil;on pendant quelques jours et enregistrez vos observations personnelles concernant la circulation des clients au sein du magasin.  Puis vous d&eacute;placez les meubles pour l&rsquo;autre agencement et enregistrez &agrave; nouveau ce que vous observez.  Ces donn&eacute;es peuvent vous aider &agrave; d&eacute;terminer quelles autres questions vous pourriez vouloir poser ou de quelles autres donn&eacute;es vous avez besoin avant de prendre votre d&eacute;cision.</p>

<p>Vous pouvez utiliser l&rsquo;observation de cette mani&egrave;re afin de mieux comprendre le comportement naturaliste. Cela peut &ecirc;tre particuli&egrave;rement utile si vos sujets d&rsquo;int&eacute;r&ecirc;t ne sont pas humains et ne peuvent r&eacute;pondre aux questions de l&rsquo;enqu&ecirc;te.  Les scientifiques utilisent d&rsquo;ailleurs couramment l&rsquo;observation comme une technique de collecte de donn&eacute;es!</p>

<p>L&rsquo;une des principales lacunes de cette m&eacute;thode est que la pr&eacute;sence d&rsquo;un observateur change une observation. Chaque personne regarde un &eacute;v&eacute;nement avec sa propre perspective et sa perception de l&rsquo;&eacute;v&eacute;nement est influenc&eacute;e par cette perspective.  Cela influence sa fa&ccedil;on de rapporter l&rsquo;observation.  Vous pouvez diminuer ce biais en ayant plusieurs observateurs afin que les donn&eacute;es recueillies repr&eacute;sentent plusieurs points de vue.</p><p></p>

<h2>L&rsquo;examen de documents existants</h2>
<p>Dans certains cas, les donn&eacute;es dont vous avez besoin existent d&eacute;j&agrave; dans d&rsquo;autres documents et votre collecte consiste essentiellement &agrave; rassembler toutes ces informations en un seul endroit.</p>

<p>En tant que gestionnaire du &laquo; Salon fictif des cr&egrave;mes glac&eacute;es &raquo;, vous souhaitez examiner vos ventes des six derniers mois afin de voir si les &eacute;l&eacute;ments que vous avez r&eacute;cemment ajout&eacute;s au menu se sont r&eacute;v&eacute;l&eacute;s rentables. Ces informations sont d&eacute;j&agrave; disponibles dans les re&ccedil;us ou dans les donn&eacute;es de votre logiciel de gestion de point de vente. Vous n&rsquo;avez qu&rsquo;&agrave; vous assurer de pouvoir facilement r&eacute;cup&eacute;rer ces donn&eacute;es dans un format permettant leur analyse.</p><p></p>

<p>D&rsquo;autres documents fr&eacute;quemment utilis&eacute;s pour compiler les informations incluent les livres, les journaux, les traces de trafic web et les pages web. Il existe aussi, sur le march&eacute;,  des ensembles de donn&eacute;es complets disponibles pour utilisation.  Ceux-ci sont trait&eacute;s plus en d&eacute;tails dans le chapitre &laquo; Trouver des donn&eacute;es externes &raquo;.</p>

<p>Lorsque vous utilisez d&rsquo;autres documents comme source principale de donn&eacute;es, il est utile de commencer par d&eacute;finir un plan de collecte de donn&eacute;es, comme lorsque vous concevez une enqu&ecirc;te.  Le plan doit d&eacute;tailler quelles donn&eacute;es vous cherchez, le niveau de pr&eacute;cision que vous souhaitez recueillir, la p&eacute;riode de temps dont vous avez besoin (ex : voulez-vous des donn&eacute;es sur les six derniers mois seulement?  Les douze derniers?), et la quantit&eacute; de donn&eacute;es dont vous avez besoin (ex : voulez-vous examiner tous les re&ccedil;us ou seulement un &eacute;chantillon?).</p><p></p>

<p>Si certaines sources ne vous appartiennent pas, assurez-vous de les r&eacute;f&eacute;rencer correctement.  Il est important de cr&eacute;diter le travail des autres et il est aussi important d&rsquo;&ecirc;tre capable de d&eacute;fendre vos recherches si quelqu&rsquo;un conteste ult&eacute;rieurement vos informations.</p>

<h2>Rapports r&eacute;currents (journaux)</h2>

<p>Les formulaires de saisie de type &laquo; rapport &raquo;  (ou journaux) peuvent &ecirc;tre utiles si vous collectez des donn&eacute;es aupr&egrave;s de personnes sur des choses qui se produisent sur des p&eacute;riodes de temps prolong&eacute;es. Ils sont particuli&egrave;rement utiles si vous avez besoin qu&rsquo;ils enregistrent beaucoup de d&eacute;tails qui peuvent &ecirc;tre difficiles &agrave; se rem&eacute;morer ou oubli&eacute;s.</p>

<p>Peut-&ecirc;tre avez-vous vu quelque chose de semblable auparavant :</p>

<figure><img alt="Food diary" src="../images/sections/03/CollectionMethods-food-diary-fr.png" /></figure>

<p>Ce type de formulaire est souvent utilis&eacute; pour suivre des choses telles que les repas, les prises de m&eacute;dicaments ou l&rsquo;activit&eacute; physique mais il peut &ecirc;tre utilis&eacute; pour tout ce que vous voulez enregistrer dans la dur&eacute;e. On peut utiliser des formulaires papier ou informatis&eacute;s qui doivent suivre les m&ecirc;mes principes de conception que les enqu&ecirc;tes. Les champs doivent &ecirc;tre bien libell&eacute;s et les instructions doivent &ecirc;tre tr&egrave;s claires sur la fr&eacute;quence &agrave; laquelle le formulaire doit &ecirc;tre compl&eacute;t&eacute;.</p>

<h2>Utiliser de multiples m&eacute;thodes de collecte</h2>

<p>Lorsque vous envisagez un projet dans son ensemble, il est possible que toutes les questions auxquelles vous essayez de r&eacute;pondre ne puissent &ecirc;tre r&eacute;solues en utilisant les donn&eacute;es recueillies &agrave; partir d&rsquo;une seule des m&eacute;thodes de collecte de donn&eacute;es &eacute;tudi&eacute;es jusqu&rsquo;ici. Vous pouvez constater que votre enqu&ecirc;te n&eacute;cessite d&rsquo;&ecirc;tre compl&eacute;t&eacute;e avec des  mesures directes ou que vous avez besoin que vos participants &agrave; des groupes de discussion remplissent des rapports hebdomadaires par exemple.</p>

<p>Tout comme vous pouvez b&eacute;n&eacute;ficier d&rsquo;une combinaison de diff&eacute;rents types d&rsquo;enqu&ecirc;te, vous pouvez &eacute;galement b&eacute;n&eacute;ficier de l&rsquo;int&eacute;gration de plusieurs types de collecte de donn&eacute;es. &Eacute;tudiez  quelles approches sont les plus pertinentes pour les donn&eacute;es dont vous avez besoin et s&eacute;lectionnez les meilleures qui peuvent &ecirc;tre mises en place dans le cadre de vos contraintes de budget et de temps.</p><p></p>

</section>
</section>
