<section class="yellow" data-type="chapter">
<header>
 <div class="icon"><img src="../images/sections/03/external.png" /></div>
 <p>Chapitre 6</p>
 <h1>Trouver des donn&eacute;es externes</h1>
 <p data-type="author">Par Jane Foo Adapt&eacute; par Nadia Belnet </p>
</header>

<section data-type="sect1">
<p>R&eacute;aliser votre propre &eacute;tude pour collecter des donn&eacute;es n&rsquo;est pas le seul ou le meilleur moyen de d&eacute;marrer votre analyse de donn&eacute;es. Utiliser le jeu de donn&eacute;es de quelqu&rsquo;un d&rsquo;autre et partager ses donn&eacute;es se fait de plus en plus souvent et a aid&eacute; &agrave; avancer la plupart des recherches r&eacute;centes. Utiliser des <a class="glossterm" target="_blank" href="glossary01.html#data-external">donn&eacute;es externes</a> offre plusieurs avantages diff&eacute;rents :</p>

<table>
	<tr>
		<td>Temps / Co&ucirc;t</td>
		<td>Peut r&eacute;duire le travail requis pour collecter les donn&eacute;es et les pr&eacute;parer pour l&rsquo;analyse</td>
	</tr>
	<tr>
		<td>Acc&egrave;s</td>
		<td>Peut vous permettre de travailler avec des donn&eacute;es qui requi&egrave;rent pour leur collecte plus de ressources que vous n&rsquo;en avez, ou bien des donn&eacute;es auxquelles vous n&rsquo;auriez pas du tout acc&egrave;s autrement</td>
	</tr>
	<tr>
		<td>Communaut&eacute;</td>
		<td>Favorise de nouvelles id&eacute;es et des collaborations int&eacute;ressantes en vous connectant &agrave; des personnes int&eacute;ress&eacute;es par le m&ecirc;me sujet</td>
	</tr>
</table>


<h2>O&ugrave; trouver des donn&eacute;es externes </h2>
<p>Tous ces b&eacute;n&eacute;fices parlent d&rsquo;eux-m&ecirc;mes ! Alors comment trouver des donn&eacute;es externes ? Pour vous aider &agrave; r&eacute;duire votre recherche, posez-vous les questions suivantes :</p>

<table>
	<tr>
		<td>P&eacute;rim&egrave;tre</td>
		<td>Quel est le p&eacute;rim&egrave;tre des donn&eacute;es que vous recherchez ? Quels sont les :
			<ul>
				<li>fronti&egrave;res g&eacute;ographiques ?</li>
				<li>attributs de donn&eacute;es sp&eacute;cifiques (comme les tranches d&rsquo;&acirc;ge) ?</li>
				<li>p&eacute;riodes de temps ?</li>
			</ul>
		</td>
	</tr>
	<tr>
		<td>Type</td>
		<td>Quel type de donn&eacute;es cherchez-vous ? Avez-vous besoin de :
			<ul>
				<li>statistiques ?</li>
				<li>donn&eacute;es de recherche ?</li>
				<li>donn&eacute;es brutes ?</li>
				<li>donn&eacute;es qui ont &eacute;t&eacute; collect&eacute;es en utilisant une m&eacute;thode sp&eacute;cifique ?</li>
			</ul>
		</td>
	</tr>
	<tr>
		<td>Contribution</td>
		<td>Comment les donn&eacute;es contribuent &agrave; votre analyse de donn&eacute;es actuelle ?<br />
Avez-vous besoin de plusieurs jeux de donn&eacute;es externes pour compl&eacute;ter votre analyse ?</td>
	</tr>
</table>

<h3>Donn&eacute;es publiques</h3>
<p>Une fois que vous avez une id&eacute;e claire de ce que vous recherchez dans un jeu de donn&eacute;es externe, vous pouvez commencer votre recherche au sein des sources de donn&eacute;es publiques qui vous sont rendues disponibles, gr&acirc;ce au <a href="http://book.openingscience.org/" target="_blank">mouvement contenu ouvert et acc&egrave;s</a> qui a gagn&eacute; en popularit&eacute; sur Internet. De nombreuses institutions gouvernements et organisations ont &eacute;tabli des politiques qui favorisent la diffusion des donn&eacute;es au public afin de fournir plus de transparence et de responsabilit&eacute; et d&#39;encourager le d&eacute;veloppement de nouveaux produits et services. Voici une liste de sources de donn&eacute;es publiques par cat&eacute;gorie:</p>

<table>
	<tr>
		<th>Source</th>
		<th>Exemples</th>
	</tr>
	<tr>
		<td>Moteurs de recherche</td>
		<td><a href="http://www.google.com">Google</a></td>
	</tr>
	<tr>
		<td>R&eacute;f&eacute;rentiels de donn&eacute;es</td>
		<td>
			<a href="http://www.re3data.org/" target="_blank">re3data.org</a><br />
			<a href="http://databib.org/" target="_blank">DataBib</a><br />
			<a href="http://www.datacite.org/" target="_blank">DataCite</a><br />
			<a href="http://datadryad.org/" target="_blank">Dryad</a><br />
			<a href="http://datacatalogs.org/" target="_blank">DataCatalogs.org</a><br />
			<a href="http://oad.simmons.edu/oadwiki/Data_repositories" target="_blank">Open Acc&egrave;s Directory</a><br />
			<a href="http://www.gapminder.org/data" target="_blank">Gapminder</a><br />
			<a href="https://www.google.com/publicdata/directory" target="_blank">Google Donn&eacute;es publiques Explorer</a><br />
			<a href="http://www.manyeyes.com/software/analytics/manyeyes/datasets" target="_blank">IBM Many Eyes</a><br />
			<a href="http://knoema.com/atlas//" target="_blank">Knoema</a>
		</td>
	</tr>
	<tr>
		<td>Jeux de donn&eacute;es gouvernementaux</td>
		<td>
			<a href="http://data.worldbank.org/" target="_blank">World Bank</a><br />
			<a href="http://data.un.org/" target="_blank">United Nations</a><br />
			<a href="https://index.okfn.org/" target="_blank">Open Data Index</a><br />
			<a href="http://www.opendataresearch.org/project/2013/odb" target="_blank">Open Data Barometer</a><br />
			<a href="https://www.data.gov/" target="_blank">U.S. Government Data</a><br />
			<a href="https://opendata.go.ke/" target="_blank">Kenya&rsquo;s Open Data Initiative</a>
		</td>
	</tr>
	<tr>
		<td>Institutions de recherche</td>
		<td>
			<a href="http://academictorrents.com/" target="_blank">Academic Torrents</a><br />
			American Psychological Association<br />
			Autres associations professionnelles<br />
			Institutions acad&eacute;miques 
		</td>
	</tr>

</table>

<p>Si vous d&eacute;cidez d&rsquo;utiliser un moteur de recherche (tel que Google) pour rechercher des jeux de donn&eacute;es, n&rsquo;oubliez pas que vous ne trouverez que des choses qui sont index&eacute;es par le moteur de recherche. Parfois un site web (et les ressources associ&eacute;es) ne sera visible que pour les utilisateurs authentifi&eacute;s et sera param&eacute;tr&eacute; pour bloquer le moteur de recherche, donc ces types de site web n&rsquo;appara&icirc;tront pas dans les r&eacute;sultats de la recherche. Internet est un grand terrain de jeu, &eacute;pargnez-vous la fastidieuse t&acirc;che de faire d&eacute;filer de nombreux r&eacute;sultats de recherche non pertinents en &eacute;tant clair et pr&eacute;cis sur ce que vous recherchez.</p>

<p>Si vous ne savez pas trop quoi faire d&rsquo;un type particulier de donn&eacute;es, essayez de naviguer &agrave; travers le site <a href="http://www.informationisbeautifulawards.com" target="_blank">Information is Beautiful awards</a> pour inspiration. Vous pouvez &eacute;galement assister &agrave; des &eacute;v&eacute;nements tels que l&rsquo;<a href="http://opendataday.org/" target="_blank">Open Data Day</a> pour voir ce que d&rsquo;autres ont fait avec les donn&eacute;es ouvertes.</p>

<p>Les r&eacute;f&eacute;rentiels de donn&eacute;es ouvertes b&eacute;n&eacute;ficient &agrave; la fois aux contributeurs et aux utilisateurs en fournissant un forum pour partager et r&eacute;fl&eacute;chir aux moyens d&rsquo;&eacute;tudier et discuter des donn&eacute;es. Dans certains cas, la production participative de donn&eacute;es (data crowdsourcing) a conduit &agrave; de nouvelles conclusions qui se seraient d&eacute;velopp&eacute;es &agrave; un rythme beaucoup plus lent ou n&rsquo;auraient pas &eacute;t&eacute; possibles en premier lieu. L&rsquo;un des projets de production participative de donn&eacute;es les plus m&eacute;diatis&eacute;s est <a href="http://fold.it/portal/info/about">Foldit</a> de l&rsquo;Universit&eacute; de Washington, un jeu de puzzle en ligne permettant &agrave; n&rsquo;importe qui de pr&eacute;senter des variations de repliement de prot&eacute;ines qui sont utilis&eacute;s par les scientifiques pour construire de nouvelles solutions innovantes en bioinformatique et en m&eacute;decine. Et r&eacute;cemment, la Recherche contre le Cancer du Royaume-Uni a publi&eacute; un jeu mobile appel&eacute; <a href="http://scienceblog.cancerresearchuk.org/2014/02/04/download-our-revolutionary-mobile-game-to-help-speed-up-cancer-research/">Genes in Space</a> qui assigne aux utilisateurs la t&acirc;che d&rsquo;identifier des cellules canc&eacute;reuses dans les diapositives de biopsies ce qui en retour aide les chercheurs &agrave; r&eacute;duire le temps d&rsquo;analyse de donn&eacute;es.</p>


<h3>Donn&eacute;es non publiques</h3>

<p>Bien s&ucirc;r, toutes les donn&eacute;es ne sont pas publiques. Il peut arriver un moment o&ugrave; vous avez acc&egrave;s &agrave; une collection sp&eacute;ciale de donn&eacute;es en raison de votre statut au sein d&#39;un r&eacute;seau particulier ou par une relation existante. Ou bien peut-&ecirc;tre &ecirc;tes-vous tomb&eacute; sur un jeu de donn&eacute;es que vous pouvez acheter. Dans les deux cas, vous devez g&eacute;n&eacute;ralement accepter et signer une licence pour obtenir les donn&eacute;es, vous devez donc vous assurer d&rsquo;avoir pass&eacute; en revue les Termes d&rsquo;Utilisation avant d&rsquo;acheter. Si aucune condition n&rsquo;est fournie, insistez sur le fait d&rsquo;avoir une autorisation &eacute;crite pour utiliser le jeu de donn&eacute;es.</p>

<h2>&Eacute;valuer les donn&eacute;es externes</h2>

<p>Disons que vous avez trouv&eacute; un jeu de donn&eacute;es qui correspond &agrave; vos crit&egrave;res. Mais est-ce que la qualit&eacute; est suffisamment bonne ?</p>

<p>Evaluer la qualit&eacute; des donn&eacute;es consiste &agrave; examiner tous les d&eacute;tails fournis &agrave; propos des donn&eacute;es (notamment les metadonn&eacute;es, ou les &ldquo;donn&eacute;es &agrave; propos des donn&eacute;es&rdquo;, telles que l&rsquo;heure et la date de cr&eacute;ation) et le contexte dans lequel celles-ci sont pr&eacute;sent&eacute;es. Les bons jeux de donn&eacute;es fourniront des d&eacute;tails &agrave; propos de la finalit&eacute; du jeu de donn&eacute;es, la propri&eacute;t&eacute; (appartenance), les m&eacute;thodes, le p&eacute;rim&egrave;tre, les dates et d&rsquo;autres informations. Pour les jeux de donn&eacute;es en ligne, vous trouverez souvent ces informations en consultant les pages web &ldquo;A propos&rdquo; ou &ldquo;Plus d&rsquo;information&rdquo; ou en suivant un lien de type &ldquo;Documentation&rdquo;.</p>

<p>N&rsquo;h&eacute;sitez pas &agrave; utiliser les techniques g&eacute;n&eacute;rales d&rsquo;&eacute;valuation de l&rsquo;information lors de l&rsquo;examen des donn&eacute;es. Par exemple, une m&eacute;thode populaire utilis&eacute;e par les biblioth&egrave;ques universitaires est le test CRAAP, qui est un jeu de questions vous aidant &agrave; d&eacute;terminer la qualit&eacute; d&rsquo;un texte. L&rsquo;acronyme signifie : P&eacute;riode de validit&eacute;, Pertinence, Auteurity, Pr&eacute;cision, Finalit&eacute;.</p>


<table>
	<tbody>
		<tr>
			<td><b>P&eacute;</b>riode de validit&eacute;</td>
			<td>L&rsquo;information est-elle &agrave; jour ? Quand a-t-elle &eacute;t&eacute; collect&eacute;e / publi&eacute;e / mise &agrave; jour ?</td>
		</tr>
		<tr>
			<td><b>P</b>ertinence</td>
			<td>Est-ce que l&rsquo;information est adapt&eacute;e &agrave; l&rsquo;usage auquel vous la destinez ? R&eacute;pond-elle &agrave; votre question de recherche ? Y&rsquo;a-t-il d&rsquo;autres (meilleures) informations ?</td>
		</tr>
		<tr>
			<td><b>A</b>uteurity</td>
			<td>Le cr&eacute;ateur de l&rsquo;information est-il r&eacute;put&eacute; et a-t-il les cr&eacute;dits/pouvoirs n&eacute;cessaires ? Pouvez-vous faire confiance &agrave; l&rsquo;information ?</td>
		</tr>
		<tr>
			<td><b>P</b>r&eacute;cision</td>
			<td>Voyez-vous des erreurs ? Quelle est la source de l&rsquo;information ? Y&rsquo;a-t-il d&rsquo;autres donn&eacute;es ou recherches qui pourraient corroborer cette information ?</td>
		</tr>
		<tr>
			<td><b>F</b>inalit&eacute;</td>
			<td>Quel &eacute;tait le but de l&rsquo;information collect&eacute;e ? Y&rsquo;a-t-il d&rsquo;autres usages potentiels identifi&eacute;s ?</td>
		</tr>
	</tbody>
</table>



<p>Enfin, lorsque vous passez en revue le jeu de donn&eacute;es dans le d&eacute;tail, faites attention aux drapeaux rouges suivants :</p>

<ul>
	<li>Les d&eacute;tails de la m&eacute;thode de collecte des donn&eacute;es ne sont pas connus</li>
	<li>Aucune information de contact</li>
	<li>Vague propri&eacute;t&eacute; (appartenance) des donn&eacute;es</li>
	<li>Aucune entit&eacute; ou pouvoir autoritaire associ&eacute; au collecteur de donn&eacute;es ou aux donn&eacute;es</li>
	<li>Terms of use or license includes details that raises questions
(e.g. data can&rsquo;t be used for scientific study)</li>
	<li>Les m&eacute;tadonn&eacute;es sont manquantes ou incoh&eacute;rentes</li>
	<li>De larges pans de donn&eacute;es sont manquants sans aucune explication ou points de r&eacute;f&eacute;rence</li>
	<li>Les donn&eacute;es brutes semblent &ldquo;trop parfaites&rdquo;</li>
	<li>Des articles publi&eacute;s contestent ou remettent en question le jeu de donn&eacute;es</li>
</ul>


<h2>Utiliser des donn&eacute;es externes</h2>

<p>Donc maintenant vous avez un jeu de donn&eacute;es de qualit&eacute; qui r&eacute;pond &agrave; vos crit&egrave;res, et vous avez la permission de l&rsquo;utiliser. Que devriez-vous envisager avant de commencer &agrave; travailler ?</p>

<table>
	<tr>
		<th>Liste de contr&ocirc;le</th>
		<th> </th>
	</tr>
	<tr>
		<td>Avez-vous eu tous les d&eacute;tails n&eacute;cessaires &agrave; propos des donn&eacute;es ?</td>
		<td>N&rsquo;oubliez pas d&rsquo;obtenir les sp&eacute;cifications des variable, les dictionnaires de donn&eacute;es externes, et les ouvrages de r&eacute;f&eacute;rence.</td>
	</tr>
	<tr>
		<td>Les donn&eacute;es font-elles partie d&rsquo;un jeu de donn&eacute;es plus large ou du contenu d&rsquo;une recherche ?</td>
		<td>Si oui, cherchez les sp&eacute;cifications pertinentes ou les notes du plus grand jeu de donn&eacute;es.</td>
	</tr>
	<tr>
		<td>Le jeu de donn&eacute;es a-t-il &eacute;t&eacute; utilis&eacute; auparavant ?</td>
		<td>S&rsquo;il l&rsquo;a &eacute;t&eacute; et que vous utilisez les donn&eacute;es pour une analyse, assurez-vous que votre analyse apporte de nouveaux enseignements par rapport &agrave; ce que vous savez avoir d&eacute;j&agrave; &eacute;t&eacute; fait avec ces donn&eacute;es.</td>
	</tr>
	<tr>
		<td>Comment documentez-vous votre process et utilisation des donn&eacute;es ?</td>
		<td>Assurez-vous de garder une trace des droits de licence, des communications avec les propri&eacute;taires des donn&eacute;es, du stockage et de l&rsquo;archivage des donn&eacute;es, si cela est applicable.</td>
	</tr>
	<tr>
		<td>Pr&eacute;voyez-vous de partager vos r&eacute;sultats et enseignements dans le futur ?</td>
		<td>Si oui, il vous faudra inclure le dictionnaire des donn&eacute;es et une liste des sources de donn&eacute;es additionnelles.</td>
	</tr>

</table>


<p>Vos r&eacute;ponses &agrave; ces questions peuvent changer le p&eacute;rim&egrave;tre de votre analyse ou vous amener &agrave; rechercher des donn&eacute;es suppl&eacute;mentaires. Elles peuvent m&ecirc;me vous amener &agrave; penser &agrave; un tout nouvel angle de recherche.</p>

<p>La liste de contr&ocirc;le vous encourage &agrave; documenter (beaucoup). Une documentation minutieuse est importante pour deux grandes raisons. D&rsquo;abord, dans le cas o&ugrave; vous avez &agrave; refaire votre analyse, votre documentation vous aidera &agrave; retracer ce que vous avez fait. Ensuite, votre documentation fournira des preuves aux autres chercheurs que votre analyse a &eacute;t&eacute; correctement men&eacute;e et leur permettra de construire sur les enseignements issus de vos donn&eacute;es.</p>

<h2>Cr&eacute;diter les sources de donn&eacute;es externes</h2>

<p>Dit autrement, cr&eacute;diter les sources de donn&eacute;es externes est la bonne chose &agrave; faire. Elle est &eacute;galement obligatoire. Les directives &eacute;thiques de recherche indiquent que le cr&eacute;dit des sources est n&eacute;cessaire pour tout type de recherche. Donc assurez-vous toujours de cr&eacute;diter correctement les donn&eacute;es ext&eacute;rieures que vous utilisez en fournissant leur r&eacute;f&eacute;rence.</p>

<p>De bonnes r&eacute;f&eacute;rences donnent au lecteur suffisamment d&rsquo;information pour trouver les donn&eacute;es auxquelles vous avez eu acc&egrave;s et que vous avez utilis&eacute;es. Vous vous demandez &agrave; quoi ressemble une bonne r&eacute;f&eacute;rence ? Essayez d&rsquo;utiliser un manuel de style de r&eacute;f&eacute;rence existant provenant de <a href="https://owl.english.purdue.edu/owl/section/2/10/">APA</a>, <a href="https://owl.english.purdue.edu/owl/section/2/11/">MLA</a>, <a href="http://www.chicagomanualofstyle.org/tools_citationguide.html">Chicago</a>, <a href="http://www.press.uchicago.edu/books/turabian/turabian_citationguide.html">Turabian</a>, ou <a href="http://guides.is.uwa.edu.au/harvard">Harvard</a>. Contrairement aux r&eacute;f&eacute;rences pour des &eacute;l&eacute;ments publi&eacute;s (tels que des livres), les r&eacute;f&eacute;rences pour un jeu de donn&eacute;es varient &eacute;norm&eacute;ment d&rsquo;un style &agrave; l&rsquo;autre.</p>

<p>En r&egrave;gle g&eacute;n&eacute;rale, tous les styles exigent l&rsquo;auteur et le titre. En plus de cela, l&rsquo;&eacute;diteur, le producteur ou le distributeur de l&rsquo;information (lieu, date de publication), la date d&rsquo;acc&egrave;s (lorsque vous avez vu la premi&egrave;re fois les donn&eacute;es), les d&eacute;tails &agrave; propos du jeu de donn&eacute;es (identifiant unique, &eacute;dition, support), et l&rsquo;URL peuvent &ecirc;tre n&eacute;cessaires. Pour les jeux de donn&eacute;es gouvernementaux, utilisez le nom du d&eacute;partement, du comit&eacute; ou de l&rsquo;organisme comme nom d&rsquo;auteur groupe ou institutionnel.</p>

<p>Par exemple, disons que vous utilisez U.S. Census Annual Survey of Public Employment and Payroll (enqu&ecirc;te annuelle des Etats-Unis de recensement de l&rsquo;emploi et de la paie). </p>

<p>Le manuel de style APA (Manuel de Publication de l&rsquo;Association Am&eacute;ricaine de Psychologie, 6&egrave;me &eacute;dition) vous citerait de la mani&egrave;re suivante :</p>

<figure><img alt="APA citation" src="../images/sections/03/ExternalData-apa-citation-fr.png" /></figure>

<p>alors que le manuel de style MLA (Manuel MLA pour les Ecrivains-Chercheurs, 7&egrave;me &eacute;dition) r&eacute;f&eacute;rence les m&ecirc;me donn&eacute;es de recensement comme :</p>

<figure><img alt="MLA citation" src="../images/sections/03/ExternalData-mla-citation-fr.png" /></figure>

<p>Les r&eacute;pertoires de donn&eacute;es et les organisations ont souvent leurs propres directives de r&eacute;f&eacute;rence et fournissent des r&eacute;f&eacute;rences pr&ecirc;tes &agrave; l&rsquo;emploi que vous pouvez utiliser &ldquo;telles quelles&rdquo;. Le Consortium Interuniversitaire pour la Recherche Politique et Sociale (<a href="http://www.icpsr.umich.edu/icpsrweb/landing.jsp" target="_blank">The Interuniversity Consortium for Political and Social Research (ICPSR)</a>), le Centre National des Statistiques de Sant&eacute; (<a href="http://www.cdc.gov/nchs/" target="_blank">The National Center for Health Statistics</a>), <a href="http://datadryad.org/" target="_blank">Dryad</a>, <a href="http://datadryad.org/" target="_blank">Dryad</a>, <a href="http://www.pangaea.de/">PANGAEA</a>, et le Centre de Donn&eacute;es Roper (<a href="http://www.ropercenter.uconn.edu/" target="_blank">Roper Center Data</a>) fournissent tous des directives pour faire r&eacute;f&eacute;rence &agrave; leurs jeux de donn&eacute;es.</p>


<p>Ce chapitre vous a donn&eacute; un bref aper&ccedil;u des donn&eacute;es externes : la chose importante &agrave; retenir, c&rsquo;est que nous ne sommes qu&rsquo;au d&eacute;but d&rsquo;une croissance significative des donn&eacute;es gr&acirc;ce aux technologies qui rendent d&eacute;sormais le stockage et le traitement de donn&eacute;es massives une r&eacute;alit&eacute; abordable. Les jeux de donn&eacute;es ouvertes en particulier ont le potentiel pour devenir la norme de facto pour toute personne cherchant des donn&eacute;es &agrave; analyser.</p>
</section>
</section>
