<section class="blue" data-type="chapter">
<header>
<div class="icon"><img src="../images/sections/03/survey.png" /></div>

<p>Chapitre 4</p>

<h1>Types de Questions pour Sondages</h1>

<p data-type="author">Par Ginette Law Adapt&eacute; par Arnaud Flan</p>
</header>

<section data-type="sect1">
<p>Quand vous avez d&eacute;cid&eacute; du type de questionnaire que vous allez utiliser, vous devez d&eacute;cider du type de questions que vous allez y inclure. Le type de questions d&eacute;termine les donn&eacute;es que vous pourrez collecter, ce qui d&eacute;termine aussi ce que vous pourrez faire de ces donn&eacute;es ensuite. Par exemple, si vous posez une question sur l&rsquo;&acirc;ge et que vous enregistrez un nombre (21 ans, 34 ans, &hellip;), vous aurez une donn&eacute;e num&eacute;rique &agrave; laquelle vous pourrez appliquer des op&eacute;rations math&eacute;matiques (moyenne, &hellip;). Si, &agrave; la place, vous demandez la cat&eacute;gorie d&rsquo;&acirc;ge d&rsquo;une personne (i.e. 18-24, 25-34, 35-44&hellip;), vous aurez d&eacute;fini des donn&eacute;es cat&eacute;gorielles : vous serez capable de compter le nombre de personnes par groupe, mais vous ne serez pas en mesure de calculer la moyenne d&rsquo;&acirc;ge des r&eacute;pondants. Avant de cr&eacute;er un questionnaire, il est important de penser &agrave; la fa&ccedil;on dont on veut analyser les r&eacute;sultats finaux. Ainsi vous pourrez choisir les bonnes questions qui donneront les donn&eacute;es n&eacute;cessaires &agrave; vos analyses.</p>

<h2>Questions ouvertes ou ferm&eacute;es</h2>

<p>Les questions ouvertes sont utilis&eacute;es quand vous cherchez &agrave; collecter des donn&eacute;es qualitatives d&eacute;taill&eacute;es. La question est alors pos&eacute;e sans offrir une liste de r&eacute;ponses &agrave; choisir. C&rsquo;est souvent une bonne option pour d&eacute;couvrir de nouvelles id&eacute;es que vous auriez oubli&eacute;es ou que vous ne connaissiez pas. A l&rsquo;oppos&eacute;e, dans une question ferm&eacute;e, un nombre limit&eacute;e de choix est offert pour r&eacute;pondre &agrave; la question. Les questions ferm&eacute;es sont utilis&eacute;es quand vous avez d&eacute;j&agrave; une id&eacute;e des r&eacute;ponses qui seront fournies ou si vous voulez connaitre la r&eacute;partition des r&eacute;ponses parmi des r&eacute;ponses pr&eacute;d&eacute;finies.</p>

<p>Supposons que vous travaillez pour un glacier appel&eacute; &laquo; Fictifs &raquo;. Vous voulez savoir pourquoi certaines personnes ne viennent pas dans votre boutique. Ci-dessous les questions ouvertes et ferm&eacute;es que vous pourriez poser pour en trouver les raisons.</p>

<figure><img alt="Questions ouvertes ou ferm&eacute;es" src="../images/sections/03/SurveyQuestions-open-vs-closed-fr.png" /></figure>

<p>Dans une question ferm&eacute;e, vous offrez les raisons les plus probables pour lesquelles les gens ne mangeraient pas de glace, tandis que dans une question ouverte, vous leur demandez seulement pourquoi ils ne mangent pas de glace chez &laquo; Fictifs &raquo; et vous les autorisez &agrave; r&eacute;pondre ce qu&rsquo;ils veulent.</p>

<p>Pour une question ouverte, vous obtenez un aper&ccedil;u des raisons pour lesquelles les personnes ne testeraient pas votre glace : ce n&#39;est pas parce qu&#39;ils n&#39;aiment pas la glace ou qu&rsquo;ils n&#39;aiment pas Fictifs, c&#39;est parce qu&#39;ils ne peuvent pas en manger ! Avec cette nouvelle information, vous pourriez vouloir leur offrir un nouveau type de glace et attirer une client&egrave;le que vous n&#39;aviez pas cibl&eacute;e auparavant.</p>

<p>C&rsquo;est un avantage des questions ouvertes et il est particuli&egrave;rement utile si vous faites de la recherche exploratoire et parcourrez principalement les r&eacute;ponses pour vous faire une id&eacute;e des r&eacute;ponses apport&eacute;es par la population interrog&eacute;e. Cependant, il n&eacute;cessite beaucoup plus de travail pour analyser et r&eacute;sumer ces donn&eacute;es.</p>

<p>Quand vous pensez que la plupart des personnes donneront plus ou moins la m&ecirc;me r&eacute;ponse, vous pouvez combiner une question ouverte et ferm&eacute;e pour obtenir de meilleurs r&eacute;sultats. Ceci est habituellement utiliser en offrant un certain nombre de choix pr&eacute;d&eacute;finis, mais en laissant la possibilit&eacute; pour des participants d&rsquo;expliquer leur r&eacute;ponse s&#39;ils choisissent la cat&eacute;gorie &laquo; Autre &raquo;. Voici &agrave; quoi la m&ecirc;me question ressemblerait si vous l&#39;aviez transform&eacute; dans une question ouverte et ferm&eacute;e combin&eacute;e :</p>

<figure><img alt="Closed/Open Question" src="../images/sections/03/SurveyQuestions-open-and-closed-fr.png" /></figure>

<h2>Questions ferm&eacute;es</h2>

<h3>Questions &agrave; choix multiples</h3>

<p>Parfois, vous voudrez que les personnes interrog&eacute;es choisissent une seule r&eacute;ponse parmi une liste. Si votre questionnaire est en ligne, vous utiliserez un bouton radio pour indiquer un choix unique et des cases &agrave; cocher pour indiquer un choix multiple. En voici un exemple :</p>

<figure><img alt="Radio vs. Checkbox" src="../images/sections/03/SurveyQuestions-radio-vs-checkbox-fr.png" /></figure>

<p>Si votre questionnaire est une enqu&ecirc;te papier ou r&eacute;alis&eacute;e sur le terrain, vous pr&eacute;ciserez sur le questionnaire ou &agrave; l&rsquo;oral combien d&#39;options la personne interrog&eacute;e devra choisir (par exemple, &quot;choisissez s&#39;il vous pla&icirc;t une r&eacute;ponse&quot;; &quot;choisissez s&#39;il vous pla&icirc;t jusqu&#39;&agrave; 3 r&eacute;ponses&quot;; &quot;choisissez s&#39;il vous pla&icirc;t autant de r&eacute;ponses que vous le souhaitez&quot;).</p>

<p>Les choix de r&eacute;ponse ne devront pas se chevaucher et devront couvrir toutes les options possibles. On parle de cat&eacute;gories &quot;mutuellement exclusives et exhaustives&quot; et ceci est crucial pour la conception de l&#39;enqu&ecirc;te. Prenons l&rsquo;exemple ci-dessous :</p>

<figure><img alt="Unclear radio buttons" src="../images/sections/03/SurveyQuestions-correct-age-groups-fr.png" /></figure>

<p>A gauche dans l&#39;ensemble des choix, quelqu&#39;un qui a 25 ans ne saura pas s&#39;il faut cliquer sur le choix 18-25 ou 25-35 et quelqu&#39;un qui a 60 ans n&#39;aurait pas du tout de choix lui correspondant ! L&#39;ensemble des cat&eacute;gories d&#39;&acirc;ge &agrave; droite est correct car il inclut toutes les tranches d&#39;&acirc;ge possibles, les choix d&#39;&acirc;ge ne se chevauchent pas et il offre la possibilit&eacute; de ne pas r&eacute;pondre &agrave; la question.</p>

<div data-type="warning">
<p>Il est recommand&eacute; d&#39;inclure une option &quot;Pr&eacute;f&egrave;re ne pas r&eacute;pondre&quot; pour les questions &agrave; caract&egrave;re personnel, comme la race, l&#39;appartenance ethnique, le revenu, l&#39;orientation politique, etc. Sans cette option, les personnes interrog&eacute;es risquent tout simplement de passer &agrave; la question suivante, mais vous ne pourrez pas dire par la suite si la question a &eacute;t&eacute; pass&eacute;e sciemment ou accidentellement. Or ce point peut faire une diff&eacute;rence importante quand vous analysez vos donn&eacute;es.</p>
</div>

<p>Il ne sera pas toujours pratique d&#39;inscrire chaque option possible. Dans ce cas, inclure une option &quot;Aucun&quot; ou &quot;Autre&quot; peut &ecirc;tre utile. Cela r&eacute;duit le risque de voir les personnes interrog&eacute;es passer la question et limite donc le nombre de donn&eacute;es manquantes. Pour les questions ne concernant pas toutes les personnes interrog&eacute;es, vous pouvez proposer un choix &quot;Nonn Applicable&quot; (c&#39;est-&agrave;-dire, &quot;N/A&quot;) et une option &ldquo;ne sais pas&rdquo; si les personnes interrog&eacute;es sont susceptibles de ne pas connaitre la r&eacute;ponse &agrave; la question.</p>

<h3>Questions dichotomiques</h3>

<p>Une question dichotomique est un type particulier de question &agrave; choix multiples utilis&eacute; quand il n&rsquo;y a que deux choix possibles pour r&eacute;pondre &agrave; la question. Voici quelques exemples classiques de questions dichotomiques :</p>

<figure><img alt="dichotomous questions" src="../images/sections/03/SurveyQuestions-dichotomous-questions-fr.png" /></figure>

<p>Vous pouvez utiliser les questions dichotomiques pour d&eacute;terminer si la personne interrog&eacute;e doit r&eacute;pondre &agrave; la question suivante. On appelle ce type de question une question filtre. Les filtres peuvent vite devenir complexes donc essayer de ne pas utiliser plus de deux ou trois questions filtres &agrave; la suite. Voici un exemple de la logique se cachant derri&egrave;re une question filtre :</p>

<figure><img alt="Fictional&rsquo;s Flow Chart" src="../images/sections/03/SurveyQuestions-filter-question-fr.png" /></figure>

<p>Dans une enqu&ecirc;te en ligne ou une enqu&ecirc;te r&eacute;alis&eacute;e sur le terrain, r&eacute;pondre &quot;oui&quot; &agrave; la question &quot; mangez-vous des glaces au Salon de Glace Fictifs ? &quot; dirigera la personne interrog&eacute;e vers la question concernant la fr&eacute;quence &agrave; laquelle ils mangent des glaces Fictifs, tandis que le choix &quot;Nonn&quot; ouvrira la question des raisons pour lesquelles ils ne mangent pas de glaces Fictifs. Dans une enqu&ecirc;te papier, toutes les questions devraient &ecirc;tre pr&eacute;sent&eacute;es sur une page et ne peuvent pas &ecirc;tre conditionn&eacute;es par une r&eacute;ponse sp&eacute;cifique. Vous pouvez toutefois utiliser un formulaire comme dans le diagramme ci-dessus, ou employer des sauts, comme illustr&eacute; ci-dessous.</p>

<figure><img alt="Skip instructions" src="../images/sections/03/SurveyQuestions-skip-instructions-fr.png" /></figure>

<h3>Questions graduees (ou &eacute;chelonn&eacute;es)</h3>

<p>Les questions gradu&eacute;es sont utilis&eacute;es pour mesurer les opinions ou les styles de vie des personnes interrog&eacute;es selon une &eacute;chelle. Elles sont de plusieurs types mais les plus commun&eacute;ment utilis&eacute;es sont les &eacute;chelles de Likert et les &eacute;chelles mobiles (curseurs). La principale diff&eacute;rence entre les deux est qu&rsquo;une &eacute;chelle de Likert permet d&rsquo;ordonner les r&eacute;ponses alors qu&rsquo;une &eacute;chelle mobile permet aux personnes interrog&eacute;es de d&eacute;finir un niveau de r&eacute;ponse par rapport &agrave; une &eacute;chelle gradu&eacute;e. Le r&eacute;sultat d&rsquo;une question de type &eacute;chelle de Likert vous donnera des donn&eacute;es selon diff&eacute;rents niveaux tandis qu&rsquo;une &eacute;chelle mobile vous donnera les donn&eacute;es int&eacute;gr&eacute;es dans des intervalles.</p>

<figure><img alt="Likert vs. Echelle mobile" src="../images/sections/03/SurveyQuestions-likert-vs-slider-fr.png" /></figure>

<p>Dans l&#39;exemple ci-dessus, on pose la m&ecirc;me question deux fois, une fois avec une &eacute;chelle de Likert et une fois avec une &eacute;chelle mobile. Remarquez que dans l&#39;&eacute;chelle de Likert il y a cinq cat&eacute;gories. Les &eacute;chelles avec un nombre impair de cat&eacute;gories permettent aux participants d&#39;&ecirc;tre d&#39;accord, de ne pas &ecirc;tre d&#39;accord, ou d&rsquo;indiquer leur neutralit&eacute;; les &eacute;chelles avec un nombre pair de cat&eacute;gories permettent seulement aux participants d&#39;&ecirc;tre d&#39;accord ou ne pas &ecirc;tre d&#39;accord. Si vous voulez tenir compte de la neutralit&eacute;, les &eacute;chelles avec un nombre impair de cat&eacute;gories sont habituellement pr&eacute;f&eacute;r&eacute;es; cependant, si vous voulez exiger que la personne interrog&eacute;e choisisse une direction ou l&#39;autre vous devrez utiliser un nombre pair de cat&eacute;gories. Ceci est appel&eacute; &quot;une question obligatoire.&quot;</p>

<h3>Echelle de Likert</h3>

<p>Les &eacute;chelles de Likert sont habituellement limit&eacute;es &agrave; une &eacute;chelle &agrave; cinq cat&eacute;gories, car il est souvent difficile de clairement afficher un plus grand nombre de cat&eacute;gories. Parmi les &eacute;chelles de Likert les plus commun&eacute;ment utilis&eacute;es, vous trouverez :</p>

<ul>
	<li>Opinions et attitudes : &quot;&ecirc;tes-vous d&#39;accord avec &hellip; ?&quot;<br />
	R&eacute;ponses possibles : Tout &agrave; fait d&rsquo;accord, d&rsquo;accord, ni d&#39;accord ni pas d&#39;accord, plut&ocirc;t pas d&#39;accord, pas du tout d&#39;accord</li>
	<li>Fr&eacute;quence : &quot;combien de fois faites-vous&hellip; ?&quot;<br />
	R&eacute;ponses possibles : toujours, souvent, parfois, rarement, jamais</li>
	<li>Qualit&eacute; : &quot;en g&eacute;n&eacute;ral, comment &eacute;valuez-vous la qualit&eacute; de &hellip; ?&quot;<br />
	R&eacute;ponses possibles : excellent, tr&egrave;s bon, bon, moyen, faible</li>
	<li>Importance : &ldquo;Comment jugez-vous l&rsquo;importance de ce sujet&hellip; ?&rdquo;<br />
	R&eacute;ponses possibles : tr&egrave;s important, important, moyennement important, pas du tout important</li>
</ul>

<h3>Echelle mobile</h3>

<p>Les &eacute;chelles mobiles sont utilis&eacute;es quand vous voulez avoir une lecture plus pr&eacute;cise des avis d&#39;une personne interrog&eacute;e. Ces &eacute;chelles sont plus facilement mises en &oelig;uvre dans une enqu&ecirc;te en ligne, puisque l&#39;ordinateur calculera la position du curseur; son utilisation lors d&rsquo;une enqu&ecirc;te papier est beaucoup moins ais&eacute;e. Les &eacute;chelles mobiles peuvent &ecirc;tre plus pratiques que les &eacute;chelles de Likert pour conduire une enqu&ecirc;te traduite dans diff&eacute;rentes langues puisque les cat&eacute;gories ne sont pas toujours faciles &agrave; traduire.</p>

<figure><img alt="sliding scale" src="../images/sections/03/SurveyQuestions-slider-scale-fr.png" /></figure>

<div data-type="warning">
<p>En cr&eacute;ant une &eacute;chelle, de Likert ou mobile, n&#39;oubliez jamais d&#39;&eacute;tiqueter les premiers et derniers points dans votre &eacute;chelle. Dans le cas contraire, les personnes interrog&eacute;es peuvent mal interpr&eacute;ter votre &eacute;chelle et vous donner des donn&eacute;es impr&eacute;cises ou trompeuses.</p>
</div>

<h2>Formulation de questions</h2>

<p>Il est extr&ecirc;mement important de penser &agrave; comment formuler vos questions en cr&eacute;ant une enqu&ecirc;te. Voici quelques &eacute;l&eacute;ments cl&eacute;s &agrave; garder &agrave; l&#39;esprit :</p>

<h3>Objectif</h3>

<p>Chaque question doit &ecirc;tre sp&eacute;cifique et avoir un objectif d&eacute;fini.</p>

<div data-type="example">
<p>Combien de fois avez-vous mang&eacute; de la glace le mois dernier ?</p>
</div>

<p>Cette question se concentre sur un sujet (la fr&eacute;quence de consommation de glace) et est sp&eacute;cifique (une certaine p&eacute;riode).</p>

<div class="neutral" data-type="example">
<p>&Eacute;vitez-vous la cr&egrave;me glac&eacute;e parce que vous &ecirc;tes au r&eacute;gime ? [R&eacute;ponse : oui, j&#39;&eacute;vite la glace, mais pas parce que je suis au r&eacute;gime]</p>
</div>

<p>Cette question est mal d&eacute;finie pour plusieurs raisons : elle ne se concentre pas sur un sujet et elle est trop sp&eacute;cifique. Elle suppose que la personne interrog&eacute;e est en fait au r&eacute;gime et que c&#39;est la raison pour laquelle il ou elle ne mange pas de glace. Une meilleure formulation serait &quot;Pourquoi &eacute;vitez-vous la cr&egrave;me glac&eacute;e ?&quot; Avec &quot;je suis un r&eacute;gime&quot; comme un des r&eacute;ponses que pourra choisir le participant &agrave; l&rsquo;enqu&ecirc;te.</p>

<p>Vous devrez &eacute;galement &eacute;viter d&#39;utiliser le mot &quot;et&quot; s&#39;il relie deux id&eacute;es diff&eacute;rentes dans une seule question. Souvenez-vous, chaque question doit se concentrer seulement sur un sujet &agrave; la fois : dans le cas contraire, vous ne r&eacute;colterez pas d&rsquo;aussi bonnes donn&eacute;es que vous pouvez l&rsquo;esp&eacute;rer. En composant une question comprenant diff&eacute;rents sujets, vous r&eacute;duisez l&#39;exactitude des r&eacute;ponses des participants et limitez ainsi l&rsquo;utilisation que vous pouvez faire de ces donn&eacute;es. Au lieu de cela, envisagez d&#39;utiliser des filtres pour obtenir les informations d&eacute;sir&eacute;es. Par exemple :</p>

<figure><img alt="Fictional&rsquo;s Flow Chart" src="../images/sections/03/SurveyQuestions-filter-questions-focus-fr.png" /></figure>

<h3>Pr&eacute;cision</h3>

<p>Tout le monde n&#39;interpr&eacute;tera pas tous les mots et tous les phras&eacute;s de la m&ecirc;me fa&ccedil;on, m&ecirc;me si la signification vous semble &eacute;vidente. Pour r&eacute;duire le risque de mauvaise interpr&eacute;tation de votre question, vous pouvez d&eacute;finir entre parenth&egrave;ses des termes ambigus ou expliquer le contexte si n&eacute;cessaire. Essayez &eacute;galement d&rsquo;&eacute;viter les formulations confuses, comme l&#39;utilisation de la double n&eacute;gation ou l&rsquo;utilisation de nombreuses propositions subordonn&eacute;es. Soyez enfin prudent quand vous utilisez des mots charg&eacute;s de sens ou qui ont des connotations fortement &eacute;motionnelles.</p>

<table class="custom yes-and-no">
	<tbody>
		<tr>
			<th>A faire</th>
			<th>A &eacute;viter</th>
		</tr>
		<tr>
			<td>
			<ul>
				<li>Avez-vous mang&eacute; de la cr&egrave;me glac&eacute;e au chocolat le mois dernier ?</li>
				<li>On ne devrait pas autoriser la glace avec de l&rsquo;arachide</li>
				<li>Les vendeurs de glace ne devraient pas pr&eacute;tendre qu&rsquo;ils ont des glaces sans arachide.</li>
			</ul>
			</td>
			<td>
			<ul>
				<li>Chemin rocheux, P&eacute;pite de chocolat menthe, Chocolat hollandais et la glace au Caramel Chaud sont les meilleures ventes de &laquo; Fictifs &raquo;. Avez-vous mang&eacute; une glace au chocolat le mois dernier ?</li>
				<li>La glace avec de l&rsquo;arachide devrait &ecirc;tre interdite.</li>
				<li>Les vendeurs de glace devraient accepter de ne vendre que des glaces sans arachide.</li>
			</ul>
			</td>
		</tr>
	</tbody>
</table>

<h3>Bri&egrave;vet&eacute;</h3>

<p>Vos questions doivent &ecirc;tre relativement courtes, sauf quand la formulation suppl&eacute;mentaire est absolument n&eacute;cessaire pour fournir le contexte ou clarifier la terminologie. Des questions longues et complexes peuvent rapidement devenir confuses pour les participants et augmenter les chances qu&#39;ils r&eacute;pondent sans comprendre parfaitement ce qu&#39;on leur demande, ou pire encore, qu&rsquo;ils passent directement &agrave; la question suivante ! Si votre question semble devenir trop longue, v&eacute;rifiez qu&rsquo;elle ne comporte pas d&rsquo;informations inutiles que vous pourriez enlever ou essayez de la d&eacute;couper en plusieurs questions plus petites. Autre solution, vous pouvez positionner un paragraphe court d&rsquo;explications qui sera s&eacute;par&eacute; de la question : de cette fa&ccedil;on les participants disposent de toutes les informations de fond n&eacute;cessaires et peuvent aussi comprendre facilement ce qui leur est demand&eacute;.</p>

<table class="custom yes-and-no">
	<tbody>
		<tr>
			<th>A faire</th>
			<th>A &eacute;viter</th>
		</tr>
		<tr>
			<td>Lister, s&rsquo;il vous plait, vos trois parfums favoris par ordre de pr&eacute;f&eacute;rence.</td>
			<td>Pouvez-vous, s&rsquo;il vous plait, nous dire quels parfums vous aimez et quel est votre parfum favori, puis le deuxi&egrave;me et le troisi&egrave;me ?</td>
		</tr>
	</tbody>
</table>

<h3>Questions partisanes et questions orientees</h3>

<p>Des questions partisanes ou des <a class="glossterm" href="glossary01.html#question-leading" target="_blank">questions orient&eacute;es</a> peuvent facilement biaiser vos r&eacute;ponses si vous ne portez pas plus d&#39;attention &agrave; vos formulations. &Eacute;vitez de donner trop d&#39;importance &agrave; vos affirmations et gardez un &oelig;il ext&eacute;rieur pour les questions qui cr&eacute;ent &quot;des effets de d&eacute;sirabilit&eacute; sociale&quot; pour lesquelles les personnes interrog&eacute;es r&eacute;pondront plus probablement selon ce que la soci&eacute;t&eacute; consid&egrave;re comme appropri&eacute; ou socialement et moralement acceptable.</p>


<table class="custom yes-and-no">
	<tbody>
		<tr>
			<th>A faire</th>
			<th>A &eacute;viter</th>
		</tr>
		<tr>
			<td>Etes-vous d&rsquo;accord que les vendeurs de glace dans notre ville devraient offrir des produits sans arachide ?</td>
			<td>Etes-vous d&rsquo;accord que les vendeurs de glace qui servent des produits avec arachide sont un grave danger pour le bien-&ecirc;tre de nos enfants ?</td>
		</tr>
	</tbody>
</table>

<p>Remarquez comment la deuxi&egrave;me question essaie d&#39;influencer la personne interrog&eacute;e en utilisant des expressions fortes ou affectives comme &quot;le grave danger.&quot; Vous devrez essayer de d&eacute;finir des questions aussi neutres que vous le pouvez : si la question sugg&egrave;re d&rsquo;elle-m&ecirc;me comment le participant devrait r&eacute;pondre, elle doit &ecirc;tre repens&eacute;e.</p>

<h3>A Few Final Things&hellip;</h3>

<p>Il reste au final quelques points &agrave; consid&eacute;rer quand vous d&eacute;finissez les questions de votre enqu&ecirc;te :</p>

<ul>
	<li>Quand cela est possible, variez le type de questions que vous utilisez pour garder l&rsquo;attention des personnes interrog&eacute;es tout au long de l&#39;enqu&ecirc;te. Vous avez une vari&eacute;t&eacute; de types de questions &agrave; votre disposition, m&eacute;langez-les si vous pouvez ! (Mais gardez vraiment &agrave; l&#39;esprit que chaque type de question a un but sp&eacute;cifique et vous donne des donn&eacute;es plus ou moins sp&eacute;cifiques)</li>
	<li>Pensez au fait que certains mots peuvent avoir des interpr&eacute;tations diff&eacute;rentes et souvenez-vous que les significations sont souvent incorpor&eacute;es dans la culture et la langue. Soyez sensible aux cultures diff&eacute;rentes si vous interrogez plusieurs groupes d&rsquo;une population.</li>
</ul>

<h2>Concevoir votre questionnaire</h2>

<p>Une fois que vous avez identifi&eacute; le but de votre enqu&ecirc;te et que vous avez choisi le type de questions que vous utiliserez, l&rsquo;&eacute;tape suivante est de concevoir le questionnaire lui-m&ecirc;me. Dans cette section, nous regarderons la structure, la disposition et l&#39;ordre des questions. Nonus parlerons aussi de quelques &eacute;l&eacute;ments cl&eacute;s &agrave; garder &agrave; l&#39;esprit une fois vous avez fini.</p>

<h3>Structure de questionnaire</h3>

<p>Vous souvenez-vous de vos cours d&rsquo;&eacute;cole primaire quand on vous disait que chaque essai devait avoir une introduction, un corps et une conclusion ? Les questionnaires doivent aussi avoir une certaine structure. Les parties majeures d&#39;un questionnaire incluent l&#39;introduction, le sujet principal, des transitions entre les sujets, des questions d&eacute;mographiques et la conclusion.</p>

<h3>Introduction</h3>

<p>Commencez toujours votre enqu&ecirc;te avec une introduction br&egrave;ve qui explique :</p>

<ul>
	<li>Le but de l&#39;enqu&ecirc;te;</li>
	<li>Qui la conduit;</li>
	<li>La nature volontaire de la participation de la personne interrog&eacute;e;</li>
	<li>Le respect de la confidentialit&eacute;; and</li>
	<li>the time required to complete the survey.</li>
</ul>

<h3>Sujets principaux</h3>

<p>G&eacute;n&eacute;ralement, il est pr&eacute;f&eacute;rable de d&eacute;buter avec des questions g&eacute;n&eacute;rales et poursuivre avec des questions plus sp&eacute;cifiques.</p>

<ul>
	<li>Poser des questions sur des faits objectifs avant de poser des questions plus subjectives.</li>
	<li>Ordonner les questions de la plus facile &agrave; la plus complexe.</li>
	<li>S&rsquo;assurer que la r&eacute;ponse &agrave; une question n&#39;a pas un impact sur la fa&ccedil;on dont le participant interpr&egrave;tera la question suivante.</li>
</ul>

<h3>Transitions Between Topics</h3>

<p>Utilisez des transitions entre les groupes de questions pour introduire un nouveau sujet ou un nouveau format. Par exemple : &quot;Les quelques questions suivantes sont en lien avec vos habitudes de visionnage t&eacute;l&eacute;. Choisissez, s&#39;il vous pla&icirc;t, la r&eacute;ponse qui d&eacute;crit le mieux votre situation.&quot;</p>

<h3>Questions d&eacute;mographiques</h3>

<p>&Agrave; moins que vous n&#39;utilisiez des questions d&eacute;mographiques comme un crit&egrave;re de filtre pour l&#39;&eacute;ligibilit&eacute; &agrave; l&#39;enqu&ecirc;te de la personne interrog&eacute;e, il est d&#39;habitude pr&eacute;f&eacute;rable de les mettre pr&egrave;s de la fin d&#39;un questionnaire. Des questions d&eacute;mographiques typiques incluent :</p>

<ul>
	<li>Genre;</li>
	<li>Age;</li>
	<li>Revenu;</li>
	<li>Nationalit&eacute; ou emplacement g&eacute;ographique;</li>
	<li>Enseignement (&eacute;ducation) and</li>
	<li>race or ethnicity.</li>
</ul>

<h3>Conclusion</h3>

<p>Remerciez les participants pour leur contribution et expliquez l&rsquo;apport de ces r&eacute;ponses &agrave; votre projet. R&eacute;affirmez le fait que leurs identit&eacute;s seront gard&eacute;es confidentielles et que les r&eacute;sultats seront rendus anonymes. Si vous le souhaitez, vous pouvez aussi inclure vos coordonn&eacute;es de contact au cas o&ugrave; les participants auraient des questions suppl&eacute;mentaires li&eacute;es &agrave; l&#39;enqu&ecirc;te et &eacute;galement leur demander leurs coordonn&eacute;es si vous offrez une r&eacute;tribution pour remplir le questionnaire.</p>

<p>Si vous contactez des personnes interrog&eacute;es &agrave; l&#39;avance pour les inviter &agrave; participer &agrave; l&#39;enqu&ecirc;te, vous devrez aussi expliquer pourquoi elles ont &eacute;t&eacute; choisies pour participer, quand l&#39;enqu&ecirc;te aura lieu et comment elles peuvent y avoir acc&egrave;s.</p>

<h3>Disposition g&eacute;n&eacute;rale</h3>

<p>Il y a quelques bonnes r&egrave;gles &agrave; suivre pour concevoir la disposition de votre enqu&ecirc;te :</p>

<ul>
	<li>Mettez votre introduction et conclusion sur des pages s&eacute;par&eacute;es de vos questions.</li>
	<li>Le format devra &ecirc;tre facile &agrave; suivre et &agrave; comprendre.</li>
	<li>V&eacute;rifiez que les questions-filtre fonctionnent comme pr&eacute;vu.</li>
	<li>Restez fid&egrave;le aux questions qui respectent vos buts plut&ocirc;t que poser toutes les questions auxquelles vous pouvez penser. En g&eacute;n&eacute;ral, les taux de r&eacute;ponse aux questionnaires ont tendance &agrave; diminuer quand ceux-ci durent trop longtemps.</li>
	<li>Laissez assez de place pour que les personnes interrog&eacute;es puissent r&eacute;pondre aux questions ouvertes.</li>
	<li>Assurez-vous d&#39;inclure toutes les r&eacute;ponses probables aux questions ferm&eacute;es, y compris le choix &quot;Autre&quot; dans le cas o&ugrave; les personnes interrog&eacute;es estiment qu&#39;aucune des r&eacute;ponses fournies ne leur convient. Si n&eacute;cessaire, incluez aussi les options &quot;Non Applicable&quot; et &quot;Ne souhaite pas r&eacute;pondre&quot;.</li>
	<li>Assurez-vous que les questions s&rsquo;enchainent bien et suivent une progression logique. Commencez l&#39;enqu&ecirc;te par des questions g&eacute;n&eacute;rales et poursuivez avec des questions plus sp&eacute;cifiques ou plus complexes. Terminez avec des sujets d&eacute;mographiques g&eacute;n&eacute;raux (par exemple, l&#39;&acirc;ge, le genre, etc), &agrave; moins que vous n&#39;utilisiez ceux-ci comme un crit&egrave;re de filtre pour l&#39;&eacute;ligibilit&eacute; &agrave; l&#39;enqu&ecirc;te de la personne interrog&eacute;e. Groupez les questions par th&egrave;me ou sujet.</li>
</ul>

<h2>Quelques consid&eacute;rations compl&eacute;mentaires</h2>

<h3>Pensez a votre public</h3>

<p>Pensez aux personnes qui participeront &agrave; votre enqu&ecirc;te. Disons, par exemple, que vous voulez conduire une enqu&ecirc;te dans une &eacute;cole o&ugrave; beaucoup d&#39;&eacute;tudiants ont r&eacute;cemment immigr&eacute; avec leurs familles dans le pays en tant que r&eacute;fugi&eacute;s et ne parlent pas encore correctement la langue locale.</p>

<p>En quelle(s) langue(s) devrez-vous conduire l&#39;enqu&ecirc;te ? Devriez-vous uniquement r&eacute;aliser votre enqu&ecirc;te dans la langue locale ou le pr&eacute;parer en plusieurs langues ? Si vous pr&eacute;parez diff&eacute;rentes versions de l&#39;enqu&ecirc;te, qui assurera la coh&eacute;rence entre les traductions ?</p>

<p>Quel vocabulaire devrez-vous utiliser ? Certains &eacute;tudiants peuvent ne pas r&eacute;pondre au questionnaire dans leur langue maternelle. Vous voudrez probablement utiliser un vocabulaire assez basique, particuli&egrave;rement si la population concern&eacute;e est importante. Nonus n&#39;avons pas sp&eacute;cifi&eacute; leur &acirc;ge, mais il serait utile de prendre en compte &eacute;galement cette information en choisissant les termes utilis&eacute;s.</p>

<h3>Ecrire clairement et distinctement instructions et questions</h3>

<p>Il est important que vos instructions et questions soient simples et coh&eacute;rentes. Vous voulez vous assurer que tout le monde comprenne et interpr&egrave;te le questionnaire de la m&ecirc;me fa&ccedil;on. Par exemple, observez la diff&eacute;rence entre les deux questions ci-dessous.</p>

<ul>
	<li>Quand avez-vous remarqu&eacute; les premiers sympt&ocirc;mes ? ______________________</li>
	<li>Quand avez-vous remarqu&eacute; les premiers sympt&ocirc;mes (par exemple, MM/AAAA) ? __ __ / __ __ __ __</li>
</ul>

<p>Si vous voulez que la question soit ouverte &agrave; l&#39;interpr&eacute;tation des personnes interrog&eacute;es et qu&rsquo;elles puissent donner des r&eacute;ponses comme, &quot;Au retour de mon dernier voyage,&quot; alors la premi&egrave;re option est correcte. Cependant, si vous vous demandez vraiment depuis combien de temps la personne a &eacute;prouv&eacute; des sympt&ocirc;mes, la deuxi&egrave;me version de la question permet &agrave; la personne interrog&eacute;e de savoir que vous &ecirc;tes int&eacute;ress&eacute; par la p&eacute;riode sp&eacute;cifique (ann&eacute;e, mois) &agrave; laquelle les premiers sympt&ocirc;mes sont arriv&eacute;s.</p>

<h3>Pr&ecirc;tez attention &agrave; la longueur</h3>

<p>Nonnus voulons souvent collecter autant d&#39;informations que possible en r&eacute;alisant une enqu&ecirc;te. Cependant, r&eacute;pondre &agrave; des enqu&ecirc;tes extr&ecirc;mement longues devient rapidement ennuyeux. Des participants fatigu&eacute;s ou ennuy&eacute;s font diminuer le taux de r&eacute;ponse au questionnaire. Au bout d&rsquo;un moment, vous risquez d&#39;obtenir des r&eacute;ponses impr&eacute;cises des participants qui essaient de compl&eacute;ter l&#39;enqu&ecirc;te aussi rapidement que possible. En passant en revue votre questionnaire, demandez-vous, &quot;ai-je vraiment besoin de cette question ? Apportera-t-elle des informations de valeur qui justifient de r&eacute;alisation de cette enqu&ecirc;te ?&quot;</p>

<h3>Suivez la progession</h3>

<p>Il est bon d&#39;indiquer la progression aux personnes interrog&eacute;es en fonction de leur avanc&eacute;e dans le questionnaire. Cela leur donne une id&eacute;e de leur progression et les encourage &agrave; continuer. Dans une enqu&ecirc;te en ligne, une barre de progression comme celle ci-dessous pourrait &ecirc;tre plac&eacute;e au d&eacute;but de chaque nouvelle section.</p>

<figure><img alt="Fictional&rsquo;s Flow Chart" src="../images/sections/03/SurveyQuestions-progress-bar-fr.png" /></figure>

<p>Dans une enqu&ecirc;te de terrain, l&#39;enqu&ecirc;teur peut simplement annoncer des informations comme :</p>

<ul>
	<li>&quot;Nonus sommes &agrave; mi-chemin.&quot;</li>
	<li>&quot;Il reste seulement deux sections &agrave; compl&eacute;ter.&quot;</li>
	<li>&quot;Juste quelques questions compl&eacute;mentaires.&quot;</li>
</ul>

<h3>Entrainer les enqu&ecirc;teurs</h3>

<p>Si vous menez une enqu&ecirc;te sur le terrain, vous devrez pr&eacute;parer vos enqu&ecirc;teurs &agrave; l&rsquo;avance, expliquer leurs t&acirc;ches et vous assurer qu&#39;ils comprennent toutes les questions correctement. Vous pouvez aussi les superviser quand ils conduisent leur premi&egrave;re enqu&ecirc;te pour contr&ocirc;ler la qualit&eacute;.</p>

<h3>Pre-tester le questionnaire</h3>

<p>Pr&eacute;-tester signifie tester votre enqu&ecirc;te avec quelques participants initiaux avant de sortir officiellement sur le terrain. Ceci vous permet d&rsquo;avoir un retour d&#39;information pour corriger les probl&egrave;mes que vous pourriez avoir avec la longueur, l&#39;ordre et la formulation des questions. Parfois cette &eacute;tape est pass&eacute;e quand un d&eacute;lai serr&eacute; est &agrave; respecter, mais vous ne devriez pas sous-estimer sa valeur. Cela peut au final vous faire gagner beaucoup de temps et d&#39;argent.</p>

<h3>Rendez les reponses anonymes</h3>

<p>Nonnus avons bri&egrave;vement mentionn&eacute; l&#39;anonymisation des r&eacute;ponses plus t&ocirc;t quand nous avons parl&eacute; de la structure de questionnaire. Parfois, les personnes interrog&eacute;es ont peur de donner une r&eacute;ponse honn&ecirc;te de peur qu&#39;on puisse tracer leurs r&eacute;ponses. En rendant anonyme les r&eacute;ponses vous obtiendrez des donn&eacute;es plus pr&eacute;cises en prot&eacute;geant l&#39;identit&eacute; de vos participants. Il peut arriver que vous ayez besoin de garder les coordonn&eacute;es de contact des personnes interrog&eacute;es associ&eacute;es &agrave; leurs r&eacute;ponses, comme quand vous menez une enqu&ecirc;te de suivi et que vous devez conna&icirc;tre quelles &eacute;taient les r&eacute;ponses initiales des participants. Soyez clair dans votre enqu&ecirc;te si vous rendez anonymes les r&eacute;ponses ou pas ainsi les personnes interrog&eacute;es savent si vous stockez leurs coordonn&eacute;es de contact.</p>

<p>Il est conseill&eacute; de rendre anonyme les r&eacute;sultats que vous pr&eacute;sentez, que les donn&eacute;es que vous avez collect&eacute;es soient anonymes ou non.</p>

<h3>Remunerations</h3>

<p>L&#39;utilisation de r&eacute;mun&eacute;rations peut &ecirc;tre litigieuse. Vous voulez encourager autant de personnes que possible &agrave; participer &agrave; votre enqu&ecirc;te, mais vous ne voulez pas que les gens remplissent votre enqu&ecirc;te uniquement pour obtenir une r&eacute;compense. Des r&eacute;compenses trop importantes peuvent aussi augmenter les pr&eacute;occupations &eacute;thiques de contrainte de participation (c&#39;est-&agrave;-dire, avoir des individus qui participent &agrave; l&rsquo;enqu&ecirc;te du fait de la r&eacute;compense alors que sans cette r&eacute;compense, ils refuseraient de r&eacute;pondre en raison d&rsquo;un inconfort personnel, du risque de r&eacute;percussions, etc).</p>

<p>Si l&#39;enqu&ecirc;te est longue et consommatrice de temps, envisagez de donner une petite r&eacute;compense quand une personne interrog&eacute;e compl&egrave;te le questionnaire. Si l&#39;enqu&ecirc;te est plus courte, envisagez de faire un tirage au sort parmi les personnes qui compl&egrave;tent l&#39;enqu&ecirc;te et acceptent de fournir leurs coordonn&eacute;es de contact.</p>

<h2>En conclusion</h2>

<p>Comme vous l&rsquo;avez remarqu&eacute;, il y a un certain nombre de facteurs que vous devez prendre en compte quand vous concevez votre enqu&ecirc;te et d&eacute;cidez quels types de question utiliser. La cr&eacute;ation d&#39;enqu&ecirc;te peut sembler intimidante au premier abord, mais souvenez-vous que ceci est la base de votre analyse de donn&eacute;es. R&eacute;ussir cette &eacute;tape rendra plus tard le reste de votre travail beaucoup plus facile.</p>

<p>Pour plus d&rsquo;informations, vous pouvez consulter notre section <a href="app01.html" target="_blank">Ressources</a>.</p>
</section>
</section>
